{
  "_id": 30049383,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:32:29.015Z",
  "appealsEndDate": "2015-03-29T22:43:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Styx Dashboard Configuration Flow UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p>Welcome to <strong>Styx Dashboard Configuration Flow UI Prototype Challenge</strong></p>\n\n<p>For this UI Prototype challenge, we need your help update existing prototype by create additional &ldquo;Configuration&rdquo; page flow. FYI: Existing prototype use fluid layout on Desktop and Tablet Platform. As part of this challenge task you need make sure every pages running okay in required browsers.</p>\n\n<p>Read more details requirements below</p>\n\n<p>&nbsp;</p>\n",
  "digitalRunPoints": 990,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30049383",
  "event": {
    "id": 3442,
    "description": "2015 topcoder Open",
    "shortDescription": "tco15"
  },
  "finalFixEndDate": "2015-03-31T15:26:00.000Z",
  "finalSubmissionGuidelines": "<p><strong>Attachment Files</strong><br />\nfull-version-prototype.zip - Existing UI Prototype as Base Updates<br />\nstoryboard.zip - Configuration Flow Storyboard (Source file use Adobe Illustrator Fomat File (.ai))<br />\n<br />\n<strong>UI Prototype Requirements:<br />\nImportant!</strong><br />\n- This UI Prototype challenge tasks are only described in this specification<br />\n- Ignore how header bar look inside storyboard design, we need stick with current header in existing prototype<br />\n- Make sure your submission still run okay in required Desktop and Tablet platform<br />\n- You can ignore existing CSS and HTML validation error<br />\n- There are some updates not captured in storyboard look and just described in this challenge spec. Let us know if you need clarification!<br />\n- There might be final fixes for winner about add/remove alert in some sections after client review</p>\n\n<p><strong>0. Before you build Configuration Flow</strong><br />\n- Need set active state after user click the &ldquo;Alert&rdquo; icon when flyout out still show<br />\n- System Overview page &gt; &ldquo;Security KPI&rdquo;, on 1024px width and &ldquo;Alert&rdquo; flyout opened, we need progress bar show fluid width and always placed inside the box<br />\n- Alert flyout, hover above &ldquo;Error&rdquo; and &ldquo;Warning&rdquo; list need show white color text for time information<br />\n- We add 1 button below &ldquo;System Counts&rdquo; slider, that is for &ldquo;Print&rdquo;<br />\n- Home icon can be removed<br />\n- Print icon need let user go to Print Preview for related page. Read more detail information below</p>\n\n<p><strong>1. First Time Configuration</strong><br />\nscreenshot: styx_p1-1-1.png<br />\n- After user logged in, we need show &ldquo;Personal Configuration&rdquo; on page<br />\n- This is how form look after user type each field (screenshot: styx_p1-1-2.png)<br />\n- There&rsquo;s a dropdown, here&rsquo;s the options need displayed:<br />\n-- System Overview<br />\n-- Area Utilization<br />\n-- OnGuard Server<br />\n-- Database Server<br />\n-- CommServerWC1<br />\n-- CommServerMA1<br />\n-- CommServerEC1<br />\n- System Overview need selected by default.<br />\n- When user change the dropdown, another time user logged in, need take to related page based on selected option.<br />\n- User can change &ldquo;Personal Configuration&rdquo; when click the User icon and username in right side of header bar (screenshot: styx_p1-8.png)<br />\n- You need build function to capture data for all field<br />\n- Update &ldquo;Email name&rdquo; into &ldquo;First Name&rdquo;<br />\n- When user type different &ldquo;First Name&rdquo; and &ldquo;Last Name&rdquo;, need captured in the right header bar across the page<br />\n- Click &ldquo;Save&rdquo; and &ldquo;Cancel&rdquo; button need hide the modal window</p>\n\n<p><strong>2. Live and Historical Mode<br />\nscreenshot: styx_p1-2.png</strong><br />\n- We need keep same placement and style of date picker like existing prototype look above blue light bar<br />\n- Update existing icon in prototype with &ldquo;pulse&rdquo; shape icon<br />\n- Use icon with rounded shape like this screenshot (00.New-Look.png)<br />\n- By default the icon will be in live mode which is not greyed. The date range will be today -7 days by default.<br />\n- In this mode all pages can have different dates selected by the user as they navigate through the different pages.<br />\n- Activating the &ldquo;historical mode by selecting the icon which will turn grey causing all pages to remain in the same date range duration.<br />\n- When a user navigates to other pages the dates stay in the same range allowing for analysis of data in the same range to look for similar trends.<br />\n- Deselecting the icon back to live mode will change back to today -7days<br />\n- Icon active state turning off (screenshot: styx_p1-3.png)<br />\n- Use existing style when user click datepicker (screenshot: styx_p1-4.png)</p>\n\n<p><strong>3. Alert/Notification Flyout</strong><br />\nscreenshot: styx_p1-5.png<br />\n- We need keep use existing &ldquo;Alert&rdquo; icon (bell shape icon) inside provided prototype. Ignore storyboard look<br />\n- By default all &ldquo;Alert&rdquo; icon and text need show grey color<br />\n- Once user set up the Alert for any option, then &ldquo;Alert&rdquo; icon and text turn into green colored<br />\n- This &ldquo;Alert flyout&rdquo; look when user click for &ldquo;Alert&rdquo; icon next to &ldquo;System Performance&rdquo; title<br />\n- By default &ldquo;threshold&rdquo; graph, &ldquo;warning&rdquo; and &ldquo;alert&rdquo; row show grey colored icon and text by default. Also Threshold need use transparent style<br />\n- Each icons need use toggle function<br />\n- Once every icon turn on, the threshold need become active (not transparent) (screenshot: styx_p1-6.png)<br />\n- Match different text color like storyboard look, yellow for warning and red for error states<br />\n- All the configuration of the actual alerts will be done in the configuration screens which we are still working through.<br />\n- Save Alert need close flyout and change the &ldquo;Alert&rdquo; icon into green if there&rsquo;s selected notifications (screenshot: styx_p1-7.png)<br />\n- Cancel button need hide the modal and the &ldquo;Alert&rdquo; icon remain use grey colored if there&rsquo;s no selected notifications<br />\n- You also need add for &ldquo;Abnormal hardware&rdquo; and &ldquo;Database backups&rdquo;. icons need placed in the right side of title Check across the page<br />\n- Click the icon need show different flyout content (screenshot: styx_p1-9.png)<br />\n- This flyout just need show 1 threshold<br />\n- Only need toggle 2 icons<br />\n- Save alert need turn to green, if user select some option<br />\n- Cancel button need hide the flyout</p>\n\n<p><strong>4. Print Preview</strong><br />\nscreenshot: styx_p1-10.png<br />\n- We need create &ldquo;Print Preview&rdquo; for main content of each pages<br />\n- Need to make sure the preview takes into consideration the historical graph mode and captures the data in the range specified.<br />\n- Feel free use any plugin to build this &ldquo;Print Preview&rdquo; function<br />\n- Print preview only capture main content area<br />\n- You need make sure click print preview in every pages render correct screen.<br />\n- Is page thumbnails possible to build? Let us know.<br />\n- Let us know if storyboard guideline not possible to build.</p>\n\n<p><strong>5. System Configuration</strong><br />\n<strong>Important: </strong>New Navigation should be performed in a modal window and be sized 80% of the actual screen size. (00.Configuration-Modal-Window.png)<br />\n<strong>Important: </strong>Follow these sidebar menu navigation:<br />\n-- General<br />\n-- Threshold Configuration<br />\n-- Error Log Configuration<br />\n-- Trend Configuration<br />\n-- Alarm Configuration<br />\n- System Configuration triggered from the &ldquo;Gear&rdquo; icon in top of page (screenshot: styx_p2-1.png)<br />\n- We need show System Configuration as modal window format instead of page like storyboard look<br />\n- You can see page use multi level tab solution<br />\n- Match different active and inactive style for multi level tab<br />\n<br />\n<strong>1). General Tab</strong><br />\n- General tab consist of these sub-tabs:</p>\n\n<p>a). Alert Recipient Sub-Tab<br />\nscreenshot: styx_p3-1-1.png<br />\n- Icons for the Alert Recipients should be replaced with the current icon used for the alert (Bell shape icon). Re-use same icon everywhere in your prototype<br />\n- Search input placed on top of this screen<br />\n- User can remove each alert by click &ldquo;x&rdquo; button next to icons<br />\n- When user click &ldquo;x&rdquo; button in the right side of row, need remove related row<br />\n- User can click &ldquo;Edit&rdquo; link in every row, then show up the User Alert modal window (screenshot: styx_p3-1-2.png)<br />\n- Inside the modal window, there&rsquo;s toggle links for &ldquo;Show only Users alert&rdquo; and &ldquo;Show Full List&rdquo;<br />\n- &ldquo;Show only Users alert&rdquo; as active link, you can put dead link for &ldquo;Show Full List&rdquo;<br />\n- User can collapse/expand each bar click the title bar<br />\n- On User information, show form input like storyboard look<br />\n- For page related alert you can use same data for simulation<br />\n- Make sure toggle function for the mail and message icons<br />\n- &ldquo;Cancel&rdquo;, &ldquo;Save&rdquo; and &ldquo;x&rdquo; buttons need hide the modal window</p>\n\n<p>b). Alarm Configuration Sub-Tab<br />\n- This is alarm Configuration sub-tab<br />\n- You need show another children tabs, they are:</p>\n\n<p>Evaluation and Setting Children Tab<br />\nscreenshot: styx_p3-2-1.png<br />\n- This tab need displayed dropdown on top<br />\n- Show dummy content for now<br />\n- Progress bar placed below dropdown<br />\n- Use animation effect when load the progress bar<br />\n- Red text message displayed in the bottom<br />\n- User can change Setting options by click the radio buttons</p>\n\n<p>Evaluation with Threshold Children Tab<br />\n- For this tab, you can re-use same layout like this (screenshot: styx_p3-2-2.png)<br />\n- Show different content for this tab</p>\n\n<p>Evaluation without Threshold Children Tab<br />\nscreenshot: styx_p3-2-2.png<br />\n- This tab show table layout<br />\n- User can scrolling the table<br />\n- User can checked each checkboxes<br />\n- Click Checkbox on top need select all checkboxes<br />\n- See buttons on top is disabled by default<br />\n- Once user checked the checkbox, each checkboxes need enable (screenshot: styx_p3-2-3.png)<br />\n- All buttons on top of header can be dead link for now</p>\n\n<p>Inactive Alarms Children Tab<br />\n- For this tab, you can re-use same layout like this (screenshot: styx_p3-2-2.png)<br />\n- Show different content for this tab</p>\n\n<p>c). Area Utilization Monitor Sub-Tab<br />\nscreenshot: styx_p3-4-1.png<br />\n- This tab show table list format<br />\n- User can remove related row by click &ldquo;x&rdquo; button<br />\n- Show alternating row in page<br />\n- &ldquo;Edit&rdquo; can be dead link<br />\n- Click &ldquo;Add&rdquo; links need show up the modal window (screenshot: styx_p3-4-2.png)<br />\n- User can type on title input<br />\n- Also there&rsquo;s multi-select below the input<br />\n- User can add selected option to the right side<br />\n- Also click &ldquo;x&rdquo; button need revert back to the left side<br />\n- &ldquo;Cancel&rdquo;, &ldquo;Add New Area&rdquo; and &ldquo;x&rdquo; button need hide the modal</p>\n\n<p><strong>2). Threshold Configuration</strong><br />\n- Threshold Configuration tab consist of these sub-tabs:</p>\n\n<p>a). Total System Counts Sub-Tab<br />\nscreenshot: styx_p4-1-1.png<br />\n- When user focus/click in both input or dropdown, you need show grey background color<br />\n- For the top row, focus/click input or dropdown, need show &ldquo;Warning&rdquo; tooltip in the left side<br />\n- For the bottom row, focus/click input or dropdown, need show &ldquo;Error&rdquo; tooltip in the left side (screenshot: styx_p4-1-2.png)<br />\n- &ldquo;FYI&rdquo; Reader with grey color threshold mean that device in disable state<br />\n- These inputs just need support numbers format<br />\n- User can slide Duration time, and need reflected to the input in the left side<br />\n- User also can type in the input and reflected in the slide bar<br />\n- below the slider, there&rsquo;s toggle option to change time duration<br />\n- Click &ldquo;x&rdquo; button need hide the flyout<br />\n- Apply same solution for all sections (screenshot: styx_p4-1-3.png)<br />\n- Change the value need change dropdown text into blue colored (screenshot: styx_p4-1-4.png)</p>\n\n<p>b). System Overview Sub-Tab<br />\nscreenshot: styx_p4-2.png<br />\n- For this tab, each section need collapsible functions<br />\n- For &ldquo;System Performance&rdquo; section, inputs need show &ldquo;%&rdquo; in the right side of input<br />\n- Also show different &ldquo;MB&rdquo; in the right side of input for sections in the bottom<br />\n- Also, threshold show rounded bar placement above the threshold<br />\n- When change the the input, need reflected to related threshold.<br />\n- Show correct placement from 0% to 100% range that&rsquo;s mean in threshold, you need build from left to right<br />\n- User also need able to drag the rounded bar in threshold<br />\n- You need show same function when user click/focus on &ldquo;Error/Warning&rdquo; row<br />\n- Match data for each threshold</p>\n\n<p>c). Area Utilization Sub-Tab<br />\nscreenshot: styx_p4-3.png<br />\n- <strong>Important!:</strong> We need put Area Utilization tab of the general tab be implemented to this tab. You can place the table on top of this tab look<br />\n- <strong>Important!: </strong>We also need &ldquo;Add New&rdquo; link in the right side of collapsible &ldquo;Area Utilization&rdquo; tile as it is on the Error Log Monitor. (screenshot: styx_p4-4-1.png).<br />\n- This tab only need show 1 collapsible section<br />\n- You need show same function when user click/focus on &ldquo;Error/Warning&rdquo; row<br />\n- Match data for each threshold<br />\n<br />\nd). OnGuard Server Sub-Tab<br />\nscreenshot: styx_p4-4-1.png<br />\n- Each sections are collapsible<br />\n- Re-use completed &ldquo;System Performance&rdquo; threshold function<br />\n- For &ldquo;OnGuard&rdquo; alarm section, user can click each links to show up modal windows (screenshot: styx_p4-4-2.png)<br />\n- Show table list format<br />\n- Click &ldquo;close&rdquo; link need hide the modal</p>\n\n<p>e). Database Server Sub-Tab<br />\nscreenshot: styx_p4-5.png<br />\n- Each sections are collapsible<br />\n- Re-use completed &ldquo;System Performance&rdquo; threshold function<br />\n- Match every threshold content like storyboard look<br />\n<br />\nf). Communication Server Sub-Tab<br />\nscreenshot: styx_p4-6-1.png<br />\n- <strong>Important!:</strong> &ldquo;Processor&rdquo; threshold can be removed.<br />\n- <strong>Important!:</strong> &ldquo;Server Throughput&rdquo; and &ldquo;Server load&rdquo; can be removed from the threshold configurations<br />\n- <strong>Important!:</strong> On the communication server page/s, a setting needs to be configured for the &ldquo;No events generated in xx sec/mins. User should be able to select seconds or minutes and then assign a numerical value.&nbsp; This was left out of the storyboard.<br />\n- Notice &ldquo;Comm Server Log File Growth&rdquo; show different content format<br />\n- Click Add New button need show flyout (screenshot: styx_p4-6-3.png)<br />\n- Browse button need open browser upload form<br />\n- User can type on Title input<br />\n- Add New Error Log need show additional threshold and form configuration<br />\n- Cancel button need hide the flyout<br />\n- Click Edit button need show editable flyout (screenshot: styx_p4-6-3.png)<br />\n- Simulate how user can remove related threshold<br />\n<br />\n<strong>3). Error Log Configuration</strong><br />\nscreenshot: styx_p5-1.png<br />\n- This is Error Log Configuration look and feel<br />\n- There&rsquo;s dropdown placed in the top side<br />\n- You need build the chart by re-use existing chart library<br />\n- Match how current chart look in prototype<br />\n- Below the chart, there&rsquo;s 3 columns for &ldquo;onGuard Server Log&rdquo;, &ldquo;Database Server&rdquo; and &ldquo;Communication Server&rdquo;<br />\n- All list need show rounded with border, ignore solid button look<br />\n- When hover need show &ldquo;x&rdquo; and &ldquo;edit&rdquo; button<br />\n- Click the &ldquo;x&rdquo; button need remove related list<br />\n- Add Log button need show the flyout (screenshot: styx_p5-1.png)</p>\n\n<p><strong>4). Trend Configuration</strong><br />\nscreenshot: styx_p6.png<br />\n- This is Trend Configuration look and feel<br />\n- User can change the duration by click dropdown menu<br />\n- You can re-use completed function for slide bar<br />\n- Show checkbox in the bottom<br />\n- Click the label also need checked on/off the checkbox</p>\n\n<p>Client Priorities (The items that are considered highest prototype priorities)<br />\n- Creating quality and efficient HTML/CSS3 code that works in all the requested browsers.<br />\n- All elements should be Pixel Precisions, pay attention to padding, margin, line-height, etc.<br />\n- Matching the storyboards (as close as possible) across the required browsers.<br />\n- Documentation of your prototype</p>\n\n<p><strong>CODE REQUIREMENTS:<br />\nHTML5</strong><br />\n- Provide comments on the page elements to give clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts or errors.<br />\nElement and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Use semantically correct tags- use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- No inline CSS styles- all styles must be placed in an external stylesheet.<br />\n- Validate your code- reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n<br />\n<strong>CSS3</strong><br />\n- Use CSS3 Media Queries to load different styles for each page and don&#39;t build different page for different device/layout.<br />\n- Provide comments on the CSS code. We need CSS comments to give a clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all CSS so developers can follow the code.<br />\n- All CSS naming should not have any conflicts.<br />\n- As possible use CSS3 style when create all styling.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to lay out your page. Only use table tags for tables of data/information and not for page layout.</p>\n\n<p><strong>Javascript</strong><br />\n- All JavaScript must not have a copyright by a third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.</p>\n\n<p><strong>Images</strong><br />\n- Images should be properly compressed while still having good visual quality.<br />\n- Please use best practice repetition usage of background based image.<br />\n- Please use sprites when using icons for your submission.</p>\n\n<p><strong>Windows &amp; Mac OS</strong><br />\n- Safari latest version<br />\n- Firefox latest version<br />\n- Chrome latest version<br />\n<br />\n<strong>Tablet/Mobile</strong><br />\n- Safari Browsers on iPad (Landscape and Portrait View)</p>\n",
  "forumId": 28695,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=28695",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 18,
  "numberOfSubmissions": 1,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-03-20T17:19:00.000Z",
      "actualStartTime": "2015-03-20T17:19:00.000Z",
      "scheduledEndTime": "2015-03-20T17:21:00.000Z",
      "actualendTime": "2015-03-20T17:21:00.000Z",
      "_id": "5813293d550dfb3b52b60c9f"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2015-03-20T17:21:00.000Z",
      "actualStartTime": "2015-03-20T17:21:00.000Z",
      "scheduledEndTime": "2015-03-20T22:26:00.000Z",
      "actualendTime": "2015-03-20T22:26:00.000Z",
      "_id": "5813293d550dfb3b52b60c9e"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2015-03-20T22:26:00.000Z",
      "actualStartTime": "2015-03-20T22:26:00.000Z",
      "scheduledEndTime": "2015-03-22T22:26:00.000Z",
      "actualendTime": "2015-03-22T22:26:00.000Z",
      "_id": "5813293d550dfb3b52b60c9d"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-03-20T22:33:00.000Z",
      "actualStartTime": "2015-03-20T22:33:00.000Z",
      "scheduledEndTime": "2015-03-26T22:25:00.000Z",
      "actualendTime": "2015-03-26T22:25:00.000Z",
      "_id": "5813293d550dfb3b52b60c9c"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2015-03-26T22:25:00.000Z",
      "actualStartTime": "2015-03-26T22:25:00.000Z",
      "scheduledEndTime": "2015-03-27T07:44:00.000Z",
      "actualendTime": "2015-03-27T07:44:00.000Z",
      "_id": "5813293d550dfb3b52b60c9b"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2015-03-27T07:44:00.000Z",
      "actualStartTime": "2015-03-27T07:44:00.000Z",
      "scheduledEndTime": "2015-03-29T04:45:00.000Z",
      "actualendTime": "2015-03-29T04:45:00.000Z",
      "_id": "5813293d550dfb3b52b60c9a"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2015-03-29T04:45:00.000Z",
      "actualStartTime": "2015-03-29T04:45:00.000Z",
      "scheduledEndTime": "2015-03-29T17:41:00.000Z",
      "actualendTime": "2015-03-29T17:41:00.000Z",
      "_id": "5813293d550dfb3b52b60c99"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2015-03-29T17:41:00.000Z",
      "actualStartTime": "2015-03-29T17:41:00.000Z",
      "scheduledEndTime": "2015-03-29T22:43:00.000Z",
      "actualendTime": "2015-03-29T22:43:00.000Z",
      "_id": "5813293d550dfb3b52b60c98"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2015-03-29T22:43:00.000Z",
      "actualStartTime": "2015-03-29T22:43:00.000Z",
      "scheduledEndTime": "2015-03-30T05:34:00.000Z",
      "actualendTime": "2015-03-30T05:34:00.000Z",
      "_id": "5813293d550dfb3b52b60c97"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-03-30T05:34:00.000Z",
      "actualStartTime": "2015-03-30T05:34:00.000Z",
      "scheduledEndTime": "2015-03-30T15:29:00.000Z",
      "actualendTime": "2015-03-30T15:29:00.000Z",
      "_id": "5813293d550dfb3b52b60c96"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-03-30T15:29:00.000Z",
      "actualStartTime": "2015-03-30T15:29:00.000Z",
      "scheduledEndTime": "2015-03-30T23:39:00.000Z",
      "actualendTime": "2015-03-30T23:39:00.000Z",
      "_id": "5813293d550dfb3b52b60c95"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-03-31T17:33:00.000Z",
      "actualStartTime": "2015-03-31T17:33:00.000Z",
      "scheduledEndTime": "2015-04-08T05:35:00.000Z",
      "actualendTime": "2015-04-08T05:35:00.000Z",
      "_id": "5813293d550dfb3b52b60c94"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-03-30T23:39:00.000Z",
      "actualStartTime": "2015-03-30T23:39:00.000Z",
      "scheduledEndTime": "2015-03-31T15:26:00.000Z",
      "actualendTime": "2015-03-31T15:26:00.000Z",
      "_id": "5813293d550dfb3b52b60c93"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-03-31T15:26:00.000Z",
      "actualStartTime": "2015-03-31T15:26:00.000Z",
      "scheduledEndTime": "2015-03-31T17:33:00.000Z",
      "actualendTime": "2015-03-31T17:33:00.000Z",
      "_id": "5813293d550dfb3b52b60c92"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2015-03-20T22:26:00.000Z",
  "prize": [
    2200,
    1100
  ],
  "projectId": 7778,
  "registrants": [
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2015-03-20T22:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c91"
    },
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2015-03-20T23:20:00.000Z",
      "submissionDate": "2015-03-26T18:13:00.000Z",
      "rating": "2040",
      "colorStyle": "color: #DDCC00",
      "_id": "5813293d550dfb3b52b60c90"
    },
    {
      "handle": "Michael.Mueller",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T00:45:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c8f"
    },
    {
      "handle": "citi",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T01:32:00.000Z",
      "submissionDate": null,
      "rating": "945",
      "colorStyle": "color: #00A900",
      "_id": "5813293d550dfb3b52b60c8e"
    },
    {
      "handle": "lintc",
      "reliability": "0%",
      "registrationDate": "2015-03-21T01:45:00.000Z",
      "submissionDate": null,
      "rating": "1756",
      "colorStyle": "color: #DDCC00",
      "_id": "5813293d550dfb3b52b60c8d"
    },
    {
      "handle": "cupuabis",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T03:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c8c"
    },
    {
      "handle": "Trapti333",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T04:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c8b"
    },
    {
      "handle": "srajas",
      "reliability": "13%",
      "registrationDate": "2015-03-21T04:45:00.000Z",
      "submissionDate": null,
      "rating": "1314",
      "colorStyle": "color: #6666FF",
      "_id": "5813293d550dfb3b52b60c8a"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T04:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c89"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T06:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c88"
    },
    {
      "handle": "nanayajsjs",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T11:54:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c87"
    },
    {
      "handle": "kinf1",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T13:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c86"
    },
    {
      "handle": "FArIZzX77",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T13:20:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c85"
    },
    {
      "handle": "atry",
      "reliability": "n/a",
      "registrationDate": "2015-03-21T17:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c84"
    },
    {
      "handle": "mamta_thakur",
      "reliability": "n/a",
      "registrationDate": "2015-03-22T04:27:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c83"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2015-03-22T11:52:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813293d550dfb3b52b60c82"
    },
    {
      "handle": "arch_angel",
      "reliability": "33%",
      "registrationDate": "2015-03-22T13:55:00.000Z",
      "submissionDate": null,
      "rating": "873",
      "colorStyle": "color: #999999",
      "_id": "5813293d550dfb3b52b60c81"
    },
    {
      "handle": "Colinh84",
      "reliability": "0%",
      "registrationDate": "2015-03-22T16:49:00.000Z",
      "submissionDate": null,
      "rating": "1485",
      "colorStyle": "color: #6666FF",
      "_id": "5813293d550dfb3b52b60c80"
    }
  ],
  "registrationEndDate": "2015-03-22T22:26:00.000Z",
  "reliabilityBonus": 440,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2015-03-26T22:25:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 86,
      "finalScore": 86.67,
      "points": 990,
      "submissionStatus": "Active",
      "submissionDate": "2015-03-26T18:13:00.000Z",
      "_id": "5813293d550dfb3b52b60ca0"
    }
  ],
  "technology": [
    "CSS",
    "HTML5",
    "JavaScript"
  ]
}