{
  "_id": 30045242,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T13:43:16.868Z",
  "appealsEndDate": "2014-08-26T10:51:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Halo Landing Page Responsive Wordpress Theme Build Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p>Welcome to the Halo Landing Page Responsive Wordpress Theme Build Challenge!<br />\nFor this Challenge, the goal is to build the WP theme for 1(one) Landing Page based on the provided storyboard and with the features outlined below.</p>\n\n<p>Your Prototype must match the &quot;look and feel&quot; of the provided storyboard. All HTML5 and CSS3 should be standardized, validated and follow best practices. Images should be optimized for the web JPGs, GIFs and PNGs) and used appropriately.</p>\n\n<p>Create your theme according to the WordPress template heirarchy <a href=\"http://codex.wordpress.org/Template_Hierarchy.\">http://codex.wordpress.org/Template_Hierarchy.</a></p>\n",
  "digitalRunPoints": 720,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30045242",
  "event": {
    "id": 3442,
    "description": "2015 topcoder Open",
    "shortDescription": "tco15"
  },
  "finalFixEndDate": "2014-08-28T10:43:00.000Z",
  "finalSubmissionGuidelines": "<p>A WordPress Theme is a folder containing all the images, css, javascript, and PHP files that describe the appearance and layout of a WordPress blog. The PHP files have a standard naming convention for page types, and contain and use template tags to call for specific information from the blog&#39;s database, such as a post title, the post date, it&#39;s categories, and more.</p>\n\n<p>A proper understanding of the way WordPress selects template files to display the various pages on your site is essential. If you seek to customize an existing WordPress theme, this article aims to help you decide which template file needs editing.</p>\n\n<p>Theme Build References:<br />\nTutorial- Building Custom WordPress Theme:<br />\n<a href=\"http://www.webdesignerwall.com/tutorials/building-custom-wordpress-theme\">http://www.webdesignerwall.com/tutorials/building-custom-wordpress-theme</a><br />\n<a href=\"http://www.wpdesigner.com/2007/02/19/so-you-want-to-create-wordpress-themes-huh/\">http://www.wpdesigner.com/2007/02/19/so-you-want-to-create-wordpress-themes-huh/</a></p>\n\n<p>The WordPress Codex (a guide to template tags)<br />\n<a href=\"http://codex.wordpress.com/\">http://codex.wordpress.com/</a></p>\n\n<p>Wordpress Developers Toolbox<br />\n<a href=\"http://www.smashingmagazine.com/2008/09/15/wordpress-developers-toolbox/\">http://www.smashingmagazine.com/2008/09/15/wordpress-developers-toolbox/</a></p>\n\n<p><strong>TECHNOLOGY GUIDELINES:</strong><br />\n<strong>1. Wordpress</strong><br />\n- Provide ALL installation step by step, create details notes needed for your WordPress Theme<br />\n- Your pages must match the colors and structure of the provided storyboards.<br />\n- Ensure your pages display correctly in all browsers.&nbsp; It is your responsibility to make sure the pages display correctly.<br />\n- Ensure you submission clear of HTML and CSS Validation error and warning.<br />\n- Create a Theme based on the provided Storyboard PSDs and existing WordPress Theme.<br />\n- All content (headings, text, etc...) should be dynamic and editable via the WordPress Admin backend.<br />\n- DO NOT just create static HTML/PHP templates and have them served up by WordPress - you much create the Admin functionality<br />\n- Only use custom fields when appropriate. Do not over use them. It is advisable to use Custom Field Template plugin if in case you use custom fields. We want it to be easy for a non-technical editor to update content on the pages, so as much as possible the pages that are relatively simple content should be editable by updating the page content.<br />\n- A user should be able to edit the site without the need of an Super Admin privileges</p>\n\n<p><strong>2. HTML5</strong><br />\n- Provide comments on the page elements to give clear explanation of code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts<br />\n- Make sure all HTML files pass Validation without Error/Warning.</p>\n\n<p><strong>3. CSS3</strong><br />\n- The design should work with fluid/flexible nature, so the prototype supports both Portrait and Landscape orientation<br />\n- Provide comments on the CSS code, we need CSS comments to give clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all CSS so future developers can follow the code.<br />\n- All CSS naming should not have any conflicts<br />\n- Make sure all CSS files pass validation without Error/Warning.<br />\n- Use <a href=\"http://www.w3.org/TR/css3-mediaqueries/\">CSS3 Media Queries</a> to load different styles for each page and don&#39;t build different page for different device/layout.</p>\n\n<p><strong>4. JAVASCRIPT</strong><br />\n- Provide comments on the JavaScript code, JS codes to give clear explanation of the code usage. The goal is to help future developers understand the code and know what needs to be developer further.<br />\n- Please use clean INDENTATION for all JavaScript code so future developers can follow the code.</p>\n\n<p><strong>5. IMAGES</strong><br />\n- As possible using background color properties, instead of repetition usage of background based image.<br />\n- Use sprites technique for the image slicing.<a href=\"http://css-tricks.com/css-sprites/\"> Page reference</a><br />\n<br />\n<strong>FOR REVIEWERS:</strong><br />\nWhen reviewing this prototype, Reviewer should look at:<br />\n- There is customization involved within this Challenge - please document your Theme and how to install it for the Client and the Reviewers.<br />\n- Does the Theme match the Storyboard design?<br />\n- Does the Theme work well in all the required browsers?<br />\n- If a Client was to implement this Theme - did it work at first without major Final Fixes?<br />\n- Did the submitter provide adequate installation notes?<br />\n- Overall - would the client be able to use this Theme with some minor fixes?</p>\n\n<p><strong>Halo Landing Page Requirements<br />\n<br />\nDocumentation Provided:</strong><br />\nStoryboard.zip: Storyboard Screens and PSD file<br />\n<a href=\"https://www.dropbox.com/s/2pvldizjbptuo8u/Storyboard.zip\">https://www.dropbox.com/s/2pvldizjbptuo8u/Storyboard.zip</a><br />\n<br />\n<strong>Before you start!</strong><br />\n- Please check <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a> before you start creating Wordpress Theme, play around how best practice site works<br />\n- Your submission need show fluid solution on every screen width, fyi: minimum width must set at 320px (mobile view)<br />\n- Keep in mind when resize the width of this landing page, all background image, layout, etc must support responsive layout.</p>\n\n<p><strong>1. Preloader</strong><br />\n- Refer site reference, we need use preloader on page load.<br />\n- All images, css, js files need preloaded<br />\n- You can use existing styles for preloader, and number percentages.<br />\n- After preloader done, then landing page show up</p>\n\n<p><strong>2. Up and Down (Keyboard Press)</strong><br />\n- Page load by show top slideshow by default<br />\n- When user press up and down, page need scrolling up and down based on sections<br />\n- After click up and down, you also need set active state&nbsp; current active section on navigation</p>\n\n<p><strong>3. Landing Page</strong><br />\nscreenshot:<em> 01-1_Landing Page.png</em><br />\n- This is how Halo landing page look and feel<br />\n- Use <strong>White Theme</strong> for your submission (screenshot: <em>01-2_Landing Page_Alternate.png</em>). Detail specification information below area based on Black theme screenshots.<br />\n- Halo Landing Page divided by:</p>\n\n<p><strong>4. Header</strong><br />\n- Header background will floating when user scrolling down and up<br />\n- All header area will be fluid as browser width<br />\n- Logo should be uploadable from the WP Admin, and it should be linked to homepage.<br />\n- Logo placed in the left side and main navigation in the right side<br />\n&nbsp;<br />\n<strong>5. Navigation</strong><br />\n- Navigations should used the wp menu feature<br />\n- Notice there&rsquo;s active state after click some menu<br />\n- Mimic how scrolling effect on site references works, make sure transition running smooth<br />\n- Scrolling up and down need dynamically works when user reach bottom or top section<br />\n- There&rsquo;s a vertical dotted in the right side as indicator current active section. Also, user can navigate to section based on top to bottom order<br />\n- This vertical dotted will move as user scrolling down and up<br />\n- We need ability to add new menu navigation and must can modify to&nbsp; linked to some expected section, also new vertical dotted<br />\n- When user scrolling from top to bottom, active state on navigation will active as current section on page</p>\n\n<p>Navigation (Mobile Version)<br />\n- When resize into ipad mobile browser width (768px), desktop navigation will transform into mobile version<br />\n- We not provide mobile storyboard we need your help show us how mobile navigation works.<br />\n- For mobile version, you need transform the main navigation similar like <a href=\"http://www.daba.in.rs/tf/penandpaper_wp/#about\">this site technique</a>.<br />\n- Place logo in the left side and white stacked icon in the right side<br />\n- Use white background with menu navigation stacked vertically and divided thin line</p>\n\n<p><strong>6. Main Slideshow</strong><br />\nscreenshot: <em>02-1_Parallax Slide.png</em><br />\n- This main slideshow area placed below the header area<br />\n- For the slideshow, it should be continuous loop.<br />\n- Slideshow image and captions should be editable in WP Admin, and it should also support unlimited items<br />\n- Remember, background image need resizable on every screen width, refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a><br />\n- All text and button need editable in WP Admin<br />\n- Show us easy way to set Button href target in WP Admin<br />\n- Dotted navigation will automatically created based on selected active slides.<br />\n- Click dotted navigation will slide based on slide order<br />\n- Follow how transition works for images and text dynamic show up when navigate each slide. refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a><br />\n- Show us random image and text placement so we&rsquo;re aware the differences when navigate from slide to slides<br />\n- Show us creative hover state on slideshow button, refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a>. we&rsquo;re open to any cool ideas represent the hover state.<br />\n- User scrolling to Register section (screenshot: 02-2_Parallax Slide.png)<br />\n- When user on this Main Slideshow area, user can navigate slideshow by press left and right on keyboard</p>\n\n<p>Main Slideshow (Mobile Version)<br />\n- Refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a> how slideshow image and text resized in proper ratio for mobile version<br />\n- Also you need make sure buton not look too big when resized<br />\n- Dotted pagination remain in the right side</p>\n\n<p><strong>7. Register</strong><br />\nscreenshot: <em>02-3_Parallax Slide.png</em><br />\n- This Register section, user can scrolling down to this section by top navigation or vertical floating dotted in the top right<br />\n- Register area scroll starting point should placed below header part. This apply for other sections.<br />\n- Background image and title should be editable in WP Admin<br />\n- Remember, background image need resizable on every screen width, refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a><br />\n- At first time user scrolled to this area, you need show simple animation effect to displays all text.<br />\n- Hover effect on Register button, show smooth fade effect to reverse the background and text color<br />\n- All text and button need editable in WP Admin<br />\n- Show us easy way to set Register button href target in WP Admin<br />\n- Background image should editable from WP Admin</p>\n\n<p>Register (Mobile version)<br />\n- On mobile version, all text and button need remain centered<br />\n- Background image and text resized in proper ratio for mobile version</p>\n\n<p><strong>8. Our Members</strong><br />\nscreenshot: <em>02-4_Parallax Slide.png</em><br />\n- At first time user scrolled to this area, all thumbnails show up one by one in fast mode<br />\n- Remember, background image need resizable on every screen width, refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a><br />\n- You also need show simple animation effect to displays text, Join Our Community button and the socials icons<br />\n- Join in Our Community button, social icons and links need editable via WP Admin<br />\n- Make sure when we add new icon, placement remain centered<br />\n- Scrolling to next section(screenshot: <em>02-5_Parallax Slide.png</em>)</p>\n\n<p>Our Member (Mobile version)<br />\n- You just need make all text, icons and button centered<br />\n- Background image will resizable and adapt mobile screen width</p>\n\n<p><strong>9. Events</strong><br />\nscreenshot: <em>02-6_Parallax Slide.png</em><br />\n- This is scrolling end for Event section<br />\n- Add/Edit/Delete Event should edited via WP Admin<br />\n- Show us easy way to set calendar date, event title, and place in WP Admin<br />\n- Dotted navigation will automatically created based on selected active slides.<br />\n- Similar like slideshow you need follow how transition works for images and text dynamic show up when navigate each slide. refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a><br />\n- Show us random calendar date title and text so we&rsquo;re aware the differences when navigate from slide to slides<br />\n- Show us creative hover state on Email and Sign up button, refer <a href=\"http://accio.webtemplatemasters.com\">Responsive Parallax Site</a>. we&rsquo;re open to any cool ideas represent the hover state.<br />\n- When user on this Main Slideshow area, user can navigate slideshow by press left and right on keyboard</p>\n\n<p>Events (Mobile version)<br />\n- Background will resizeable as screen width<br />\n- Date, Event title and Input remain in the right side, make sure all content fits within minimum width (320px)</p>\n\n<p><strong>10. Next Generation</strong><br />\nscreenshot: <em>02-7_Parallax Slide.png</em><br />\n- This Next Generation section<br />\n- How title and image first load effect look?<br />\n- All text and button need editable in WP Admin<br />\n- Show us easy way to edit text and main image of this section<br />\n- Join in Our Community button, social icons and links need editable via WP Admin<br />\n- Scrolling to next section (screenshot: <em>02-8_Parallax Slide.png</em>)</p>\n\n<p>Event Generation (Mobile version)<br />\n- text and image will resizable as screen width<br />\n- If Join Community not fit within minimum width, please make them stacked</p>\n\n<p><strong>11. Products</strong><br />\nscreenshot: <em>02-9_Parallax Slide.png</em><br />\n- Think about how effect for this section look when displaying the devices. Should they show up one by one?<br />\n- Also how the title look?<br />\n- All text and device graphics should editable via Admin WP<br />\n- How Hungry for More Info buttons show up?<br />\n- Need hover effect for View FAQ and Download buttons, you can use smooth fade effect with reversed background color and text<br />\n- Scrolling effect to next section(screenshot: 02-10_Parallax Slide.png)</p>\n\n<p>Products (Mobile version)<br />\n- Device graphics and text will resizeable as browsers width<br />\n- Hungry for more info need remain in 1 line on mobile version look</p>\n\n<p><strong>12. What They Say</strong><br />\nscreenshot: <em>02-11_Parallax Slide.png</em><br />\n- Thumbnails show up one by one<br />\n- Center thumbnail show information by default<br />\n- When clicked another thumbnails, clicked thumbnails show actual color, and the other thumbnails turn to blue overlay. text will changed. fyi: text remain in centered<br />\n- All thumbnails and details information need editable via WP Admin<br />\n- If add more thumbnails, make sure section remain in 1 line</p>\n\n<p>What They Say (Mobile version)<br />\n- Thumbnails need placed centered on browser width<br />\n- You can make all thumbnails stacked vertically<br />\n- Click each thumbnails displayed details information right below clicked thumbnails</p>\n\n<p><strong>13. Partners</strong><br />\nscreenshot: <em>02-12_Parallax Slide.png</em><br />\n- Logo need show up one by one.<br />\n- All logos and links need editable via WP Admin<br />\n- If add more thumbnails, make sure section remain in 1 line</p>\n\n<p>Partners (Mobile version)<br />\n- You can make all logo stacked vertically-</p>\n\n<p><strong>14. Footer</strong><br />\n- Footer title should editable from&nbsp; the WP Admin</p>\n\n<p>Footer (Mobile version)<br />\n- Not much difference, footer remain centered with</p>\n\n<p><strong>15. Create Additional Menu and Section via WP Admin</strong><br />\n- We need way to add new menu and sections on Landing page<br />\n- After menu added how to display on landing page<br />\n- How to set the link target to scroll to the sections<br />\n- On WP Admin, we want to ability to:<br />\n-- config the image background,<br />\n-- Header style,<br />\n-- Body style,<br />\n-- call to action button,<br />\n-- Text color.<br />\n-- Text and Button Alignment<br />\n- Any other possibilities?<br />\n&nbsp;</p>\n\n<p><strong>Specific HTML/CSS/JavaScript Requirements:<br />\nHTML/CSS Requirements:</strong><br />\n- Your HTML code must be valid HTML5 and follow best practices<br />\n- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.<br />\n- No inline CSS styles - all styles must be placed in an external style-sheet.<br />\n- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.<br />\n- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.</p>\n\n<p><strong>Browsers Requirements:</strong><br />\n- IE9<br />\n- IE10<br />\n- Safari latest version<br />\n- Firefox latest version<br />\n- Chrome latest version<br />\n- Safari Browsers on iPad<br />\n- Safari Browsers on iPhone</p>\n\n<p>&nbsp;</p>\n",
  "forumId": 25040,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=25040",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 13,
  "numberOfSubmissions": 2,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2014-08-21T04:41:00.000Z",
      "actualStartTime": "2014-08-21T04:41:00.000Z",
      "scheduledEndTime": "2014-08-21T04:42:00.000Z",
      "actualendTime": "2014-08-21T04:42:00.000Z",
      "_id": "581355f4550dfb3b52c536b4"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2014-08-21T04:42:00.000Z",
      "actualStartTime": "2014-08-21T04:42:00.000Z",
      "scheduledEndTime": "2014-08-21T08:38:00.000Z",
      "actualendTime": "2014-08-21T08:38:00.000Z",
      "_id": "581355f4550dfb3b52c536b3"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2014-08-21T08:38:00.000Z",
      "actualStartTime": "2014-08-21T08:38:00.000Z",
      "scheduledEndTime": "2014-08-23T08:38:00.000Z",
      "actualendTime": "2014-08-23T08:38:00.000Z",
      "_id": "581355f4550dfb3b52c536b2"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2014-08-21T08:43:00.000Z",
      "actualStartTime": "2014-08-21T08:43:00.000Z",
      "scheduledEndTime": "2014-08-25T02:38:00.000Z",
      "actualendTime": "2014-08-25T02:38:00.000Z",
      "_id": "581355f4550dfb3b52c536b1"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2014-08-25T02:38:00.000Z",
      "actualStartTime": "2014-08-25T02:38:00.000Z",
      "scheduledEndTime": "2014-08-25T07:10:00.000Z",
      "actualendTime": "2014-08-25T07:10:00.000Z",
      "_id": "581355f4550dfb3b52c536b0"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2014-08-25T07:11:00.000Z",
      "actualStartTime": "2014-08-25T07:11:00.000Z",
      "scheduledEndTime": "2014-08-26T01:34:00.000Z",
      "actualendTime": "2014-08-26T01:34:00.000Z",
      "_id": "581355f4550dfb3b52c536af"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2014-08-26T01:34:00.000Z",
      "actualStartTime": "2014-08-26T01:34:00.000Z",
      "scheduledEndTime": "2014-08-26T07:34:00.000Z",
      "actualendTime": "2014-08-26T07:34:00.000Z",
      "_id": "581355f4550dfb3b52c536ae"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2014-08-26T07:34:00.000Z",
      "actualStartTime": "2014-08-26T07:34:00.000Z",
      "scheduledEndTime": "2014-08-26T10:51:00.000Z",
      "actualendTime": "2014-08-26T10:51:00.000Z",
      "_id": "581355f4550dfb3b52c536ad"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2014-08-26T10:51:00.000Z",
      "actualStartTime": "2014-08-26T10:51:00.000Z",
      "scheduledEndTime": "2014-08-26T11:00:00.000Z",
      "actualendTime": "2014-08-26T11:00:00.000Z",
      "_id": "581355f4550dfb3b52c536ac"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2014-08-26T11:01:00.000Z",
      "actualStartTime": "2014-08-26T11:01:00.000Z",
      "scheduledEndTime": "2014-08-27T10:35:00.000Z",
      "actualendTime": "2014-08-27T10:35:00.000Z",
      "_id": "581355f4550dfb3b52c536ab"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2014-08-27T10:35:00.000Z",
      "actualStartTime": "2014-08-27T10:35:00.000Z",
      "scheduledEndTime": "2014-08-27T12:22:00.000Z",
      "actualendTime": "2014-08-27T12:22:00.000Z",
      "_id": "581355f4550dfb3b52c536aa"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2014-08-28T13:09:00.000Z",
      "actualStartTime": "2014-08-28T13:09:00.000Z",
      "scheduledEndTime": "2014-09-02T12:14:00.000Z",
      "actualendTime": "2014-09-02T12:14:00.000Z",
      "_id": "581355f4550dfb3b52c536a9"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2014-08-27T12:22:00.000Z",
      "actualStartTime": "2014-08-27T12:22:00.000Z",
      "scheduledEndTime": "2014-08-28T10:43:00.000Z",
      "actualendTime": "2014-08-28T10:43:00.000Z",
      "_id": "581355f4550dfb3b52c536a8"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2014-08-28T10:43:00.000Z",
      "actualStartTime": "2014-08-28T10:43:00.000Z",
      "scheduledEndTime": "2014-08-28T13:08:00.000Z",
      "actualendTime": "2014-08-28T13:08:00.000Z",
      "_id": "581355f4550dfb3b52c536a7"
    }
  ],
  "platforms": [
    "HTML",
    "Wordpress"
  ],
  "postingDate": "2014-08-21T08:38:00.000Z",
  "prize": [
    2000,
    1000
  ],
  "projectId": 7949,
  "registrants": [
    {
      "handle": "hi4sandy",
      "reliability": "46%",
      "registrationDate": "2014-08-21T08:50:00.000Z",
      "submissionDate": "2014-08-25T02:36:00.000Z",
      "rating": "1502",
      "colorStyle": "color: #DDCC00",
      "_id": "581355f4550dfb3b52c536a6"
    },
    {
      "handle": "lintc",
      "reliability": "6%",
      "registrationDate": "2014-08-21T09:13:00.000Z",
      "submissionDate": null,
      "rating": "1584",
      "colorStyle": "color: #DDCC00",
      "_id": "581355f4550dfb3b52c536a5"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2014-08-21T10:54:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581355f4550dfb3b52c536a4"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2014-08-21T11:11:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581355f4550dfb3b52c536a3"
    },
    {
      "handle": "srajas",
      "reliability": "20%",
      "registrationDate": "2014-08-21T12:20:00.000Z",
      "submissionDate": null,
      "rating": "1124",
      "colorStyle": "color: #00A900",
      "_id": "581355f4550dfb3b52c536a2"
    },
    {
      "handle": "alarabinet",
      "reliability": "n/a",
      "registrationDate": "2014-08-21T12:36:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581355f4550dfb3b52c536a1"
    },
    {
      "handle": "bannie2492",
      "reliability": "n/a",
      "registrationDate": "2014-08-21T12:57:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581355f4550dfb3b52c536a0"
    },
    {
      "handle": "billthu",
      "reliability": "20%",
      "registrationDate": "2014-08-21T13:37:00.000Z",
      "submissionDate": "2014-08-25T01:57:00.000Z",
      "rating": "1039",
      "colorStyle": "color: #00A900",
      "_id": "581355f4550dfb3b52c5369f"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2014-08-21T13:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581355f4550dfb3b52c5369e"
    },
    {
      "handle": "poundinc_tc",
      "reliability": "n/a",
      "registrationDate": "2014-08-21T14:23:00.000Z",
      "submissionDate": null,
      "rating": "656",
      "colorStyle": "color: #999999",
      "_id": "581355f4550dfb3b52c5369d"
    },
    {
      "handle": "jol",
      "reliability": "0%",
      "registrationDate": "2014-08-21T18:52:00.000Z",
      "submissionDate": null,
      "rating": "1015",
      "colorStyle": "color: #00A900",
      "_id": "581355f4550dfb3b52c5369c"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2014-08-22T02:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581355f4550dfb3b52c5369b"
    },
    {
      "handle": "iCare",
      "reliability": "n/a",
      "registrationDate": "2014-08-22T17:44:00.000Z",
      "submissionDate": null,
      "rating": "770",
      "colorStyle": "color: #999999",
      "_id": "581355f4550dfb3b52c5369a"
    }
  ],
  "registrationEndDate": "2014-08-23T08:38:00.000Z",
  "reliabilityBonus": 400,
  "reviewScorecardId": 30001381,
  "reviewType": null,
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2014-08-25T02:38:00.000Z",
  "submissions": [
    {
      "handle": "billthu",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 67.67,
      "finalScore": 85.17,
      "points": 503.99999999999994,
      "submissionStatus": "Active",
      "submissionDate": "2014-08-25T01:57:00.000Z",
      "_id": "581355f4550dfb3b52c536b6"
    },
    {
      "handle": "hi4sandy",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 42.78,
      "finalScore": 42.78,
      "points": 216,
      "submissionStatus": "Failed Review",
      "submissionDate": "2014-08-25T02:36:00.000Z",
      "_id": "581355f4550dfb3b52c536b5"
    }
  ],
  "technology": [
    "CSS",
    "HTML5",
    "JavaScript",
    "MySQL",
    "PHP"
  ]
}