{
  "_id": 30054193,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T09:53:26.573Z",
  "appealsEndDate": "2016-06-26T10:02:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Living Progress - Social Volunteer Discovery - Responsive Design UI Prototype Challenge Part 1",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "Welcome to &quot;<strong>Living Progress - Social Volunteer Discovery - Responsive Design UI Prototype Challenge Part 1</strong>&quot;. In this challenge, we need your help to create responsive HTML5 prototype for our new platform where user can find and volunteer to any activity based on their preferences. Similar to a Netflix or Amazon recommendations model, we are aiming to serve up to our users volunteer opportunities that are of interest to them. <strong>Read more details below and Join with us NOW!!</strong><br />\n<br />\n<span style=\"color:#008000\"><strong>Tips for Success: Asking questions early and getting Copilot or PM&#39;s feedback is very important for the success of this challenge.</strong></span><br />\n<br />\n<span style=\"color:#FF0000\"><strong>Background Overview</strong></span><br />\nInsufficient progress is being made on the most pressing social and environmental challenges facing local communities and the world we all share. One of the strongest tools the world has to turn the tide on these challenges is the power of people devoting their time and talents to these challenges as volunteers and, through that experience, inspiring enrolling others in common cause to effect change. According to the US Census, about 60 million Americans volunteer each year, which is a powerful force for good, but only about 20% of the citizenry. Moreover, the opportunity to better connect people to opportunities to make a difference is enormous on a global scale.<br />\n<br />\nIf we fail to inspire and connect the maximum possible people to a cause where they can make a meaningful difference, we will never solve the great challenges of our time. Martin Luther King, Jr. said, &quot;Everyone can be great, because everyone can serve.&quot; Volunteer service should be viewed as a powerful lever for change across all the UN Sustainable Development Goals. It is through volunteering that every individual can make a meaningful contribution to this bold, global agenda. It is through these hands on experiences that individuals build empathy, new perspective, and the values of community necessary to build a sustainable, just global society.<br />\n<br />\nOur vision is to transform how people discover volunteer opportunities online &quot;from search to social&quot;. By applying machine learning, predictive analytics, and persuasive UX design to our current search-&shy;-based All For Good platform, the largest catalog of volunteer opportunities on the internet, we will revolutionize how people are invited into service.&nbsp;<br />\n<br />\nThis will result in more people connecting to causes they can help with their time, talent, money, and social influence. It is ultimately through the power of people that social change happens.<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Focus Area:</strong></span><br />\nCivic Engagement, Community Development and Volunteerism<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Primary Goal</strong></span><br />\nWe are looking for your help to help us create responsive UI Prototype (front end only) for our new Social Volunteer platform.&nbsp;<br />\n- We&#39;ll focus on Desktop version in this challenge.&nbsp;<br />\n- Create a powerful consumer facing social discovery platform that includes features like:<br />\n-- The cutting edge in interface layer UX design<br />\n-- Machine learning, persuasive technology, and behavioral science to push the right volunteer opportunities to the right people at the right time.<br />\n-- Insights from the social graph so that more people can bring others into volunteer service through peer influence.<br />\n<br />\n<span style=\"color:#FF0000\"><strong>User Case Scenarios:</strong></span><br />\n<strong>Volunteers</strong><br />\n- Searching for opportunities by keyword, organization type, geography<br />\n- Browse recommended opportunities and organizations based on their preferences/social data<br />\n- Sign up for or &quot;express interest&quot; in an opportunity<br />\n- Favorite an opportunity<br />\n- Follow an organization so that they are alerted to new or related opportunities<br />\n- Invite a friend/s to the platform<br />\n- See which of their friends are also users and see their activity<br />\n- Invite a friend to an opportunity<br />\n- Earn and display &quot;badges&quot; for certain achievements or activities<br />\n- Sign up for a background check (an integration with our background check partner, Verified Volunteers)<br />\n- Give a donation to an organization<br />\n- See an activity feed: their friends, their favorite organizations, their sign up history, their background check and/or other &quot;badges&quot;<br />\n<br />\n<strong>Nonprofit/Cause Administrator</strong><br />\n- Posting volunteer opportunities that get published on the platform<br />\n- Link a Twitter account so that a posting get&#39;s broadcast with a URL shortened link<br />\n- Link to a FB Page account so the opportunity gets posted to their wall.<br />\n- Verify their nonprofit status via EIN (integrate with a service like Guidestar)<br />\n- Integrate a payments processing solution to accept donations (Network for Good or PayPal)<br />\n- Integrate with our background screening partner so that they can send screening request to their volunteers<br />\n- Download CSV files of their interested volunteers<br />\n- Push communications to their followers<br />\n- See a dashboard: Their opportunity listings (active, expired, pending); their volunteer followers; their platform performance (how many impressions their opportunities have had through search discovery, social discovery, etc.)<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Competition Task Overview</strong></span><br />\nThe main task of this competition is to develop Responsive HTML5 prototype based on the provided storyboard designs. Your prototype must work properly in all the required browsers.<br />\n<br />\n<strong>Key Requirements</strong><br />\n- Replicate the design of the approved Storyboards (PSD Files) for all pages.<br />\n- Your pages must match the colors and structure of the provided storyboards.<br />\n- Ensure your pages display correctly in all browsers. It is your responsibility to make sure the pages display correctly.<br />\n- Ensure you submission clear of HTML and CSS Validation error and warning.<br />\n- Test in all the required browsers.<br />\n<br />\n<strong>Screen Requirements</strong><br />\n- There are 2 User scenario that needs to be simulated and should have their own screen creations, in this challenge you just need to focus on Volunteer Screens:<br />\n<br />\n<strong>Volunteer Screens:<br />\n01. Home Screen</strong><br />\n<em>01_Homepage_Non_Login.png&nbsp;to&nbsp;01_Homepage_Story.png (Non logged in User)<br />\n02_Homepage_Login_No_Banner.png&nbsp;to&nbsp;02_Homepage_Login_Slide_3.png (Logged in User)<br />\n-&nbsp;</em>The homepage will be available for non-logged in user and logged in user.<br />\n- The homepage will show important information/marketing content, list of active opportunities, popular opportunities and provide a way to ask user to register and join the apps.<br />\n- Clear ways to navigate to appropriate login for organization/cause users and volunteer users (please simulate non logged in homepage and logged in homepage)<br />\n- User will be able to search for opportunity that interested for them in the apps via search section, in non-login mode, user cannot interact with opportunities (like the opportunity, sign up/follow, etc.). &nbsp;System prompts user to login/create account if they click on an opportunity<br />\n- The top part of homepage screen will be created in several display variation depending on informations that need to be shown, please provide all these display variation in your submission, the display variation can be found below:<br />\n-- Homepage with Carousel (01_Homepage_Non_Login.png), the carousel content #1,2,3 can be found in&nbsp;<em>02_Homepage_Login_Slide_1.png to&nbsp;02_Homepage_Login_Slide_3.png</em><br />\n-- Homepage with&nbsp;Banner (01_Homepage_Non_Login_Banner.png)<br />\n-- Homepage with&nbsp;Carousel + Ads (01_Homepage_Non_Login_With_Ads.png)<br />\n-- Homepage with&nbsp;Story (01_Homepage_Story.png)<br />\n-- Homepage with&nbsp;no banner (02_Homepage_Login_No_Banner.png)<br />\n<br />\n<strong>02. Login Screen</strong><br />\n<em>00_Login.png</em><br />\n- User needs to login to be able doing more interactions in the apps.<br />\n- Usual Login form (username, password, remember me, forgot password) &nbsp;or login via social media account (Facebook)<br />\n- Options to register and login using Single Sign On (SSO) for volunteer users via Facebook that leverages data permissions and social graph<br />\n- Provide scenario if user enter wrong credential.<br />\n- &quot;Create an Account&quot; link will bring user to register page.<br />\n<br />\n<strong>03. Register Screen</strong><br />\n<em>00_Register.png</em><br />\n- If anonymous user don&#39;t have account in the apps, they can register via this screen.<br />\n- There are 2 type of accounts that they can register in the apps, &quot;Register as Volunteer&quot; or &quot;Register My Organization&quot;.<br />\n- Clicking any of the account type button will bring user to registration form.<br />\n- Register my organization is out of scope for this challenge, just provide the placeholder button.<br />\n<br />\n<strong>04. Register as volunteer Screen</strong><br />\n<em>0_Register_Volunteers_1.png to&nbsp;0_Register_Volunteers_5.png</em><br />\n- In this challenge, we&#39;re only need to focus on volunteer registration form.<br />\n- Provide registration form for user that not yet have an account to the platform<br />\n- User needs to filled in several informations to be able register to the site:<br />\n-- Basic details, General information about user profile<br />\n-- Location Preferences, Google map integrations needed here, needs to be able simulate user search location (auto complete).<br />\n-- Skills, user can select one or more skills from this screen&nbsp;<br />\n-- Interests,&nbsp;user can select one or more interest from this screen<br />\n-- Social Profiles, provides the button only, no need to integrate it with social media API.&nbsp;<br />\n- Once all informations complete, they will be redirected to their dashboard and able to use the apps.<br />\n<br />\n<strong>05. Volunteer Dashboard Screen</strong><br />\n<em>05_Dashboard.png</em><br />\n- Default screen to be shown after successfull login<br />\n- In this page, user can navigate, browse, search, find, and discover recommended volunteer opportunities for them<br />\n- Clicking search icon will open the blue search form where user can enter search criteria<br />\n- The top area will be created as carousel, the application will show related informations that is important or interesting for the user.&nbsp;<br />\n- This page will show list of user activity and any features in the apps that might be interested for the user based on their social media interactions.<br />\n- Browse the latest information about all activity within the app&nbsp;<br />\n- User can see an activity feed from: their friends, their favorite organizations, their groups, their sign up history, their background check and/or other &quot;badges&quot; (think of facebook activity feeds style)<br />\n- Ability to perform quick and global search for anything (friends, organization, opportunity, etc).<br />\n- There are several cards style create in this screen, please use card style created for &quot;Opportunities recommended for me&quot; in &quot;My Opportunities&quot; and &quot; Opportunities I Like&quot; (we like the full column width card style creation)<br />\n- Clicking &quot;See More&quot; button will load more opportunities content to the dashboard.<br />\n- The right sidebar will show several widget that related to user activity in the apps such as:<br />\n-- Calendar, showing list of user schedule per month (check their schedule status in the legend, blue, red pink, and grey)<br />\n-- Badges, showing user badge achievement and status in the apps.<br />\n-- Certified Level, showing user level progress to complete their certified status<br />\n-- Twitter news feed, integration with twitter (recommended), but a placeholder content also fine.<br />\n-- Friends, Showing list of user friends collected from their social media.<br />\n-- Groups, Showing list of groups that user joined<br />\n-- Organization, same thing like groups (we are combining organization with groups).<br />\n<br />\n<strong>06. Browse Opportunities and Organizations Screens</strong><br />\n<em>03_Browse_Opportunity_Carousel.png to&nbsp;03_Browse_Opportunity_With_Ads.png<br />\n04_Browse_Groups.png</em><br />\n- Have a look at how Kickstarter handles their browsing experience...what they call discover. A user selects their areas of interest and the site will generate a result based off of that interest. In our case...users will select from a list of issues that have volunteer opportunities including: &nbsp;<br />\n- adult education<br />\n- animals<br />\n- arts and culture<br />\n- children and youth education<br />\n- civic and community<br />\n- disaster and emergency services<br />\n- environment<br />\n- faith-based service<br />\n- family services<br />\n- health and wellness<br />\n- hunger and homelessness<br />\n- immigrant and refugee services<br />\n- international service<br />\n- internships and employment<br />\n- justice and legal services<br />\n- schools<br />\n- senior services<br />\n- sports and recreation<br />\n- technology<br />\n- veterans and military families<br />\n- After making their selections..the user will be shown opportunities that are recommended for them. (Similar to how Kickstarter handles the results...the user will be taken to a new page where there will be a featured opportunity and a grid of other opportunities displayed for the user)<br />\n- Clicking search icon will open the blue search form where user can enter search criteria<br />\n- Browse/Show recommended opportunities and organizations based on user preferences/social data<br />\n- Ability to search opportunities by keyword, organization type, geography, date, skills, age, national event,etc<br />\n- Show summary information about the opportunities<br />\n- Ability to take all actions described above against opportunity in this browse/summary mode (Sign up for or &quot;express interest&quot;, like, share, etc.)<br />\n- Like/ Dislike for opportunities that helps feed the recommendations engine (if dislike, remove it from the screen)<br />\n- Notice that the top parts of the big images area can be set into different display variation (carousel or banner), please provide this variation in your submission<br />\n- If there is necessary information/marketing content that needs to be shown, this screen will be able to marketing it via ads (03_Browse_Opportunity_With_Ads.png)&nbsp;<br />\n- For Browse Group screen, no top big image needs to be shown (04_Browse_Groups.png)<br />\n- In Browse Group screen, there will be two types of group, unverified group and verified group. Verified group can be detected by the pin &quot;verified organization&quot; in the image area.<br />\n<br />\n<strong>07. Opportunity Detail Screen</strong><br />\n<em>03_Opportunity_Details.png</em><br />\n- User can check for more details about opportunities from this screen.<br />\n- Clicking search icon will open the blue search form where user can enter search criteria<br />\n- Show details of opportunities information here (location, type of opportunities, where, when, who posted it, individual/organizational, skills, time, etc).<br />\n- There should be some way to register to take part as volunteer in the opportunities (Join the opportunity button), once user joined change the button name into &quot;Joined&quot;<br />\n- If user not logged in, when user want to join the opportunity button, it will bring back user to login form.<br />\n- Share with a group inside platform<br />\n- A social media &quot;like&quot;/&quot;dislike&quot; content/opportunity types to improve recommendation engine.<br />\n- Share opportunities page with social network off platform&nbsp;<br />\n- Comment thread--consider being private--only organization can see it<br />\n- If user try register to the opportunity, they will be provided with several questions that needs to be answered (perhaps set of questions in modal window, etc) - no screen references.<br />\n- Right sidebar, Location map can be placeholder for now, Contacts scrollbar needs to follow storyboard, and please create successfull message sent notification if user send direct messages.&nbsp;<br />\n- Ability to marked the opportunity as &quot;Favourite&quot; (future features)<br />\n- Invite a friend to the opportunity inside platform (future features)<br />\n- User should be informed about their benefits if join the opportunity / earn and display &quot;badges&quot; for certain achievements or activities (future features)<br />\n<br />\n<strong>08. Groups/Organization Profile Screen</strong><br />\n<em>04_Groups_Detail_Discussions.png to&nbsp;04_Groups_Member.png</em><br />\n- Clicking search icon will open the blue search form where user can enter search criteria<br />\n- Show details of organization information in this screen (background, type profit/non-profit, etc). &nbsp;Their affinities (President&#39;s Volunteer Service Award, Verified Volunteers)<br />\n- Simulate verified and unverified groups/organization screens (04_Groups_Detail_Non_Verified.png -&nbsp;04_Groups_Detail_Verified.png)<br />\n- User can follow/subscribe to an organization to be able get notification regarding new or related opportunities from the organization (via follow link)<br />\n- User will be able to give a donation to an organization (paypal/credit card/etc, donation page is out of scope for this challenge)<br />\n- Contact form to get in touch with the organization? (Direct Message, once sent provide notification that message succesfully sent)<br />\n- Social share organization page with users social network<br />\n- Comment thread - consider private by default, user that can see comment thread is user that already joined the group (via Discussion)<br />\n- Clicking &quot;+24&quot; in members area in group details screen will bring user to details members that join/follow this group (04_Groups_Member.png)<br />\n- Create each tab content in this screen (Details, Opportunities, Discussions), for opportunities tab, create list of active opportunities.<br />\n- Right sidebar, Location map can be placeholder for now and please create successfull message sent notification if user send direct messages.&nbsp;<br />\n<br />\n<strong>09. My Profile Screen</strong><br />\n<em>01_My_Profile_Details.png,&nbsp;01_My_Profile_With_Ads.png,&nbsp;04_My_Profile_Badges.png,&nbsp;02_My_Profile_Following.png,&nbsp;03_My_Profile_Favorites.png</em><br />\n- Volunteer profile with photos (pulled from FB), skills, their followed organizations, and a &quot;badges&quot;/&quot;credits&quot; section.<br />\n- Sign up for a background check (an integration with our background check partner, Verified Volunteers)<br />\n- Integrate with our background screening partner so volunteers can order a screen, display in their profile, and share with an organization they want to volunteer with.<br />\n- More robust skills and availability profile (e.g. see only weekend projects)<br />\n- Ability to set their personal preferences for opportunity information filter which will be done by the apps engine.<br />\n- Left sidebar can be added/modified with different kinds of informations if necessary like ads, badges, friends, groups, etc (01_My_Profile_With_Ads.png&nbsp;or&nbsp;01_My_Profile_Details.png)<br />\n- Create each tab content in this screen (Details, Following, Favorites, Badges)<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Specific HTML/CSS/JavaScript Requirements:</strong></span><br />\n<strong>HTML/CSS Requirements:</strong><br />\n- Your HTML code must be valid HTML5 and follow best practices<br />\n- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.<br />\n- No inline CSS styles - all styles must be placed in an external style-sheet.<br />\n- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.<br />\n- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.<br />\n<br />\n<strong>JavaScript Requirements:</strong><br />\n- All JavaScript used must not have any copyrights to any third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- You are allowed to ue Bootstrap for this challenge.<br />\n<br />\n<strong>Browsers Requirements:</strong><br />\n- IE11 above<br />\n- Latest Firefox, Safari &amp; Chrome Browsers<br />\n<br />\n<strong>Documentation Provided:</strong><br />\n- Storyboards, Wireframes, and All necessary flow documents can be found in forum!",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30054193",
  "finalFixEndDate": "2016-06-27T12:05:00.000Z",
  "finalSubmissionGuidelines": "<span style=\"color:#FF0000\"><strong>Submission Deliverables:</strong></span><br />\n- A complete list of deliverables can be viewed in the <a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\">UI Prototype Competitions Tutorial</a>.<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Final Submission:</strong></span><br />\n- For each member, the final submission should be uploaded to the <a href=\"https://software.topcoder.com/review\">Online Review Tool</a>.",
  "forumId": 33058,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=33058",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 25,
  "numberOfSubmissions": 1,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-06-17T05:11:00.000Z",
      "actualStartTime": "2016-06-17T05:11:00.000Z",
      "scheduledEndTime": "2016-06-17T05:12:00.000Z",
      "actualendTime": "2016-06-17T05:12:00.000Z",
      "_id": "58132016550dfb3b52b273af"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-06-17T05:12:00.000Z",
      "actualStartTime": "2016-06-17T05:12:00.000Z",
      "scheduledEndTime": "2016-06-17T11:50:00.000Z",
      "actualendTime": "2016-06-17T11:50:00.000Z",
      "_id": "58132016550dfb3b52b273ae"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-06-17T11:50:00.000Z",
      "actualStartTime": "2016-06-17T11:50:00.000Z",
      "scheduledEndTime": "2016-06-20T11:49:00.000Z",
      "actualendTime": "2016-06-20T11:49:00.000Z",
      "_id": "58132016550dfb3b52b273ad"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-06-17T11:55:00.000Z",
      "actualStartTime": "2016-06-17T11:55:00.000Z",
      "scheduledEndTime": "2016-06-23T02:00:00.000Z",
      "actualendTime": "2016-06-23T02:00:00.000Z",
      "_id": "58132016550dfb3b52b273ac"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2016-06-23T02:00:00.000Z",
      "actualStartTime": "2016-06-23T02:00:00.000Z",
      "scheduledEndTime": "2016-06-23T11:12:00.000Z",
      "actualendTime": "2016-06-23T11:12:00.000Z",
      "_id": "58132016550dfb3b52b273ab"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-06-23T11:12:00.000Z",
      "actualStartTime": "2016-06-23T11:12:00.000Z",
      "scheduledEndTime": "2016-06-25T10:29:00.000Z",
      "actualendTime": "2016-06-25T10:29:00.000Z",
      "_id": "58132016550dfb3b52b273aa"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2016-06-25T10:29:00.000Z",
      "actualStartTime": "2016-06-25T10:29:00.000Z",
      "scheduledEndTime": "2016-06-26T09:03:00.000Z",
      "actualendTime": "2016-06-26T09:03:00.000Z",
      "_id": "58132016550dfb3b52b273a9"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2016-06-26T09:03:00.000Z",
      "actualStartTime": "2016-06-26T09:03:00.000Z",
      "scheduledEndTime": "2016-06-26T10:02:00.000Z",
      "actualendTime": "2016-06-26T10:02:00.000Z",
      "_id": "58132016550dfb3b52b273a8"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2016-06-26T10:03:00.000Z",
      "actualStartTime": "2016-06-26T10:03:00.000Z",
      "scheduledEndTime": "2016-06-26T10:14:00.000Z",
      "actualendTime": "2016-06-26T10:14:00.000Z",
      "_id": "58132016550dfb3b52b273a7"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-06-26T10:14:00.000Z",
      "actualStartTime": "2016-06-26T10:14:00.000Z",
      "scheduledEndTime": "2016-06-26T13:54:00.000Z",
      "actualendTime": "2016-06-26T13:54:00.000Z",
      "_id": "58132016550dfb3b52b273a6"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-06-26T13:55:00.000Z",
      "actualStartTime": "2016-06-26T13:55:00.000Z",
      "scheduledEndTime": "2016-06-27T00:20:00.000Z",
      "actualendTime": "2016-06-27T00:20:00.000Z",
      "_id": "58132016550dfb3b52b273a5"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-06-27T13:57:00.000Z",
      "actualStartTime": "2016-06-27T13:57:00.000Z",
      "scheduledEndTime": "2016-06-30T20:20:00.000Z",
      "actualendTime": "2016-06-30T20:20:00.000Z",
      "_id": "58132016550dfb3b52b273a4"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-06-27T00:20:00.000Z",
      "actualStartTime": "2016-06-27T00:20:00.000Z",
      "scheduledEndTime": "2016-06-27T12:05:00.000Z",
      "actualendTime": "2016-06-27T12:05:00.000Z",
      "_id": "58132016550dfb3b52b273a3"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-06-27T12:05:00.000Z",
      "actualStartTime": "2016-06-27T12:05:00.000Z",
      "scheduledEndTime": "2016-06-27T13:57:00.000Z",
      "actualendTime": "2016-06-27T13:57:00.000Z",
      "_id": "58132016550dfb3b52b273a2"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-06-17T11:50:00.000Z",
  "prize": [
    1500,
    750
  ],
  "projectId": 9611,
  "registrants": [
    {
      "handle": "sapila",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T12:54:00.000Z",
      "submissionDate": null,
      "rating": "971",
      "colorStyle": "color: #00A900",
      "_id": "58132016550dfb3b52b273a1"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T12:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b273a0"
    },
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2016-06-17T12:23:00.000Z",
      "submissionDate": "2016-06-22T18:13:00.000Z",
      "rating": "2269",
      "colorStyle": "color: #EE0000",
      "_id": "58132016550dfb3b52b2739f"
    },
    {
      "handle": "Rahul.A",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T12:31:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2739e"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T13:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2739d"
    },
    {
      "handle": "btgd88",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T13:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2739c"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T13:41:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2739b"
    },
    {
      "handle": "mtj111",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T14:35:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2739a"
    },
    {
      "handle": "solokop",
      "reliability": "26%",
      "registrationDate": "2016-06-17T15:21:00.000Z",
      "submissionDate": null,
      "rating": "858",
      "colorStyle": "color: #999999",
      "_id": "58132016550dfb3b52b27399"
    },
    {
      "handle": "virose",
      "reliability": "0%",
      "registrationDate": "2016-06-17T15:30:00.000Z",
      "submissionDate": null,
      "rating": "976",
      "colorStyle": "color: #00A900",
      "_id": "58132016550dfb3b52b27398"
    },
    {
      "handle": "g.prog",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T15:48:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b27397"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T18:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b27396"
    },
    {
      "handle": "Gando19850304",
      "reliability": "0%",
      "registrationDate": "2016-06-17T19:06:00.000Z",
      "submissionDate": null,
      "rating": "989",
      "colorStyle": "color: #00A900",
      "_id": "58132016550dfb3b52b27395"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-06-17T23:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b27394"
    },
    {
      "handle": "anenthvishnu",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T05:19:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b27393"
    },
    {
      "handle": "XinScirpt",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T07:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b27392"
    },
    {
      "handle": "firedemon",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T07:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b27391"
    },
    {
      "handle": "fish00",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T07:28:00.000Z",
      "submissionDate": null,
      "rating": "541",
      "colorStyle": "color: #999999",
      "_id": "58132016550dfb3b52b27390"
    },
    {
      "handle": "dwij",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T08:12:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2738f"
    },
    {
      "handle": "srajas",
      "reliability": "6%",
      "registrationDate": "2016-06-18T08:41:00.000Z",
      "submissionDate": null,
      "rating": "1595",
      "colorStyle": "color: #DDCC00",
      "_id": "58132016550dfb3b52b2738e"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T12:05:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2738d"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2016-06-18T16:08:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2738c"
    },
    {
      "handle": "testXuSanping",
      "reliability": "n/a",
      "registrationDate": "2016-06-20T01:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2738b"
    },
    {
      "handle": "happyRats",
      "reliability": "n/a",
      "registrationDate": "2016-06-20T02:46:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132016550dfb3b52b2738a"
    },
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2016-06-20T02:57:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "58132016550dfb3b52b27389"
    }
  ],
  "registrationEndDate": "2016-06-20T11:49:00.000Z",
  "reliabilityBonus": 300,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2016-06-23T02:00:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 85.33,
      "finalScore": 87.56,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-06-22T18:13:00.000Z",
      "_id": "58132016550dfb3b52b273b0"
    }
  ],
  "technology": [
    "Bootstrap",
    "CSS",
    "HTML",
    "HTML5",
    "JavaScript"
  ]
}