{
  "_id": 30051231,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:32:58.191Z",
  "appealsEndDate": "2015-08-28T23:06:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "IBM - SiBM Support Easy OnBoarding UI Prototype Challenge - Part 1",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p>Welcome to &quot;<strong>IBM - SiBM Support Easy OnBoarding UI Prototype Challenge 1</strong>&quot;. The goal of this challenge is to create a responsive HTML5 Prototype for our Support Easy OnBoarding Application. The prototype must follow the best practices for coding Responsive applications. This challenge is the first prototype challenge to create the &quot;Base&quot; prototype that we can continue to develop with in future challenges.</p>\n\n<p><span>As part of this challenge we need you to document your HTML5/CSS3/JavaScript code (using best practices). We are looking for a clear explanation of the code to allow us the ability to quickly update and integrate with future development. As this challenge is a FAST challenge we will allow documentation updates during final fixes if needed.</span></p>\n\n<p><span style=\"color:#0000FF\"><strong>Challenge Task Overview</strong></span><br />\nThe main task of this competition is to develop a Responsive HTML5 prototype based on the provided storyboard designs. We are focused on the Desktop but optimized for Tablet view for this challenge. It is very important that you implement and use <strong>Bootstrap</strong> correctly so we can update the mobile views in a future challenge.</p>\n\n<p><span style=\"color:#008000\"><strong>Tips for Success: Ask questions early and get the Copilot or PM&#39;s feedback is very important for everyone to be successful in UI Prototype challenges.</strong></span></p>\n\n<p><span style=\"color:#0000FF\"><strong>Key Requirements</strong></span><br />\n- Focus on overall Bootstrap/great code structure.<br />\n- Replicate the design of the approved Storyboards (PSD Files) for all pages.<br />\n- Ensure your pages display correctly in all browsers. It is your responsibility to make sure the pages display correctly.<br />\n- This application will be a responsive HTML5 application - it will need to be scalable for different devices (mobile devices, tablets, and desktops), but for now, focus only on Desktop and Tablet version.&nbsp;<br />\n- Ensure you submission clear of HTML and CSS Validation error and warning.</p>\n\n<p><span style=\"color:#FF0000\"><strong>How to use the wireframes</strong><br />\n- Use &quot;Final Wireframes!&quot; folder and run index.html<br />\n- Close the sidebar by clicking the &quot;x&quot; button on the left side of sidebar for bigger display on the wireframes<br />\n- The wireframes create dynamically so all interactions will be happen in single screen<br />\n- Make sure to use the navigation/menus in the screen to navigate to another screens (no scrolling please)<br />\n- Each screen will be appear one by one according to their respected flow.&nbsp;<br />\n- Got any questions, please ask in forum!!</span></p>\n\n<p><span style=\"color:#0000FF\"><strong>Screen Requirements</strong></span><br />\n<strong>General Requirements :</strong><br />\n- There is a lot of interaction with CATHY (Client Agent To Help You!) character in the application, please check the wireframes and spec details to get an idea where CATHY will be appear.<br />\n- CATHY image must have it&#39;s different container in your code where user can easily edit the avatar appearance, the current avatar used in current design will be replaced with new avatar design.<br />\n- We will have CATHY animated by a 3rd party - the key thing now is to make sure we have her in a &lt;div&gt; or easy access to add the animation.</p>\n\n<p><strong>01. Homepage Screen</strong><br />\n<em>- Reference Screens &quot;01_1_homepage.png&quot; and &quot;01_2_homepage.png&quot;</em><br />\n- Default page that will be appear every time a user opens the app<br />\n- This page show Introduction Scene to welcome user in the application<br />\n- Clicking &quot;Get CATHY&quot; button will trigger CATHY character to appear in the app (01_2_homepage.png)<br />\n- Capture the CATHY interaction when showing dialog box in the screen<br />\n- In order to start the application, user needs to called CATHY first and click the &quot;Click on CATHY to get started&quot; link to go to the next page.</p>\n\n<p><strong>02. Get Started Screen</strong><br />\n<em>- Reference Screen &quot;02_get_started.png&quot;</em><br />\n- In this screen, CATHY will guide the user about what they will see and experience in this apps.&nbsp;<br />\n- There are 5 steps/interactions available in this applications, they are :<br />\n* Step 1 - Obtain an IBM ID<br />\n* Step 2 - Sign Up for My Notifications (Out Of Scope)<br />\n* Step 3 - Access the IBM Support Portal (Out Of Scope)<br />\n* Step 4 - Register for Service Request (Ouf of Scope)<br />\n* Step 5 - Passport Advantage *Optional (Out Of Scope)<br />\n- CATHY will show to the user that they will need to go through eachs step, one by one, without skip any of it in order to experience full &quot;Support Easy OnBoarding&quot; interactions.<br />\n- Detail content for each steps can be found in &quot;Five basic onboarding tasks_For TopCoders_Verified 7_23_15.doc&quot; document and for this challenge, only &quot;Obtain an IBM ID&quot; screens creation needed in this challenge.&nbsp;<br />\n- Click &quot;Let&#39;s Get Started&quot; button will bring user to the first step of &quot;Support Easy OnBoarding&quot; journey.</p>\n\n<p><strong>03. STEP 1 Screens - Obtain an IBM ID</strong><br />\n<em>- Reference Screen &quot;03_1_IBM_ID.png&quot; and &quot;03_2_IBM_ID.png&quot;</em><br />\n- This is the first step in &quot;Support Easy OnBoarding&quot; interactions<br />\n- User will learn and get some tutorials on how to achieve/get IBM ID<br />\n- Notice the bottom bar section, it will show user experience journey progress in the apps. Make sure to keep the bottom bar section at the bottom of the screen for all devices (desktop and tablet)<br />\n- The progress bar at the center show in which steps user current position. Blue border circle show user current position.<br />\n- THe IBM orange circle/medals show how many medals that the user get so far, each time they finish &quot;Step&quot; in the apps, they will earn one medals. These medals can be use to play mini game at the end of the journey/apps (gamification mode)&nbsp;<br />\n- User can called CATHY anytime by clicking the CATHY avatar (03_2_IBM_ID.png)<br />\n- If user already have IBM ID, they can enter their IBM ID on the left side of the screen and the apps will bring user to the last step in the apps before they close the challenge/continue step (bring user to &quot;06_welcome_back.png&quot; screen)<br />\n- If user don&#39;t have IBM ID, they can learn and experience some tutorial in the apps on how to obtain an IBM ID, what they need to do is to click &quot;New Customer&quot; button.&nbsp;<br />\n- After user click the New Customer Button, they will go to next pages which will explain the user about how to get IBM ID, there will be 4 tabs in the next page which are :&nbsp;</p>\n\n<p><em><strong>* Introduction Tab</strong></em><br />\n--- Reference Screen &quot;03_3_IBM_ID.png&quot;<br />\n--- Introduction sentence about what is IBM ID and it&#39;s purpose in the application<br />\n--- Click &quot;Continue&quot; to go to the next tab</p>\n\n<p><em><strong>* Videos Tab</strong></em><br />\n--- Reference Screen &quot;03_4_IBM_ID.png&quot;, &quot;03_5_IBM_ID.png&quot;, &quot;03_6_IBM_ID.png&quot;<br />\n--- This tab will show videos tutorial about how to obtain IBM ID&nbsp;<br />\n--- If the tutorial have one video, show &quot;03_4_IBM_ID.png&quot;<br />\n--- If the video tutorial over and there are many related videos in the apps, show &quot;03_5_IBM_ID.png&quot;<br />\n--- If the video tutorial over and only two related videos available in the apps, show &quot;03_6_IBM_ID.png&quot;<br />\n--- Click any of the thumbnail video will play the video to user, click play again will replay the current video and clicking Continue will bring user to the Quiz tab.</p>\n\n<p><em><strong>* Quiz Series Tab</strong></em><br />\n--- Reference Screens &quot;03_7_IBM_ID.png&quot;, &quot;03_8_IBM_ID.png&quot;, &quot;03_9_IBM_ID.png&quot;, &quot;03_10_IBM_ID.png&quot;, &quot;03_11_IBM_ID.png&quot;<br />\n--- After user see the introduction tab and videos tab, the application will test user knowledge via quiz series.<br />\n--- There will be a popup along with CATHY character to welcome the user to the quiz (03_7_IBM_ID.png), click Begin to start the quiz<br />\n--- There will be 4 questions asked in the quiz for Step 1, See the content for Step 1 quiz from &quot;Quiz_Gamified_Onboarding_TopCoders.pdf&quot; document<br />\n--- User will see each questions and able to track their quiz current progress/how many quiz the user has been taken via progress bar in the quiz screen (03_8_IBM_ID.png)<br />\n--- User will be able to select one of the answer in the quiz, and once they do this, the apps will show whether the user correct or wrong to answer the question.<br />\n--- If the answer is wrong show screen &quot;03_9_IBM_ID.png&quot; and show the correct answer in darker color. Notic there are two buttons &quot;Explanation&quot; (to explain the correct answer) and &quot;Next&quot; to go to the next quiz.&nbsp;<br />\n--- Once user reach the last questions and answer it (03_10_IBM_ID.png), the will be redirected to CATHY again &quot;03_11_IBM_ID.png&quot; that explain the quiz series is finished.</p>\n\n<p><em><strong>* Sign Up Tab</strong></em><br />\n- Reference Screen &quot;03_12_IBM_ID.png&quot;<br />\n- After going through and experience all the tutorials help, user now ready to create the IBM ID.&nbsp;<br />\n- They need to click the &quot;Sign Up&quot; button to register and get IBM ID, the registration it self will be done in different application.&nbsp;<br />\n- Once they registered, they will open this apps again and login with their IBM ID</p>\n\n<p><span style=\"color:#FF0000\">NOTES : There are another 4 STEPS (3 Mandatory, 1 Optional) available in the apps, but for now, Only this STEP 1 needed to be created.</span></p>\n\n<p><strong>04. STEP Completed Screen</strong><br />\n<em>- Reference Screens &quot;04_1_step_completed.png&quot;, &quot;04_2_step_completed.png&quot;</em><br />\n- Each time user complete each STEP, there will be CATHY appearance that show the user current progress and visualize in &quot;04_1_step_completed.png&quot; screen.<br />\n- Screen &quot;04_2_step_completed.png&quot; showing that all the STEPS in the apps has been complete.<br />\n- In screen &quot;04_1_step_completed.png&quot;, when user click Next button, it will redirect user to &quot;04_2_step_completed.png&quot;.<br />\n- If user click Next button in &quot;04_2_step_completed.png&quot; screen, they will be redirected to Certificate Completion Screen</p>\n\n<p><strong>05. Certificate Completion Screen</strong><br />\n<em>- Reference Screens &quot;05_1_certificate.png&quot;, &quot;05_2_certificate.png&quot;, &quot;05_3_certificate.png&quot;</em><br />\n- By default, screen &quot;05_1_certificate.png&quot; will appear in this screen.&nbsp;<br />\n- If user click &quot;Get Certification&quot; link, they will be redirected to &quot;05_2_certificate.png&quot; screen<br />\n- In &quot;05_2_certificate.png&quot; screen, user will need to enter their name and email address so CATHY can send the electronic certificate to user email.<br />\n- Cliking &quot;Submit&quot; button will bring user to certificate preview &quot;05_3_certificate.png&quot;.&nbsp;<br />\n- If user click &quot;Close&quot; button, it will redirect user to Play The Game screen</p>\n\n<p><strong>06. Play The Game Screen</strong><br />\n<em>- Reference Screen &quot;05_4_play_game.png&quot;, &quot;05_5_play_game.png&quot;, &quot;05_6_play_game.png&quot;</em><br />\n- So, user already finished all steps, they will earn 4 medals/token that can be spent in this screen to play mini games provided by IBM<br />\n- Show us simulation when user select the game in screen &quot;05_5_play_game.png&quot; and condition state where user play the game &quot;05_6_play_game.png&quot;<br />\n- After user play the games, it also means that user already reach the ends of their journey in this apps.</p>\n\n<p><strong>07. Welcome Back Screen</strong><br />\n<em>- Reference Screen &quot;06_welcome_back.png&quot;</em><br />\n- This screen will showed up everytime user logged in back after out from the apps.<br />\n- This screen will be appear if user enter the IBM ID in step one and when user click &quot;Continue&quot; button, it will redirect user to the last step where user currently in.</p>\n\n<p><strong>08. About Screen</strong><br />\n<em>- Reference Screen &quot;07_about.png&quot;</em><br />\n- Very simple screen to show application purpose.</p>\n\n<p><span style=\"color:#0000FF\"><strong>Specific HTML/CSS/JavaScript Requirements</strong></span><br />\n<strong>HTML/CSS Requirements:</strong><br />\n- Your HTML code must be valid HTML5 and follow best practices<br />\n- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.<br />\n- No inline CSS styles - all styles must be placed in an external style-sheet.<br />\n- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.<br />\n- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.</p>\n\n<p><strong>JavaScript Requirements:</strong><br />\n- All JavaScript used must not have any copyrights to any third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- You are allowed to use JQuery and Bootstrap framework for this challenge.</p>\n\n<p><span style=\"color:#0000FF\"><strong>Browsers Requirements</strong></span><br />\n- Chrome is a priority<br />\n- Latest Firefox, Safari &amp; Chrome Browsers<br />\n- IE10++ (can be left for final fixes)</p>\n\n<p><span style=\"color:#0000FF\"><strong>Documentation Provided</strong></span><br />\n- Wireframes, Storyboard and All necessary flow documents can be found in forum!<br />\n- Documentation :&nbsp;<br />\n* <em>Five basic onboarding tasks_For TopCoders_Verified 7_23_15.doc</em>, show all 5 detail STEPS in the apps<br />\n* <em>WF Winner feedback_Topcoder copy.doc</em>, contains documentation about interaction change needed for your prototype.<br />\n* <em>Quiz_Gamified_Onboarding_TopCoders.pdf</em>, quiz questions for each STEPS<br />\n* <em>Terminology_For_GO.pdf</em>, dictionary and idiom explanation related to the apps.<br />\n* <em>End of Support Q.pdf</em>, content for Helpful Linkss</p>\n",
  "digitalRunPoints": 630,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30051231",
  "event": {
    "id": 3446,
    "description": "2016 TopCoder(R) Open",
    "shortDescription": "tco16"
  },
  "finalFixEndDate": "2015-09-05T07:00:00.000Z",
  "finalSubmissionGuidelines": "<p><strong>Submission Deliverables:</strong><br />\n- A complete list of deliverables can be viewed in the <a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\">UI Prototype Competitions Tutorial</a>.&nbsp;</p>\n\n<p><strong>Final Submission:</strong><br />\n- For each member, the final submission should be uploaded to the <a href=\"https://software.topcoder.com/review\">Online Review Tool</a>.&nbsp;</p>\n",
  "forumId": 30348,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=30348",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 49,
  "numberOfSubmissions": 4,
  "phases": [
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-08-30T04:39:00.000Z",
      "actualStartTime": "2015-08-30T04:39:00.000Z",
      "scheduledEndTime": "2015-08-30T11:52:00.000Z",
      "actualendTime": "2015-08-30T11:52:00.000Z",
      "_id": "5813295a550dfb3b52b63ba8"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-08-30T11:52:00.000Z",
      "actualStartTime": "2015-08-30T11:52:00.000Z",
      "scheduledEndTime": "2015-08-30T20:07:00.000Z",
      "actualendTime": "2015-08-30T20:07:00.000Z",
      "_id": "5813295a550dfb3b52b63ba7"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-08-31T07:03:00.000Z",
      "actualStartTime": "2015-08-31T07:03:00.000Z",
      "scheduledEndTime": "2015-08-31T18:19:00.000Z",
      "actualendTime": "2015-08-31T18:19:00.000Z",
      "_id": "5813295a550dfb3b52b63ba6"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-08-31T18:19:00.000Z",
      "actualStartTime": "2015-08-31T18:19:00.000Z",
      "scheduledEndTime": "2015-08-31T22:40:00.000Z",
      "actualendTime": "2015-08-31T22:40:00.000Z",
      "_id": "5813295a550dfb3b52b63ba5"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-08-31T22:42:00.000Z",
      "actualStartTime": "2015-08-31T22:42:00.000Z",
      "scheduledEndTime": "2015-09-01T05:31:00.000Z",
      "actualendTime": "2015-09-01T05:31:00.000Z",
      "_id": "5813295a550dfb3b52b63ba4"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-01T05:31:00.000Z",
      "actualStartTime": "2015-09-01T05:31:00.000Z",
      "scheduledEndTime": "2015-09-01T09:02:00.000Z",
      "actualendTime": "2015-09-01T09:02:00.000Z",
      "_id": "5813295a550dfb3b52b63ba3"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-09-01T09:03:00.000Z",
      "actualStartTime": "2015-09-01T09:03:00.000Z",
      "scheduledEndTime": "2015-09-03T18:27:00.000Z",
      "actualendTime": "2015-09-03T18:27:00.000Z",
      "_id": "5813295a550dfb3b52b63ba2"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-09-03T18:28:00.000Z",
      "actualStartTime": "2015-09-03T18:28:00.000Z",
      "scheduledEndTime": "2015-09-05T07:00:00.000Z",
      "actualendTime": "2015-09-05T07:00:00.000Z",
      "_id": "5813295a550dfb3b52b63ba1"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-05T07:00:00.000Z",
      "actualStartTime": "2015-09-05T07:00:00.000Z",
      "scheduledEndTime": "2015-09-05T09:18:00.000Z",
      "actualendTime": "2015-09-05T09:18:00.000Z",
      "_id": "5813295a550dfb3b52b63ba0"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-09-05T09:19:00.000Z",
      "actualStartTime": "2015-09-05T09:19:00.000Z",
      "scheduledEndTime": "2015-09-10T22:49:00.000Z",
      "actualendTime": "2015-09-10T22:49:00.000Z",
      "_id": "5813295a550dfb3b52b63b9f"
    },
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-08-21T20:42:00.000Z",
      "actualStartTime": "2015-08-21T20:42:00.000Z",
      "scheduledEndTime": "2015-08-21T20:43:00.000Z",
      "actualendTime": "2015-08-21T20:43:00.000Z",
      "_id": "5813295a550dfb3b52b63b9e"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2015-08-21T20:43:00.000Z",
      "actualStartTime": "2015-08-21T20:43:00.000Z",
      "scheduledEndTime": "2015-08-22T00:12:00.000Z",
      "actualendTime": "2015-08-22T00:12:00.000Z",
      "_id": "5813295a550dfb3b52b63b9d"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2015-08-22T00:12:00.000Z",
      "actualStartTime": "2015-08-22T00:12:00.000Z",
      "scheduledEndTime": "2015-08-26T00:11:00.000Z",
      "actualendTime": "2015-08-26T00:11:00.000Z",
      "_id": "5813295a550dfb3b52b63b9c"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-08-22T00:18:00.000Z",
      "actualStartTime": "2015-08-22T00:18:00.000Z",
      "scheduledEndTime": "2015-08-27T00:01:00.000Z",
      "actualendTime": "2015-08-27T00:01:00.000Z",
      "_id": "5813295a550dfb3b52b63b9b"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2015-08-27T00:01:00.000Z",
      "actualStartTime": "2015-08-27T00:01:00.000Z",
      "scheduledEndTime": "2015-08-27T05:00:00.000Z",
      "actualendTime": "2015-08-27T05:00:00.000Z",
      "_id": "5813295a550dfb3b52b63b9a"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2015-08-27T05:00:00.000Z",
      "actualStartTime": "2015-08-27T05:00:00.000Z",
      "scheduledEndTime": "2015-08-28T11:04:00.000Z",
      "actualendTime": "2015-08-28T11:04:00.000Z",
      "_id": "5813295a550dfb3b52b63b99"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2015-08-28T11:04:00.000Z",
      "actualStartTime": "2015-08-28T11:04:00.000Z",
      "scheduledEndTime": "2015-08-28T23:05:00.000Z",
      "actualendTime": "2015-08-28T23:05:00.000Z",
      "_id": "5813295a550dfb3b52b63b98"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2015-08-28T23:05:00.000Z",
      "actualStartTime": "2015-08-28T23:05:00.000Z",
      "scheduledEndTime": "2015-08-28T23:06:00.000Z",
      "actualendTime": "2015-08-28T23:06:00.000Z",
      "_id": "5813295a550dfb3b52b63b97"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2015-08-28T23:06:00.000Z",
      "actualStartTime": "2015-08-28T23:06:00.000Z",
      "scheduledEndTime": "2015-08-28T23:14:00.000Z",
      "actualendTime": "2015-08-28T23:14:00.000Z",
      "_id": "5813295a550dfb3b52b63b96"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-08-28T23:14:00.000Z",
      "actualStartTime": "2015-08-28T23:14:00.000Z",
      "scheduledEndTime": "2015-08-29T22:56:00.000Z",
      "actualendTime": "2015-08-29T22:56:00.000Z",
      "_id": "5813295a550dfb3b52b63b95"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-08-29T22:56:00.000Z",
      "actualStartTime": "2015-08-29T22:56:00.000Z",
      "scheduledEndTime": "2015-08-30T04:39:00.000Z",
      "actualendTime": "2015-08-30T04:39:00.000Z",
      "_id": "5813295a550dfb3b52b63b94"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-08-30T20:07:00.000Z",
      "actualStartTime": "2015-08-30T20:07:00.000Z",
      "scheduledEndTime": "2015-08-31T07:02:00.000Z",
      "actualendTime": "2015-08-31T07:02:00.000Z",
      "_id": "5813295a550dfb3b52b63b93"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2015-08-22T00:12:00.000Z",
  "prize": [
    1400,
    700
  ],
  "projectId": 8965,
  "registrants": [
    {
      "handle": "diogenesjcs",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T00:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b92"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T01:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b91"
    },
    {
      "handle": "savon_cn",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T01:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b90"
    },
    {
      "handle": "gjw99",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T02:25:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b8f"
    },
    {
      "handle": "dileepa",
      "reliability": "100%",
      "registrationDate": "2015-08-22T02:29:00.000Z",
      "submissionDate": "2015-08-26T19:12:00.000Z",
      "rating": "1746",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295a550dfb3b52b63b8e"
    },
    {
      "handle": "ahmed.seddiq",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T02:57:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b8d"
    },
    {
      "handle": "kcchiu",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T03:31:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b8c"
    },
    {
      "handle": "lintc",
      "reliability": "0%",
      "registrationDate": "2015-08-22T04:03:00.000Z",
      "submissionDate": null,
      "rating": "1589",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295a550dfb3b52b63b8b"
    },
    {
      "handle": "srajas",
      "reliability": "13%",
      "registrationDate": "2015-08-22T04:46:00.000Z",
      "submissionDate": null,
      "rating": "1497",
      "colorStyle": "color: #6666FF",
      "_id": "5813295a550dfb3b52b63b8a"
    },
    {
      "handle": "nomo_kazza",
      "reliability": "40%",
      "registrationDate": "2015-08-22T04:58:00.000Z",
      "submissionDate": "2015-08-26T21:27:00.000Z",
      "rating": "1108",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63b89"
    },
    {
      "handle": "InteR1337",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T05:25:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b88"
    },
    {
      "handle": "tejju",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T06:11:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b87"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T06:35:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b86"
    },
    {
      "handle": "Trapti333",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T08:56:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b85"
    },
    {
      "handle": "KrisD",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T09:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b84"
    },
    {
      "handle": "arch_angel",
      "reliability": "6%",
      "registrationDate": "2015-08-22T10:38:00.000Z",
      "submissionDate": null,
      "rating": "768",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63b83"
    },
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2015-08-22T10:44:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63b82"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T11:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b81"
    },
    {
      "handle": "KrishnaAnbu",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T13:58:00.000Z",
      "submissionDate": "2015-08-23T21:37:00.000Z",
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b80"
    },
    {
      "handle": "bannie2492",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T14:33:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b7f"
    },
    {
      "handle": "ShindouHikaru",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T16:19:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b7e"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2015-08-22T23:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b7d"
    },
    {
      "handle": "szy2015",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T00:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b7c"
    },
    {
      "handle": "frontendyummy",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T06:33:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b7b"
    },
    {
      "handle": "lijia1990",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T06:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b7a"
    },
    {
      "handle": "topcodder02",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T12:22:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b79"
    },
    {
      "handle": "holyness",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T12:43:00.000Z",
      "submissionDate": null,
      "rating": "695",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63b78"
    },
    {
      "handle": "mohhasbias",
      "reliability": "0%",
      "registrationDate": "2015-08-23T14:01:00.000Z",
      "submissionDate": "2015-08-26T22:58:00.000Z",
      "rating": "736",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63b77"
    },
    {
      "handle": "Luckyodell",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T15:18:00.000Z",
      "submissionDate": null,
      "rating": "261",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63b76"
    },
    {
      "handle": "Ganesh_Madhu",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T17:05:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b75"
    },
    {
      "handle": "kreasindo",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T19:15:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b74"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T21:32:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b73"
    },
    {
      "handle": "smartoarif",
      "reliability": "n/a",
      "registrationDate": "2015-08-23T23:21:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b72"
    },
    {
      "handle": "DawnB",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T02:15:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b71"
    },
    {
      "handle": "halceyon",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T08:17:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b70"
    },
    {
      "handle": "brunch",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T10:42:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b6f"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T13:17:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b6e"
    },
    {
      "handle": "rh_abror",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T14:18:00.000Z",
      "submissionDate": null,
      "rating": "806",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63b6d"
    },
    {
      "handle": "Kevin.DeAsis",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T15:00:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b6c"
    },
    {
      "handle": "luisse",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T16:33:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b6b"
    },
    {
      "handle": "Rakesh.Sa",
      "reliability": "n/a",
      "registrationDate": "2015-08-24T21:52:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b6a"
    },
    {
      "handle": "YiiBryan",
      "reliability": "0%",
      "registrationDate": "2015-08-24T21:57:00.000Z",
      "submissionDate": null,
      "rating": "1039",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63b69"
    },
    {
      "handle": "cinoss",
      "reliability": "n/a",
      "registrationDate": "2015-08-25T04:56:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b68"
    },
    {
      "handle": "systic",
      "reliability": "11%",
      "registrationDate": "2015-08-25T06:20:00.000Z",
      "submissionDate": null,
      "rating": "1216",
      "colorStyle": "color: #6666FF",
      "_id": "5813295a550dfb3b52b63b67"
    },
    {
      "handle": "iz4fl4me",
      "reliability": "n/a",
      "registrationDate": "2015-08-25T08:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b66"
    },
    {
      "handle": "wcheung",
      "reliability": "n/a",
      "registrationDate": "2015-08-25T09:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b65"
    },
    {
      "handle": "linuxgeek",
      "reliability": "n/a",
      "registrationDate": "2015-08-25T13:03:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b64"
    },
    {
      "handle": "gokul.0369",
      "reliability": "n/a",
      "registrationDate": "2015-08-25T18:42:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b63"
    },
    {
      "handle": "royalrajdeep",
      "reliability": "n/a",
      "registrationDate": "2015-08-25T21:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63b62"
    }
  ],
  "registrationEndDate": "2015-08-26T00:11:00.000Z",
  "reliabilityBonus": 280,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2015-08-27T00:01:00.000Z",
  "submissions": [
    {
      "handle": "dileepa",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 95.56,
      "finalScore": 95.56,
      "points": 409.5,
      "submissionStatus": "Active",
      "submissionDate": "2015-08-26T19:12:00.000Z",
      "_id": "5813295a550dfb3b52b63bac"
    },
    {
      "handle": "nomo_kazza",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 85.44,
      "finalScore": 85.44,
      "points": 157.5,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2015-08-26T21:27:00.000Z",
      "_id": "5813295a550dfb3b52b63bab"
    },
    {
      "handle": "mohhasbias",
      "placement": 3,
      "screeningScore": 100,
      "initialScore": 54.67,
      "finalScore": 54.67,
      "points": 63,
      "submissionStatus": "Failed Review",
      "submissionDate": "2015-08-26T22:58:00.000Z",
      "_id": "5813295a550dfb3b52b63baa"
    },
    {
      "handle": "KrishnaAnbu",
      "placement": null,
      "screeningScore": 0,
      "initialScore": null,
      "finalScore": null,
      "points": 0,
      "submissionStatus": "Failed Screening",
      "submissionDate": "2015-08-23T21:37:00.000Z",
      "_id": "5813295a550dfb3b52b63ba9"
    }
  ],
  "technology": [
    "Bootstrap",
    "CSS",
    "HTML",
    "HTML5",
    "JavaScript",
    "jQuery"
  ]
}