{
  "_id": 30053172,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:33:03.290Z",
  "appealsEndDate": "2016-03-14T11:48:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Umbrella City Builder Game Proto Challenge 1",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p dir=\"ltr\">Welcome to Umbrella City Builder Game Proto Challenge 1. The goal of this challenge is to create the HTML5 Prototype using the provided &quot;Umbralla City Game Builder&quot; storyboards. The prototype must follow our standards and our guidelines. Review the details below.<br />\n<br />\n<span>As part of this challenge we need you to document your HTML5/CSS3/JavaScript code (using best practices). We are looking for a clear explanation of the code to allow us the ability to quickly update and integrate with future development. We will allow documentation updates during final fixes (but still required).</span><br />\n<br />\n<span style=\"color:#FF0000\">This challenge will leverage Bootstrap (</span><a href=\"http://getbootstrap.com/getting-started\"><span style=\"color:#FF0000\">http://getbootstrap.com/getting-started</span></a><span style=\"color:#FF0000\">). This prototype will be responsive, but currently we don&#39;t have the storyboards for mobile and tablet version, so just make sure to adjust the layouts for mobile and tablets as you see fit (no specific restrictions on how you come up with that) but make sure it doesn&#39;t look cluttered or messy!</span><br />\n<span style=\"color:rgb(0, 0, 0); font-family:arial,sans-serif; font-size:12.8px; line-height:normal\">&nbsp;</span><br />\n<strong style=\"color:rgb(0, 128, 0); line-height:1.6\">Tips for Success: Asking questions early and getting Copilot or PM&#39;s feedback is very important for the success of this challenge.</strong></p>\n\n<p dir=\"ltr\"><span><span style=\"color:#FF0000\"><strong>Competition Task Overview:</strong></span></span><br />\n<span>The main task of this competition is to develop an HTML5 prototype based on the provided storyboard designs. Your prototype must work properly in all the required browsers.</span><br />\n<br />\n<span><strong><span style=\"color:#0000FF\">Key Requirements:</span></strong></span><br />\n<span>- Test in all the required browsers (see the list below)</span><br />\n<span>- Ensure your submission is clear of HTML and CSS Validation errors and warnings.</span><br />\n<span>- You are provided with a storyboards &amp; source files!<br />\n- We have also provided a PDF with the flow of the screens.</span><br />\n<br />\n<span><span style=\"color:#0000FF\"><strong>Required Pages:</strong></span></span><br />\n<span><strong>0) Global Framework / All Screens:</strong></span><br />\n<span>NOTE: In any instance where the source file (PSD) does not match the screen files (PNG), please follow the PNG.</span><br />\n<br />\n<span>Header:</span><br />\n<span>LOGO: The logo (upper left) should be a transparent graphic, in case the customer wants to swap it out later. Click on this shows no hover state and takes the user to the home page (play).</span><br />\n<br />\n<span><strong>Main Menu:</strong></span><br />\n<span>- We need below menu items in the navigation:</span><br />\n<span>- - PLAY: Clicking on this item takes the user to&nbsp;</span>Home / Play (00_Play.png)<br />\n<span>- - LEADERBOARD:&nbsp;Clicking on this item takes the user to Leaderboard page (</span>02A_leaderboard.png<span>)</span><br />\n<span>- - RULES:&nbsp;Clicking on this item takes the user to&nbsp;Rules page (</span>03_Rules.png<span>)</span><br />\n<span>- - HELP: Clicking on this item will just be a link to launch an email - use &ldquo;me@umbrella.com&rdquo; for the &ldquo;to&rdquo; address and make the subject line &ldquo;City Builder Support Question&rdquo;</span><br />\n<span>- Hover state and active state are the same (follow the storyboards)</span><br />\n<span>- - colored background blocks behind the active item and change to white text and icon</span><br />\n<span>- Each of the item in the navigation should allow the text to be edited (not a graphic)</span><br />\n<br />\n<span><strong>Footer:</strong></span><br />\n<span>The center content area is a fixed height on most screens, and the hotter content is tied to it, so if the viewing area in the user&rsquo;s browser is taller than the screen content, show blank white space below the design rather than pushing the footer content down.</span><br />\n<br />\n<span style=\"line-height:1.6\">- FOOTER LEFT content here shows the user&rsquo;s placement on the leaderboard (star icon) and the related revitalization stats:</span><br />\n<span style=\"line-height:1.6\">&mdash; The star should be separate from the number text</span><br />\n<span style=\"line-height:1.6\">&mdash; The placement numbers can be anything from 1 through 999, and then for higher placments it will just show &ldquo;999+&rdquo; (meaning they are ranking lower than the top 999). The star shape must be coded separately<br />\nfrom the numbers and the shape comes in four colors (see screen #7 in PDF). </span><span style=\"line-height:1.6\">Please slightly reduce the font size of the number here to allow for the &ldquo;999+&rdquo; as shown in the provided &ldquo;999.png&rdquo; screenshot and play screen (the &ldquo;play&rdquo; version has been modified to show this correctly, but please make sure to use this same font size on all versions, including the leaderboard screens!)</span><br />\n<span style=\"line-height:1.6\">&mdash; Please show the revitalization text as &ldquo;60 blocks / 15 neighborhoods&rdquo; (as seen in first two screens and play PSD)</span><span style=\"line-height:1.6\">.</span><br />\n<br />\n<span style=\"line-height:1.6\">- FOOTER CENTER content here shows the user&rsquo;s profile photo and related name and level name.</span><br />\n<span style=\"line-height:1.6\">&mdash; Client will changing these dummy images at a later point of time!</span><br />\n<span style=\"line-height:1.6\">&mdash; Possible levels are: City Janitor (current), Town Planner, Structural Engineer, Junior Architect, Competent Architect, Black belt Architect, Overlord Architect (and each has a related icon, seen in footer right content).</span><br />\n<br />\n<span style=\"line-height:1.6\">- FOOTER RIGHT content here shows the player&rsquo;s budget and related level icon. Maximum budget characters allowed is &ldquo;$xxx, xxx,xxx,xxx&rdquo; so you will have to expand the gray rounded corner background to account for this larger number.</span><br />\n<br />\n<span style=\"line-height:1.6\">- FOOTER BOTTOM content here shows copyright placeholder text on the left and placeholder links on the right (privacy / security / terms). Please use dead links (href=&ldquo;#&rdquo;) for these links, for now.</span></p>\n\n<p dir=\"ltr\"><span><strong>1) Home / Play:</strong></span><br />\n<span><span style=\"color:#0000FF\"><em>Reference: 00_Play.png</em></span></span><br />\n<span>This is a placeholder for the game section that will be created in the second prototype challenge. For now:</span><br />\n<span>- Use this as the screen seen when user taps &ldquo;play&rdquo; in the top main menu. (also the &ldquo;home page&rdquo;).</span><br />\n<span>- Make the entire enter graphic (just the rounded graphic area in the center) a link for the QUESTION screen (</span><span>01A_Play.png</span><span>).</span><br />\n<br />\n<span><strong>2) Question &amp; Answer:</strong></span><br />\n<span><span style=\"color:#0000FF\"><em>Reference: 01A_Play.png</em></span></span><br />\n<span>This is where the user reads the question and selects an answer.</span><br />\n<br />\n<span>- QUESTION content will show the question label (orange) and smaller question text.</span><br />\n<span>&mdash; The height of this area is FIXED so the question cannot be longer than space allotted (max of one line more than question shown in graphic), so please add another line of question (use dummy text like storyboard) here to show max question size.</span><br />\n<span>&mdash; The image to the left of the question will be an image of the related city piece (selected on screen #1 (Home / Play) - to be created later). The orange circle around the game piece graphics should be a separate layer over the square game piece graphics that will be in the system, so that the customer will not have to create the round versions of the game pieces they will be adding later.</span><br />\n<span>- ANSWER content will show three (3) possible answers for the player to choose from.</span><br />\n<span>&mdash; The answers (before selection) are shown as 01A_Play.png:</span><br />\n<span>&mdash;&mdash; orange answer label circle with white number (1-3)</span><br />\n<span>&mdash;&mdash; white question background shape with dark gray answer text.</span><br />\n<span>&mdash; The answers (on hover and after selection) are shown as 01B_Play_Solution_Selected.png:</span><br />\n<span>&mdash;&mdash; white answer label circle with orange number (1-3)</span><br />\n<span>&mdash;&mdash; orange question background shape with white answer text.</span><br />\n<span>&mdash; The blue &ldquo;[arrow back]&ldquo; button on the bottom left of the answer area will take the user back to the home page (screen #1 - Home / Play). Hover state for this will be a reverse to white arrow on blue circle<br />\nbackground.</span><br />\n<span>&mdash; The green &ldquo;[checkmark]&rdquo; button on the bottom right of the answer :</span><br />\n<span>&mdash;&mdash; will show the &ldquo;light green checkmark&rdquo; (inactive state) and do nothing at all UNTIL an answer is selected (not hover state).</span><br />\n<span>&mdash;&mdash; will change to the &ldquo;white checkmark&rdquo; version (active state) once an answer is selected and user can now click to see answer feedback popup. No hover state change for this.</span><br />\n<br />\n<span><strong>3) Answer Feedback Popups:</strong></span><br />\n<span><span style=\"color:#0000FF\"><em>Reference: 01C_Play_Failed.png, 01D_Play_Pass.png, 01E_Play_Success.png</em></span></span><br />\n<br />\n<span>This is where the player sees the feedback on the answer selected, after clicking the green checkmark button (submit).</span><br />\n<br />\n<span>WRONG ANSWER will result in the popup seen on 01C_Play_Failed.png (Oops!). The user MUST hit the green &ldquo;retry&rdquo; button and select a different answer in order to continue. &nbsp;On click of &ldquo;retry&rdquo;, no hover state / modal disappears and user still sees the answer he initially selected (active state). He must choose one of the other two answers in order to complete the question.</span><br />\n<br />\n<span>ACCEPTABLE ANSWER will result in the popup seen on 01D_Play_Pass.png (Not Bad). Please note that the &ldquo;y&rdquo; in &ldquo;you will not receive a budget increase&rdquo; should be a capital &ldquo;Y&rdquo;. In this modal the user has three (3) options:</span><br />\n<span>- he can tap the home icon (left) to give up and go back to the home page (Screen #1)</span><br />\n<span>- he can tap the retry icon (center) to try to select a better answer (BUT he will loose budget if he does so!). Note that if the user hits &ldquo;retry&rdquo; and returns to the questions screen, the answer he chose will still be selective / active.</span><br />\n<span>- he can tap the next question icon (right) to accept this result and go to the next question (for our proto now, this will take him back to the default screen (01A_Play.png), where no answers have been selected yet)</span><br />\n<br />\n<span>CORRECT ANSWER will result in the popup seen on 01E_Play_Success.png (Success). Please note that the &ldquo;y&rdquo; in &ldquo;you will not receive a budget increase should be a capital &ldquo;Y&rdquo;. In this modal the user has two (2) options:</span><br />\n<span>&mdash; he can tap the home icon (left) to give up and go back to the home page</span><br />\n<span>&mdash; he can tap the next question icon (right) to accept this result and go to the next question (for our proto now, this will take him back to the default screen (01A_Play.png), where no answers have been selected yet)</span><br />\n<br />\n<span><strong>4) Leaderboard:</strong></span><br />\n<span><span style=\"color:#0000FF\"><em>Reference: 02A_leaderboard.png, 02B_leaderboard.png</em></span></span><br />\n<span>This is where the player sees the top ten (10) ranking players. &nbsp;</span><br />\n<br />\n<span>- Each player will show an abbreviated version of the player&rsquo;s own profile, as seen in the footer of all screens.</span><br />\n<span>- Optionally, the user can start typing to search for a specific player. for example, if he were to type &ldquo;t&rdquo; the green would immediately display the top ten players where the name starts in &ldquo;T&rdquo; (see example in 02B_leaderboard.png)</span><br />\n<span>- Note that NO single player result will be &ldquo;highlighted&rdquo; in search by default, but if he user hovers or clicks on a single player result, he will see the purple border appear around the result as shown in 02B_leaderboard.png</span><br />\n<span>- NOTE: if there are more than 10 players with a &ldquo;T&rdquo; at the start of their name, the user will have to type more of the first name to further narrow the results to 10 or less. If the user typed &ldquo;thomas&rdquo; he may see only 4 results. If the user an entire name (first and last), he will likely only see one result (unless there are more than one players with the same name!)</span><br />\n<br />\n<span><strong>5) Rules:</strong></span><br />\n<span><span style=\"color:#0000FF\"><em>Reference: 03_Rules.png</em></span></span><br />\n<span>This is where the player sees rules related &nbsp;to the game. We do not know how many rules will be listed, so :</span><br />\n<span>- it must be clear in the code where we add a new rule title and related details (comment out code to duplicate to add new)</span><br />\n<span>- the page must be able to expand / collapse to accommodate any amount of content (including background shape)</span><br />\n<span>- NOTE: Blue labels are just plain text and are not links!</span><br />\n<br />\n<span><span style=\"color:#0000FF\"><strong>Specific HTML/CSS/JavaScript Requirements:</strong></span></span><br />\n<span><span style=\"color:#FF0000\"><strong>HTML/CSS Requirements:</strong></span></span><br />\n<span>- Your HTML code must be valid HTML5 and follow best practices</span><br />\n<span>- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.</span><br />\n<span>- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.</span><br />\n<span>- No inline CSS styles - all styles must be placed in an external style-sheet.</span><br />\n<span>- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.</span><br />\n<span>- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)</span><br />\n<span>- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.</span><br />\n<span>- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.</span><br />\n<br />\n<span><span style=\"color:#FF0000\"><strong>JavaScript Requirements:</strong></span></span><br />\n<span>- All JavaScript used must not have any copyrights to any third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition<br />\nrequirements anywhere in the code.</span><br />\n<br />\n<span><span style=\"color:#0000FF\"><strong>Browsers Requirements:</strong></span></span><br />\n<span>- Latest Chrome, Firefox, Safari browsers</span><br />\n<span>- Internet Explorer 10+</span><br />\n<br />\n<span><span style=\"color:#0000FF\"><strong>Documentation Provided:</strong></span></span><br />\n<span>- Storyboard Screens and PSD files can be found in forums.</span><br />\n<span>- PDF document with the flow</span></p>\n",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30053172",
  "event": {
    "id": 3446,
    "description": "2016 TopCoder(R) Open",
    "shortDescription": "tco16"
  },
  "finalFixEndDate": "2016-03-15T05:34:00.000Z",
  "finalSubmissionGuidelines": "<p dir=\"ltr\"><span style=\"color:#FF0000\"><strong>Submission Deliverables:</strong></span><br />\n<span>- A complete list of deliverables can be viewed in the</span><a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\" style=\"line-height: 1.6;\"> UI Prototype Competitions Tutorial</a><span>.</span><br />\n<br />\n<span><span style=\"color:#FF0000\"><strong>Final Submission:</strong></span></span><br />\n<span>- For each member, the final submission should be uploaded to the</span><a href=\"http://software.topcoder.com/review\" style=\"line-height: 1.6;\"> Online Review Tool</a><span>.</span></p>\n",
  "forumId": 32160,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=32160",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 31,
  "numberOfSubmissions": 4,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-03-04T10:43:00.000Z",
      "actualStartTime": "2016-03-04T10:43:00.000Z",
      "scheduledEndTime": "2016-03-04T10:43:00.000Z",
      "actualendTime": "2016-03-04T10:43:00.000Z",
      "_id": "5813295f550dfb3b52b64914"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-03-04T10:43:00.000Z",
      "actualStartTime": "2016-03-04T10:43:00.000Z",
      "scheduledEndTime": "2016-03-04T14:10:00.000Z",
      "actualendTime": "2016-03-04T14:10:00.000Z",
      "_id": "5813295f550dfb3b52b64913"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-03-04T14:10:00.000Z",
      "actualStartTime": "2016-03-04T14:10:00.000Z",
      "scheduledEndTime": "2016-03-07T14:10:00.000Z",
      "actualendTime": "2016-03-07T14:10:00.000Z",
      "_id": "5813295f550dfb3b52b64912"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-03-04T14:15:00.000Z",
      "actualStartTime": "2016-03-04T14:15:00.000Z",
      "scheduledEndTime": "2016-03-10T14:14:00.000Z",
      "actualendTime": "2016-03-10T14:14:00.000Z",
      "_id": "5813295f550dfb3b52b64911"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2016-03-10T14:14:00.000Z",
      "actualStartTime": "2016-03-10T14:14:00.000Z",
      "scheduledEndTime": "2016-03-11T00:44:00.000Z",
      "actualendTime": "2016-03-11T00:44:00.000Z",
      "_id": "5813295f550dfb3b52b64910"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-03-11T00:44:00.000Z",
      "actualStartTime": "2016-03-11T00:44:00.000Z",
      "scheduledEndTime": "2016-03-12T21:12:00.000Z",
      "actualendTime": "2016-03-12T21:12:00.000Z",
      "_id": "5813295f550dfb3b52b6490f"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2016-03-12T21:12:00.000Z",
      "actualStartTime": "2016-03-12T21:12:00.000Z",
      "scheduledEndTime": "2016-03-13T21:12:00.000Z",
      "actualendTime": "2016-03-13T21:12:00.000Z",
      "_id": "5813295f550dfb3b52b6490e"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2016-03-13T21:12:00.000Z",
      "actualStartTime": "2016-03-13T21:12:00.000Z",
      "scheduledEndTime": "2016-03-14T11:48:00.000Z",
      "actualendTime": "2016-03-14T11:48:00.000Z",
      "_id": "5813295f550dfb3b52b6490d"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2016-03-14T11:48:00.000Z",
      "actualStartTime": "2016-03-14T11:48:00.000Z",
      "scheduledEndTime": "2016-03-14T12:18:00.000Z",
      "actualendTime": "2016-03-14T12:18:00.000Z",
      "_id": "5813295f550dfb3b52b6490c"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-03-14T12:18:00.000Z",
      "actualStartTime": "2016-03-14T12:18:00.000Z",
      "scheduledEndTime": "2016-03-15T05:34:00.000Z",
      "actualendTime": "2016-03-15T05:34:00.000Z",
      "_id": "5813295f550dfb3b52b6490b"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-03-15T05:34:00.000Z",
      "actualStartTime": "2016-03-15T05:34:00.000Z",
      "scheduledEndTime": "2016-03-15T10:36:00.000Z",
      "actualendTime": "2016-03-15T10:36:00.000Z",
      "_id": "5813295f550dfb3b52b6490a"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-03-15T10:36:00.000Z",
      "actualStartTime": "2016-03-15T10:36:00.000Z",
      "scheduledEndTime": "2016-03-20T10:36:00.000Z",
      "actualendTime": "2016-03-20T10:36:00.000Z",
      "_id": "5813295f550dfb3b52b64909"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-03-04T14:10:00.000Z",
  "prize": [
    1300,
    650
  ],
  "projectId": 9405,
  "registrants": [
    {
      "handle": "srcjz",
      "reliability": "6%",
      "registrationDate": "2016-03-04T14:12:00.000Z",
      "submissionDate": null,
      "rating": "941",
      "colorStyle": "color: #00A900",
      "_id": "5813295f550dfb3b52b64908"
    },
    {
      "handle": "srajas",
      "reliability": "0%",
      "registrationDate": "2016-03-05T04:12:00.000Z",
      "submissionDate": null,
      "rating": "1598",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295f550dfb3b52b64907"
    },
    {
      "handle": "arch_angel",
      "reliability": "13%",
      "registrationDate": "2016-03-05T10:02:00.000Z",
      "submissionDate": null,
      "rating": "1006",
      "colorStyle": "color: #00A900",
      "_id": "5813295f550dfb3b52b64906"
    },
    {
      "handle": "rrr_guru",
      "reliability": "0%",
      "registrationDate": "2016-03-04T14:31:00.000Z",
      "submissionDate": null,
      "rating": "780",
      "colorStyle": "color: #999999",
      "_id": "5813295f550dfb3b52b64905"
    },
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2016-03-04T14:35:00.000Z",
      "submissionDate": "2016-03-10T10:23:00.000Z",
      "rating": "2113",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295f550dfb3b52b64904"
    },
    {
      "handle": "besabestin",
      "reliability": "13%",
      "registrationDate": "2016-03-04T16:04:00.000Z",
      "submissionDate": "2016-03-10T13:42:00.000Z",
      "rating": "1114",
      "colorStyle": "color: #00A900",
      "_id": "5813295f550dfb3b52b64903"
    },
    {
      "handle": "lintc",
      "reliability": "0%",
      "registrationDate": "2016-03-04T16:05:00.000Z",
      "submissionDate": null,
      "rating": "1452",
      "colorStyle": "color: #6666FF",
      "_id": "5813295f550dfb3b52b64902"
    },
    {
      "handle": "Praver.Chawla",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T16:19:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b64901"
    },
    {
      "handle": "topcodder02",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T16:44:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b64900"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T17:53:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648ff"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T17:59:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648fe"
    },
    {
      "handle": "sachin91",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T18:15:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648fd"
    },
    {
      "handle": "math4tots",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T19:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648fc"
    },
    {
      "handle": "TopG",
      "reliability": "n/a",
      "registrationDate": "2016-03-04T22:18:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648fb"
    },
    {
      "handle": "chandima86",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T05:34:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648fa"
    },
    {
      "handle": "VivianV",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T02:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f9"
    },
    {
      "handle": "InteR1337",
      "reliability": "11%",
      "registrationDate": "2016-03-05T05:41:00.000Z",
      "submissionDate": "2016-03-10T09:12:00.000Z",
      "rating": "914",
      "colorStyle": "color: #00A900",
      "_id": "5813295f550dfb3b52b648f8"
    },
    {
      "handle": "dima_pp",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T12:00:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f7"
    },
    {
      "handle": "gottam.ui",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T12:03:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f6"
    },
    {
      "handle": "nomo_kazza",
      "reliability": "73%",
      "registrationDate": "2016-03-05T12:41:00.000Z",
      "submissionDate": "2016-03-10T12:48:00.000Z",
      "rating": "1277",
      "colorStyle": "color: #6666FF",
      "_id": "5813295f550dfb3b52b648f5"
    },
    {
      "handle": "ssp555",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T12:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f4"
    },
    {
      "handle": "tjross1234",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T20:15:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f3"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-03-05T21:13:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f2"
    },
    {
      "handle": "mctuftedpuffin",
      "reliability": "n/a",
      "registrationDate": "2016-03-06T22:08:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f1"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2016-03-06T03:02:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648f0"
    },
    {
      "handle": "Shizhouxing",
      "reliability": "n/a",
      "registrationDate": "2016-03-06T03:35:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648ef"
    },
    {
      "handle": "Rahul.A",
      "reliability": "n/a",
      "registrationDate": "2016-03-06T11:14:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648ee"
    },
    {
      "handle": "halceyon",
      "reliability": "n/a",
      "registrationDate": "2016-03-06T13:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648ed"
    },
    {
      "handle": "graphit",
      "reliability": "n/a",
      "registrationDate": "2016-03-06T16:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648ec"
    },
    {
      "handle": "Rakesh.Sa",
      "reliability": "n/a",
      "registrationDate": "2016-03-07T04:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648eb"
    },
    {
      "handle": "prasenjitroy",
      "reliability": "n/a",
      "registrationDate": "2016-03-07T06:45:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295f550dfb3b52b648ea"
    }
  ],
  "registrationEndDate": "2016-03-07T14:10:00.000Z",
  "reliabilityBonus": 260,
  "reviewScorecardId": 30001571,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2016-03-10T14:14:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 92.89,
      "finalScore": 94.67,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-03-10T10:23:00.000Z",
      "_id": "5813295f550dfb3b52b64918"
    },
    {
      "handle": "nomo_kazza",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 92.22,
      "finalScore": 94.11,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2016-03-10T12:48:00.000Z",
      "_id": "5813295f550dfb3b52b64917"
    },
    {
      "handle": "InteR1337",
      "placement": 3,
      "screeningScore": 100,
      "initialScore": 88.33,
      "finalScore": 91.44,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2016-03-10T09:12:00.000Z",
      "_id": "5813295f550dfb3b52b64916"
    },
    {
      "handle": "besabestin",
      "placement": 4,
      "screeningScore": 100,
      "initialScore": 83,
      "finalScore": 86.11,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2016-03-10T13:42:00.000Z",
      "_id": "5813295f550dfb3b52b64915"
    }
  ],
  "technology": [
    "CSS",
    "HTML5",
    "JavaScript"
  ]
}