{
  "_id": 30055304,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-27T17:51:15.457Z",
  "appealsEndDate": "2016-10-23T01:11:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Living Progress - Build - Mentor ME - Tablet to Mobile Responsive Conversion UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "Welcome to <strong>Living Progress - Build - Mentor ME - Tablet to Mobile Responsive Conversion UI Prototype Challenge</strong><br />\n<br />\nThe main task of this challenge is to convert completed Tablet UI Prototype of the Living Progress - Mentor ME into Responsive Mobile based on the provided Storyboard design and specification below<br />\n<br />\nAt the end of this challenge, we need a solid UI prototype using best coding practice/solutions. Good luck and we&rsquo;re looking forward to your submissions!",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30055304",
  "event": {
    "id": 3447,
    "description": "2017 TopCoder(R) Open",
    "shortDescription": "tco17"
  },
  "finalFixEndDate": "2016-10-26T06:33:00.000Z",
  "finalSubmissionGuidelines": "<strong>Downloadable Files:</strong><br />\n<a href=\"https://drive.google.com/drive/folders/0B31nrwic_6z0QlhOX1FzeWh6RWs?usp=sharing\">https://drive.google.com/drive/folders/0B31nrwic_6z0QlhOX1FzeWh6RWs?usp=sharing</a><br />\nStoryboard.zip - Mobile Storyboard Screen<br />\nIonic-proto.zip - Ionic Prototype as Base Updates<br />\n<br />\n<strong>Important!</strong><br />\n- Suggest best practice Responsive Web Design Breakpoints for Mobile layout<br />\n- Base of existing prototype created using <a href=\"http://ionicframework.com/\">Ionic framework</a>.<br />\n- Use existing SCSS for CSS Pre-Processor when you create new stylesheet<br />\n- You MUST make sure all graphic look sharp on Retina and Standard Size.<br />\n- DO NOT override existing libraries, If you want to create custom styling from existing library, create separate files<br />\n- DO NOT change indentation of current code structure, we need easily track your updated codes<br />\n- DO NOT break existing functions after your updates. Do multiple check your solution for every pages!<br />\n- DO NOT change existing images, you just need work on how fluid mobile layout should look<br />\n- FOLLOW existing HTML/JS/CSS code formatting.<br />\n- Create separated scss for mobile view media query<br />\n- Put clear documentation if you update existing HTML/JS/CSS codes and let us know the reasons.<br />\n- For this challenge, mostly you need make sure prototype display proper layout on Mobile screen only.<br />\n<br />\n<strong>Your prototype submission need support Mobile Size requirements:</strong><br />\n- Provided storyboard using iPhone Retina Portrait display (750px).<br />\n- Make sure your submission support Standard layout with 320px width &nbsp;<br />\n- Make user graphics look sharp on Retina and Standard version<br />\n- All pages need use fluid layout when transform into Landscape or Portrait view.<br />\n- You might need adjust some element placement in 320px width screen size. Let&rsquo;s discus any doubt about adjustments<br />\n- We only provided some screens for mobile, we need your help to build fluid solution for every mobile pages for this challenge.<br />\n- Please do your best adjust the layout for mobile, we&rsquo;ll ask more edits later on Final Fixes<br />\n<br />\n<strong>Login Credentials</strong><br />\n- There are 2 flow you can access for this prototype:<br />\n<strong>Mentor Flow:</strong><br />\nUsername: mentor<br />\nPassword: 123<br />\n<br />\n<strong>Mentee Flow:</strong><br />\nUsername: mentee<br />\nPassword: 123<br />\n<br />\n<strong>A). Existing UI Prototype Updates:</strong><br />\n<strong>1). Page and Functionality Removal</strong><br />\n- We need remove these elements from prototype:<br />\n- Meeting (Calendar)<br />\n- Messaging<br />\n- Forums<br />\n- Remove related Messaging button on top right across the pages<br />\n- on Dashboard page, remove meeting box. Need expand Tasks box to filled the content area<br />\n- on Sidebar menu, remove Meetings<br />\n- Also we need to make a note to remove all the meeting functionality from the application.&nbsp; &nbsp;<br />\n- Make sure Meeting not displayed on Mentee and Mentor flow<br />\n<br />\n<strong>2). Edit Profile</strong><br />\n- We can re-use existing Create Profile for Edit Profile layout<br />\n- On Profile page, add Edit button on the top right to let user navigate to Edit Profile<br />\n<br />\n<strong>3). Existing Prototype Issues</strong><br />\n- Mentor Match Checkboxes Styling missing on Firefox<br />\n- Meetings menu not set as active state on Meetings page<br />\n- Message icons need in correct placement, right now it look cut-off<br />\n- Looking forward your suggestion to fix some issues on prototype<br />\n<br />\n<strong>B). Responsive Mobile&nbsp; UI Prototype Page Requirements:</strong><br />\n<strong>1). Splash Screen</strong><br />\nScreenshot: X00-A-Mentee-Splash.png<br />\nPage url: index.html/#/splash<br />\n- Background image need covered whole screen. Re-use existing images.<br />\n- Mentor ME Logo placed on top and centered<br />\n- You might need adjust the logo size?<br />\n- Text need fits within the screen<br />\n- Loading progress placed below the text. Re-use existing progress. Ignore storyboard<br />\n<br />\n<strong>2). Landing Page</strong><br />\nScreenshot: X01-A-Mentee-login-B01-First-timer.png<br />\nScreenshot: X01-A-Mentee-login-B02-First-timer.png<br />\nPage url: index.html/#/login<br />\n- Mentor ME Logo placed on top and centered<br />\n- You might need adjust the logo size?<br />\n- Text slider need user proper padding and margin<br />\n- Login and Register button placed below the slider<br />\n- Terms and Conditions text placed below the buttons for the First Time user<br />\n- These are screens for existing user, button need wrapped correctly inside the mobile sccreens<br />\n(Screenshot: X01-A-Mentee-login-A01-Existing.png &amp; Screenshot: X01-A-Mentee-login-A02-Existing.png)<br />\n- Also, there&rsquo;s no Terms condition text for this screen<br />\n<br />\n<strong>3). Login</strong><br />\nScreenshot: X01-A-Mentee-login-C01-login-default.png<br />\nPage url: index.html/#/login<br />\n- Login form loaded after user click the Login button<br />\n- Logo need adjust the size and need centered<br />\n- Form need adjust the size and need centered<br />\n- x button to close modal need placed on top right<br />\n- Login form need adapting the browser screen size<br />\n- Type on Username and Password text field need works like existing (Screenshot: X01-A-Mentee-login-C02-login-typing.png, Screenshot: X01-A-Mentee-login-C03-login-typing.png)<br />\n- Screen after user filled the data (Screenshot: X01-A-Mentee-login-C04-login-done.png)<br />\n- Re-use existing error styling, make sure fits for mobile screen size (Screenshot: X01-A-Mentee-login-C05-login-error.png)<br />\n<br />\n<strong>4). Register</strong><br />\nScreenshot: X02-A-Mentee-Register-A01-Default.png<br />\nPage url: index.html/#/login<br />\n- Login form loaded after user click the Register button<br />\n- Logo need adjust the size and need centered<br />\n- Form need adjust the size and need centered<br />\n- x button to close modal need placed on top right<br />\n- For mobile screen you need make the role selection swipeable to let user select Mentor and Mentee (Screenshot: X02-A-Mentee-Register-A02-swipe.png)<br />\n- Re-use existing images for Mentor and Mentee<br />\n- Make sure selected function still works (Screenshot: X02-A-Mentee-Register-A03-selected-role.png)<br />\n<br />\n<strong>5). Terms &amp; Condition</strong><br />\nScreenshot: X03-A-Mentee-Register-01-Termscon.png<br />\nPage url: index.html/#/term<br />\n- User access this page from Terms &amp; Condition link below the Login and Register buttons<br />\n- Basically page need to be fluid for mobile screen<br />\n- Match padding/margin like existing storyboard<br />\n- Blue bar need remain sticked on the bottom of screen<br />\n- After user click Agree then another &ldquo;Parent/Guardian Consent &rdquo; form show up (Screenshot: X03-A-Mentee-Register-02-Termscon.png)<br />\n- For this form, background need covered whole browser screen<br />\n- x button placed on top right and use black color<br />\n- Label and input need displayed as separate lines<br />\n- Continue button need placed on the bottom and width covered browser<br />\n<br />\n<strong>6). Create Profile<br />\n<br />\nStep 1</strong><br />\nScreenshot: X04-A-Mentee-A01-Step01.png<br />\nPage url: index.html/#/register<br />\n- For this page, you need build the make sure fluid layout adapted for mobile&nbsp; screen<br />\n- Match padding/margin form like provide storyboard<br />\n- There&rsquo;s green line below the title, need consistent across all pages.<br />\n- Profile pictures and text need placed centered<br />\n- Label and text input need to be fluid<br />\n- Match padding/margin and font size for all buttons on header and bottom bar<br />\n- Match font size for label and any form element<br />\n<br />\n<strong>Step 2</strong><br />\nScreenshot: X04-A-Mentee-A01-Step02.png<br />\n- When landed on this screen, form need displayed from top<br />\n- For mobile screen you need displayed 2 circle per row<br />\n- Make sure they not overlapping<br />\n- Selected function need remain works<br />\n- Match padding/margin form like provide storyboard<br />\n- All circle options need wrapped inside the white background<br />\n<br />\n<strong>Step 3</strong><br />\nScreenshot: X04-A-Mentee-A01-Step03-1.png<br />\n- When landed on this screen, form need displayed from top<br />\n- Match padding/margin form like provide storyboard<br />\n- Make sure text wrapped inside the white background<br />\n- Graphic need placed centered of form<br />\n<br />\n<strong>Add Your Goals</strong><br />\nScreenshot: X04-A-Mentee-A01-Step03-2A.png<br />\n- Fix the header bar to follow storyboard<br />\n- 3 circles on top need placed correctly like storyboard look<br />\n- Number indicator placed on the left side of circle placeholder<br />\n- Match padding/margin form like provide storyboard<br />\n- Each row need displayed correctly for mobile<br />\n- Notice the icons become smaller on mobile<br />\n- Select circle need add to selection on top (Screenshot: X04-A-Mentee-A01-Step03-2B.png)<br />\n- Sample when select another row (Screenshot: X04-A-Mentee-A01-Step03-2C.png &amp; Screenshot: X04-A-Mentee-A01-Step03-2D.png)<br />\n- After click Done button user take back to Add Your Goal screen with selected Goals (Screenshot: X04-A-Mentee-A01-Step03-3.png)<br />\n- Number indicator placed on the left side, image on center and x button on the right side<br />\n- Click Done button take user to Dashboard<br />\n<br />\n<strong>6). Dashboard</strong><br />\nScreenshot: X05-A-Mentee-Dashboard.png<br />\nPage url: index.html/#/dashboard<br />\n- This is dashboard screen look for mobile screen<br />\n- On the user information area, Progress, Target Date and Time left need displayed correctly inside the purple background<br />\n- Purple background area should not in fixed placement for mobile, need scrolling with the page<br />\n- All boxes need use fluid width that covered mobile screen<br />\n- Mentorship Program area for mobile not display slideshow, but as separated lines<br />\n- Match each slide height and use fluid width<br />\n- Notice Mentorship Program have left and right margin<br />\n- Your task and Schedule Meeting boxes need displayed in separated lines<br />\n<br />\n<strong>7). Sidebar Menu</strong><br />\nScreenshot: X00-A-Mentee-Navigation.png<br />\n- User see this screen after click menu button on the top left side of header bar<br />\n- For mobile screen, you can re-use existing navigation function, ignore storyboard look<br />\n- But, you need make sure logo and another navigation menu fits inside the left sidebar without overlapping each other<br />\n- Settings and Logout remain placed on the bottom<br />\n<br />\n<strong>8). Activities</strong><br />\nScreenshot: X06-A-Mentee-Activities.png<br />\nPage url: index.html/#/activity<br />\n- User landed on this screen from Activity menu<br />\n- Match padding/margin like provided storyboard<br />\n- Image need use fluid width<br />\n- Text description placed below the image<br />\n<br />\n<strong>9). Goals</strong><br />\nScreenshot: X07-A-Mentee-Goals-01-Default.png<br />\nPage url: index.html/#/goal<br />\n- User landed on this screen from Activity menu<br />\n- Match padding/margin like provided storyboard<br />\n- On purple background area, you need covert current data into a slider for mobile view<br />\n- 1st slide: Displayed Current Goals and Overdue<br />\n- 2nd slide: There&rsquo;s this month completed area and progress bar (Screenshot: X07-A-Mentee-Goals-02-slide-01.png)<br />\n- 3rd slide: Upcoming Goals (Screenshot: X07-A-Mentee-Goals-02-slide-02.png)<br />\n- Re-use existing slide function<br />\n- Sort By need to be hidden for Goals<br />\n- Goal title need displayed in single line<br />\n- Progress Circle, Rate of Progress, Target Date and Time left displayed as separate rows<br />\n- Click each goals need load Goal Details (Screenshot: X07-A-Mentee-Goals-03-Details-mentor.png)<br />\n- This should not in separated page, display it as existing desktop function<br />\n- You need create tab layout for Related Mentor and Tasks<br />\n- Related Mentor will display all related information for Mentor<br />\n- Your tasks will be content for Your Tasks in fluid width (Screenshot: X07-A-Mentee-Goals-03-Details-Task.png)<br />\n- Click blue + button need display Add New Goal (Screenshot: X07-A-Mentee-Goals-04-New-goals.png)<br />\n- All rows need displayed in separate lines<br />\n- Add New Goal width need displayed as fluid width<br />\n<br />\n<strong>10). Tasks</strong><br />\nScreenshot: X08-A-Mentee-Tasks-01-Default.png<br />\nPage url: index.html/#/task<br />\n- On the purple background area, all content need wrapped correctly<br />\n- Match padding/margin like provided screenshot<br />\n- Add New tasks after user focus on Add New task input (Screenshot: X08-A-Mentee-Tasks-02-New-task.png)<br />\n- Notice normal text hidden on the right side of Task Priority<br />\n- Cancel and Add New Task button need placed on the left and right side<br />\n<br />\n<strong>11). Mentor Matches</strong><br />\nScreenshot: X10-A-Mentee-Mentor-matches-01-Criteria-selections.png<br />\nPage url: index.html/#/mentor-match<br />\n- This is Mentor Matches screen<br />\n- Find Match placed on the right side of dropdown<br />\n- Keep use existing checkboxes styling<br />\n- Each criterias need use fluid width<br />\n- &ldquo;If checked&rdquo; text need displayed full text like storyboard look<br />\n- Click Find Match button take user result screen (Screenshot: X10-A-Mentee-Mentor-matches-02-found-results.png)<br />\n- Purple background area need displayed as slide function<br />\n- 1st Slide: Suggested Mentors<br />\n- 2nd Slide: Categories and Main expertise (Screenshot: X10-A-Mentee-Mentor-matches-03-found-results.png)<br />\n- For this row, Mentor information placed on top<br />\n- Average Performance &amp; Match Expertise displayed on the bottom<br />\n- Click each row need take user to Mentor Profile<br />\n<br />\n<strong>12). Mentor Profile</strong><br />\nScreenshot: X11-A-Mentee-Mentor-profile.png<br />\nPage url: index.html/#/profile<br />\n- Background image need fits inside the browser width<br />\n- Each rows need displayed as separated lines<br />\n- Refer to storyboard for detail placement<br />\n<br />\n<strong>13). Mentorship Program</strong><br />\nScreenshot: X12-A-Mentee-Mentorship-program-A01-list.png<br />\nPage url: index.html/#/mentorship-pro<br />\n- User landed on this screen from sidebar menu then Click Programs<br />\n- Purple background area need displayed as slider function<br />\n- 1st Slide: Suggested Mentorship Program<br />\n- 2nd Slide: Ongoing and Match (Screenshot: X12-A-Mentee-Mentorship-program-A02-list.png)<br />\n- For each program, Rating and Invite Professional need displayed as separate rows<br />\n- User need able to swipe each slide<br />\n- Skye and Message icons missing on Mobile view<br />\n- Click Program title take user to Mentorship Detail page<br />\n<br />\n<strong>14). Mentorship Detail</strong><br />\nScreenshot: X12-A-Mentee-Mentorship-program-B01-Summary.png<br />\nPage url: index.html/#/mentorship<br />\n- This is Detail page look, Summary content displayed by default<br />\n- Background image need covered browser screen<br />\n- Title need wrapped inside mobile screen<br />\n- tabs need converted into dropdown for mobile<br />\n- Add goal button placed on the right side<br />\n- Timeline for mobile view need displayed as vertical mode<br />\n- Re-use existing content based on existing prototype<br />\n- Roles and Responsibility need follow storyboard look<br />\n- Change Dropdown to Document take user to Documents content (Screenshot: X12-A-Mentee-Mentorship-program-B02-Documents.png)<br />\n- All content need displayed as separate rows<br />\n- Change Dropdown to Questions take user to Questions content (Screenshot: X12-A-Mentee-Mentorship-program-B03-Questions.png)<br />\n- re-use existing dropdown function for View selection<br />\n- Ignore this storyboard look (Screenshot: X12-A-Mentee-Mentorship-program-C00-Tabs-selection.png)<br />\n<br />\n<strong>CODE REQUIREMENTS:<br />\nHTML/HTML5</strong><br />\n- Provide comments on the page elements to give clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts or errors.<br />\nElement and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Use semantically correct tags- use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- No inline CSS styles- all styles must be placed in an external stylesheet.<br />\n- Validate your code- reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n<br />\n<strong>CSS</strong><br />\n- Use SCSS as CSS Pre-Processor.<br />\n- Use Media Queries to load different styles for each page and don&#39;t build different page for different device/layout.<br />\n- Provide comments on the SASS code. We need SASS comments to give a clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- All SASS naming should not have any conflicts.<br />\n- As possible use SASS style when create all styling, avoid image usage.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to lay out your page. Only use table tags for tables of data/information and not for page layout.<br />\n<br />\n<strong>Javascript</strong><br />\n- All JavaScript must not have a copyright by a third party.<br />\n- You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- Use Bower for Library Package Manager<br />\n- Create separate files if you plan to create custom functions<br />\n<br />\n<strong>Images</strong><br />\n- Images should be properly compressed while still having good visual quality.<br />\n- Icons need created as SVG format<br />\n- Make sure your submission look sharp for Retina and Standard devices<br />\n<br />\n<strong>Browsers Requirements</strong><br />\n- Android Browser on Mobile<br />\n- Safari Browser on Mobile",
  "forumId": 34084,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=34084",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 32,
  "numberOfSubmissions": 2,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-10-13T06:31:00.000Z",
      "actualStartTime": "2016-10-13T06:31:00.000Z",
      "scheduledEndTime": "2016-10-13T06:33:00.000Z",
      "actualendTime": "2016-10-13T06:33:00.000Z",
      "_id": "58123e93e0be5f30ae56501d"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-10-13T06:33:00.000Z",
      "actualStartTime": "2016-10-13T06:33:00.000Z",
      "scheduledEndTime": "2016-10-13T09:35:00.000Z",
      "actualendTime": "2016-10-13T09:35:00.000Z",
      "_id": "58123e93e0be5f30ae56501c"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-10-13T09:35:00.000Z",
      "actualStartTime": "2016-10-13T09:35:00.000Z",
      "scheduledEndTime": "2016-10-15T09:36:00.000Z",
      "actualendTime": "2016-10-15T09:36:00.000Z",
      "_id": "58123e93e0be5f30ae56501b"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-10-13T09:40:00.000Z",
      "actualStartTime": "2016-10-13T09:40:00.000Z",
      "scheduledEndTime": "2016-10-19T09:35:00.000Z",
      "actualendTime": "2016-10-19T09:35:00.000Z",
      "_id": "58123e93e0be5f30ae56501a"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2016-10-19T09:35:00.000Z",
      "actualStartTime": "2016-10-19T09:35:00.000Z",
      "scheduledEndTime": "2016-10-19T19:06:00.000Z",
      "actualendTime": "2016-10-19T19:06:00.000Z",
      "_id": "58123e93e0be5f30ae565019"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-10-19T19:06:00.000Z",
      "actualStartTime": "2016-10-19T19:06:00.000Z",
      "scheduledEndTime": "2016-10-21T22:33:00.000Z",
      "actualendTime": "2016-10-21T22:33:00.000Z",
      "_id": "58123e93e0be5f30ae565018"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2016-10-21T22:33:00.000Z",
      "actualStartTime": "2016-10-21T22:33:00.000Z",
      "scheduledEndTime": "2016-10-22T22:33:00.000Z",
      "actualendTime": "2016-10-22T22:33:00.000Z",
      "_id": "58123e93e0be5f30ae565017"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2016-10-22T22:33:00.000Z",
      "actualStartTime": "2016-10-22T22:33:00.000Z",
      "scheduledEndTime": "2016-10-23T01:11:00.000Z",
      "actualendTime": "2016-10-23T01:11:00.000Z",
      "_id": "58123e93e0be5f30ae565016"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2016-10-23T01:11:00.000Z",
      "actualStartTime": "2016-10-23T01:11:00.000Z",
      "scheduledEndTime": "2016-10-23T07:24:00.000Z",
      "actualendTime": "2016-10-23T07:24:00.000Z",
      "_id": "58123e93e0be5f30ae565015"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-10-23T07:24:00.000Z",
      "actualStartTime": "2016-10-23T07:24:00.000Z",
      "scheduledEndTime": "2016-10-24T07:28:00.000Z",
      "actualendTime": "2016-10-24T07:28:00.000Z",
      "_id": "58123e93e0be5f30ae565014"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-10-24T07:28:00.000Z",
      "actualStartTime": "2016-10-24T07:28:00.000Z",
      "scheduledEndTime": "2016-10-24T13:14:00.000Z",
      "actualendTime": "2016-10-24T13:14:00.000Z",
      "_id": "58123e93e0be5f30ae565013"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-10-26T10:54:00.000Z",
      "actualStartTime": "2016-10-26T10:54:00.000Z",
      "scheduledEndTime": "2016-10-27T10:54:00.000Z",
      "actualendTime": "2016-10-27T10:54:00.000Z",
      "_id": "58123e93e0be5f30ae565012"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-10-24T13:14:00.000Z",
      "actualStartTime": "2016-10-24T13:14:00.000Z",
      "scheduledEndTime": "2016-10-25T13:04:00.000Z",
      "actualendTime": "2016-10-25T13:04:00.000Z",
      "_id": "58123e93e0be5f30ae565011"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-10-25T13:04:00.000Z",
      "actualStartTime": "2016-10-25T13:04:00.000Z",
      "scheduledEndTime": "2016-10-25T19:12:00.000Z",
      "actualendTime": "2016-10-25T19:12:00.000Z",
      "_id": "58123e93e0be5f30ae565010"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-10-25T19:12:00.000Z",
      "actualStartTime": "2016-10-25T19:12:00.000Z",
      "scheduledEndTime": "2016-10-26T06:33:00.000Z",
      "actualendTime": "2016-10-26T06:33:00.000Z",
      "_id": "58123e93e0be5f30ae56500f"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-10-26T06:33:00.000Z",
      "actualStartTime": "2016-10-26T06:33:00.000Z",
      "scheduledEndTime": "2016-10-26T10:54:00.000Z",
      "actualendTime": "2016-10-26T10:54:00.000Z",
      "_id": "58123e93e0be5f30ae56500e"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-10-13T09:35:00.000Z",
  "prize": [
    1500,
    750
  ],
  "projectId": 9615,
  "registrants": [
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2016-10-13T09:46:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "58123e93e0be5f30ae56500d"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T09:55:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae56500c"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T09:55:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae56500b"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T10:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae56500a"
    },
    {
      "handle": "penpo",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T10:21:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae565009"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T10:25:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae565008"
    },
    {
      "handle": "Sky_",
      "reliability": "13%",
      "registrationDate": "2016-10-13T10:37:00.000Z",
      "submissionDate": null,
      "rating": "1735",
      "colorStyle": "color: #DDCC00",
      "_id": "58123e93e0be5f30ae565007"
    },
    {
      "handle": "g.prog",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T10:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae565006"
    },
    {
      "handle": "candy_nsd",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T10:53:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae565005"
    },
    {
      "handle": "daga_sumit",
      "reliability": "66%",
      "registrationDate": "2016-10-13T10:55:00.000Z",
      "submissionDate": "2016-10-19T08:59:00.000Z",
      "rating": "1497",
      "colorStyle": "color: #6666FF",
      "_id": "58123e93e0be5f30ae565004"
    },
    {
      "handle": "virose",
      "reliability": "0%",
      "registrationDate": "2016-10-13T11:08:00.000Z",
      "submissionDate": null,
      "rating": "976",
      "colorStyle": "color: #00A900",
      "_id": "58123e93e0be5f30ae565003"
    },
    {
      "handle": "reynard2007",
      "reliability": "33%",
      "registrationDate": "2016-10-13T11:27:00.000Z",
      "submissionDate": null,
      "rating": "931",
      "colorStyle": "color: #00A900",
      "_id": "58123e93e0be5f30ae565002"
    },
    {
      "handle": "poundinc_tc",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T12:17:00.000Z",
      "submissionDate": null,
      "rating": "154",
      "colorStyle": "color: #999999",
      "_id": "58123e93e0be5f30ae565001"
    },
    {
      "handle": "jorje.b",
      "reliability": "14%",
      "registrationDate": "2016-10-13T12:39:00.000Z",
      "submissionDate": null,
      "rating": "1046",
      "colorStyle": "color: #00A900",
      "_id": "58123e93e0be5f30ae565000"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T14:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564fff"
    },
    {
      "handle": "glint",
      "reliability": "26%",
      "registrationDate": "2016-10-13T15:01:00.000Z",
      "submissionDate": null,
      "rating": "1390",
      "colorStyle": "color: #6666FF",
      "_id": "58123e93e0be5f30ae564ffe"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T15:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ffd"
    },
    {
      "handle": "KrisD",
      "reliability": "10%",
      "registrationDate": "2016-10-13T17:10:00.000Z",
      "submissionDate": null,
      "rating": "1420",
      "colorStyle": "color: #6666FF",
      "_id": "58123e93e0be5f30ae564ffc"
    },
    {
      "handle": "macs054",
      "reliability": "50%",
      "registrationDate": "2016-10-13T18:25:00.000Z",
      "submissionDate": null,
      "rating": "1132",
      "colorStyle": "color: #00A900",
      "_id": "58123e93e0be5f30ae564ffb"
    },
    {
      "handle": "TopG",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T20:12:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ffa"
    },
    {
      "handle": "Rakesh.Sa",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T22:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff9"
    },
    {
      "handle": "anosama",
      "reliability": "n/a",
      "registrationDate": "2016-10-13T23:23:00.000Z",
      "submissionDate": "2016-10-19T09:26:00.000Z",
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff8"
    },
    {
      "handle": "testXuSanping",
      "reliability": "n/a",
      "registrationDate": "2016-10-14T00:40:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff7"
    },
    {
      "handle": "FArIZzX77",
      "reliability": "n/a",
      "registrationDate": "2016-10-14T03:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff6"
    },
    {
      "handle": "vikasverma",
      "reliability": "0%",
      "registrationDate": "2016-10-14T05:13:00.000Z",
      "submissionDate": null,
      "rating": "681",
      "colorStyle": "color: #999999",
      "_id": "58123e93e0be5f30ae564ff5"
    },
    {
      "handle": "samsara0614",
      "reliability": "n/a",
      "registrationDate": "2016-10-14T10:22:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff4"
    },
    {
      "handle": "moagi.anela",
      "reliability": "n/a",
      "registrationDate": "2016-10-14T11:59:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff3"
    },
    {
      "handle": "michael_tang",
      "reliability": "0%",
      "registrationDate": "2016-10-14T16:09:00.000Z",
      "submissionDate": null,
      "rating": "823",
      "colorStyle": "color: #999999",
      "_id": "58123e93e0be5f30ae564ff2"
    },
    {
      "handle": "linuxgeek",
      "reliability": "n/a",
      "registrationDate": "2016-10-14T16:20:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564ff1"
    },
    {
      "handle": "hi4sandy",
      "reliability": "46%",
      "registrationDate": "2016-10-14T17:23:00.000Z",
      "submissionDate": null,
      "rating": "1865",
      "colorStyle": "color: #DDCC00",
      "_id": "58123e93e0be5f30ae564ff0"
    },
    {
      "handle": "johnhawnk",
      "reliability": "n/a",
      "registrationDate": "2016-10-14T23:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564fef"
    },
    {
      "handle": "negtitep",
      "reliability": "n/a",
      "registrationDate": "2016-10-15T01:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58123e93e0be5f30ae564fee"
    }
  ],
  "registrationEndDate": "2016-10-15T09:36:00.000Z",
  "reliabilityBonus": 300,
  "reviewScorecardId": 30001571,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2016-10-19T09:35:00.000Z",
  "submissions": [
    {
      "handle": "daga_sumit",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 79.67,
      "finalScore": 79.67,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-10-19T08:59:00.000Z",
      "_id": "58123e93e0be5f30ae56501f"
    },
    {
      "handle": "anosama",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 78.33,
      "finalScore": 78.33,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2016-10-19T09:26:00.000Z",
      "_id": "58123e93e0be5f30ae56501e"
    }
  ],
  "technology": [
    "CSS",
    "HTML",
    "JSON",
    "JavaScript"
  ]
}