{
  "_id": 30051602,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:32:19.691Z",
  "appealsEndDate": "2015-11-09T10:57:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "SunShot - OneOakSystems - Responsive UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p>Welcome to<strong> Sunshot - OneOakSystem UI Prototype Challenge.</strong></p>\n\n<p>The main task of this project is to create the Sunshot - OneOakSystem UI Prototype based on the provided PSD Storyboard design.</p>\n\n<p>For this challenge you just need create prototype submission to support responsive on Desktop, Tablet and Mobile layout. In the end of this challenge we need solid UI prototype result with best practice solutions</p>\n\n<p>Good luck and we&rsquo;re looking forward to your submissions!</p>\n",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30051602",
  "event": {
    "id": 3446,
    "description": "2016 TopCoder(R) Open",
    "shortDescription": "tco16"
  },
  "finalFixEndDate": "2015-11-12T19:57:00.000Z",
  "finalSubmissionGuidelines": "<p><strong>Project Details:</strong><br />\nOne Oak Systems Mobile application works as Smart HVAC (Heating, Ventilation, and Air Conditioning) system that determines what rooms should be heated or cooled.</p>\n\n<p>Application purpose is need to solve problem of wasted energy in HVAC - size of households shrinking. The goal is to save energy not only for the energy customer, but also the industry at large. For example, landlords who have lots of small units such as nursing homes, dorms, etc. and want to&nbsp; have individual heating/cooling. Place sensors in each room and collect data to track patterns of movement, etc. (machine learning) on room usage (zones). Heat/Cool room based on behavior/learned patterns (i.e. TV is watched from 7pm -9pm, so don&rsquo;t cool the office during that time).</p>\n\n<p><strong>Downloadable Files:</strong><br />\nStoryboard.zip - Storyboard Design</p>\n\n<p><strong>Important!</strong><br />\n- For this UI Prototype submission we need your submission support responsive solution from Desktop, Tablet and Mobile screen<br />\n- Suggest best practice Responsive Web Design Breakpoints Sizes<br />\n- Provided storyboard for Desktop version using widescreen display (1280px width). &nbsp;<br />\n- Provided storyboard for Mobile version using iPhone 6 Retina Portrait display (750px x 1334px).<br />\n- Make sure your submission support Standard layout with 320px width screen size using best practices of Responsive Web solution.<br />\n- You might need adjust some element placement in 320px width screen size, if not possible within current timeline, we&rsquo;ll fix at final fixes phase<br />\n- All pages need use fluid layout when transform into Landscape or Portrait view.<br />\n- For Tablet version, you can use Mobile layout with fluid width<br />\n- As possible we need all pages on this prototype linked each other. Let us know if you need clarification about the flow.<br />\n- Application will be developed with PhoneGap framework. &nbsp;<br />\n- Make sure your UI Prototype submissions not bring conflicts when moving to PhoneGap framework<br />\n- Also you can use open source library like jQuery.</p>\n\n<p><strong>UI Prototype Page Requirements<br />\n1. Splash Screen<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/00 ~ Splash.jpg<br />\n- User landed to this screen on page load<br />\n- Show application logo and title centered of browser screen<br />\n- After some seconds, need show up the login page</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/00 ~ Splash.jpg<br />\n- For mobile version, you need show application logo and title close like desktop version.<br />\n<br />\n<strong>2. Login</strong><br />\nDesktop Version<br />\nscreenshot: Desktop/01 ~ Login.jpg<br />\n- User landed to this screen on page load<br />\n- Use 2 column layout format<br />\n- Application logo placed&nbsp; in the left side of page<br />\n- Form placed in the right side<br />\n- Match Username and password field styling<br />\n- Login button take user to &ldquo;2. Initial Screen&rdquo;<br />\n- &ldquo;Forgot Password&rdquo; and &ldquo;Sign Up&rdquo; can be dead links<br />\n- &ldquo;Try Our Savings Calculator for Free!&rdquo; button take user to &ldquo;8. Savings Setup&rdquo;</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/01 ~ Login.jpg<br />\n- On Mobile version, Logo and form need display as stacked layout<br />\n- Display application logo and title like desktop version.<br />\n- Login page need use fluid width on Mobile screen<br />\n<br />\n<strong>3. Initial Screen<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/02A ~ Initial Screen.jpg<br />\n- Application logo placed in the top left of screen<br />\n- In the right side, there&rsquo;s menu for &ldquo;Home&rdquo;, &ldquo;About Us&rdquo;, &ldquo;How it Works&rdquo; and &ldquo;Contact Us&rdquo;. Put dead links for now<br />\n- There&rsquo;s Welcome message placed in the right side of header bar<br />\n- Logout button take user to Login page<br />\n- Main menu navigation placed on left side of screen<br />\n- Left side menu placed in the left side and always show up<br />\n- Show arrow marker and different background for current active menu navigation<br />\n- User can toggle temperature by click &ldquo;Celsius&rdquo; or &ldquo;Fahrenheit&rdquo; initial character<br />\n- Active temperature indicated by white colored background style<br />\n- In the right side there&rsquo;s current Houses information<br />\n- This area divided by All House Selection and Room Selection<br />\n- Selected house marked with checkmark icon<br />\n- Select other house need change the selected hous<br />\n- User can scrolling the house selection<br />\n- There&rsquo;s dot pagination placed in the bottom of scrolling area<br />\n- After selecting a home, User can also select which room they want to monitor<br />\n- Show checkmark for selected room<br />\n- Add a Room button that will take user to create New Room<br />\n- Main graphic text information will updated automatically in the future. Make sure text not break outside the graphic<br />\n- Show us easy way to update the numbers without breaking the graphic<br />\n- Make sure typography match with graphic<br />\n- Show current status message in the right side<br />\n- Savings Setup button take user to &ldquo;8. Savings Setup&rdquo;<br />\n- There&rsquo;s alert and warning button next Savings Setup button<br />\n- Click the alert and warning button take user to &ldquo;4. Alert Screen&rdquo;<br />\n- Simulate after some seconds for this screen, show up the floating alert (screenshot: 02B ~ Master Alert.jpg)<br />\n- Click the alert and warning flyout take user to &ldquo;4. Alert Screen&rdquo;</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/02A ~ Initial Screen.jpg<br />\n- This mobile screen layout for Initial Screen<br />\n- Left and right menu need accessed via left and sidebar menu in mobile version<br />\n- On top of application there&rsquo;s button for menu in the left side, title on center of screen and House menu in the right side<br />\n- Only need display the graphic for mobile version that placed centered of screen<br />\n- Saving Setup, Alert and &ldquo;?&rdquo; button need placed below the graphic<br />\n- When user click the &ldquo;?&rdquo; button need show up the &ldquo;Current Status&rdquo; information (screenshot: 02B ~ Help.jpg)<br />\n- Close button need hide the modal window<br />\n- Simulate after some seconds for this screen, show up the floating alert (screenshot: 02C ~ Master Alert.jpg)<br />\n- Flyout alert need covered whole screen<br />\n- Click left menu button need show up left side menu&nbsp; (screenshot: Mobile/03 ~ Side Menu Left.jpg)<br />\n- Application logo placed on top of left menu<br />\n- Match menu navigation order like desktop version<br />\n- For Set Temperature, please show temperature toggle buttons<br />\n- Click home icon in the right side of header bar need show up the house and room selection (screenshot: Mobile/04 ~ Side Menu Right.jpg)<br />\n- Show same function for house selection like desktop version</p>\n\n<p><strong>4. Alert Screen<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/02C ~ Alerts.jpg<br />\n- This is Alert Screen<br />\n- No active state for main menu navigation<br />\n- Show &ldquo;Current&rdquo; and &ldquo;Resolved&rdquo; tab<br />\n- List Alert and Warning in table format<br />\n- You can re-use same data for Resolved tab<br />\n- In the right side there&rsquo;s information of Alert screen</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/02D ~ Alerts.jpg<br />\n- On Mobile version, there&rsquo;s Back button instead of menu in the header bar<br />\n- Tab layout need covered whole screen<br />\n- Show table list of Alert and Warning<br />\n- No need display main navigation in the bottom of this screen<br />\n<br />\n<strong>5. Set Temperature<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/04 ~ Set Temperature.jpg<br />\n- This is Set Temperature screen<br />\n- There&rsquo;s breadcrumb below the logo<br />\n- User can select&nbsp; &ldquo;Hot&rdquo;, &ldquo;Warm&rdquo;, &ldquo;Perfect&rdquo;, &ldquo;Cold&rdquo; and &ldquo;Cool&rdquo;<br />\n- Match different color for selection<br />\n- Selected value indicated by the white arrow shape<br />\n- User can tap on each selection, also drag the white arrow shape<br />\n- User can also click the &ldquo;-&rdquo; and &ldquo;+&rdquo; button that will increase the progress bar and change the temperature number<br />\n- Use 1 point increment for the target temperature</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/05 ~ Set Temperature.jpg<br />\n- Circle slider placed on top and target temperature in the bottom<br />\n- &ldquo;?&rdquo; button need show the Help modal window<br />\n<br />\n<strong>6. View Data<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/05A ~ View Data.jpg<br />\n- User landed on this screen after click the &ldquo;View&rdquo; menu<br />\n- Page screen shows&nbsp; &quot;Temperature&quot; and &quot;Savings&quot; tabs<br />\n- By default user see &ldquo;Temperature&rdquo; tab<br />\n- &quot;Savings&quot; tab can use same data<br />\n- Change tab also affect different circle in the right side<br />\n- Match chart styling from label, legend and background<br />\n- In the right side there&rsquo;s circle information for each line<br />\n- In this screen user can see comparison of Temperature vs time and how much they&rsquo;re saving energy vs time<br />\n- The user needs to be able to set date range for comparison<br />\n- Click the date range need load date selection modal window (screenshot: 05B ~ Calendar.jpg)<br />\n- Inside the modal window, user can navigate the months<br />\n- Need able to set the range<br />\n- Set button capture selected range into datepicker input</p>\n\n<p>screenshot: Mobile/06A ~ View Data.jpg<br />\n- Page showing tabs on top of screen<br />\n- Circle background placed below the tabs<br />\n- Saving Result information need show up when click the &ldquo;?&rdquo; button<br />\n- Click Date range need show up the calendar modal window (screenshot: 06B ~ Calendar.jpg)</p>\n\n<p><strong>7. Edit Permissions<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/06 ~ Edit Permission.jpg<br />\n- For this Edit Permissions user can view, add, edit and remove user permissions<br />\n- In the left side, there&rsquo;s form for input fields for Name and Email also dropdown for change the Administrator<br />\n- Add button placed below the Add User table, and can be dead link<br />\n- In the right side, there&rsquo;s current user information<br />\n- Edit and Delete button placed in the right side<br />\n- Edit button can be dead link<br />\n- Click the &ldquo;X&rdquo; button need remove the related user<br />\n- Match table informations for different roles</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/07 ~ Edit Permission.jpg<br />\n- Add user placed on top of screen<br />\n- Then, Current User list placed below<br />\n- User need able scrolling the Current Users content<br />\n- User information need show up when click the &ldquo;?&rdquo; button</p>\n\n<p><strong>8. Savings Setup<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/07A ~ Savings Setup.jpg<br />\n- User can change House information via dropdown menu<br />\n- There are 3 dropdowns choices for &ldquo;Home Owner&rdquo;, &ldquo;Number of Resident&rdquo; and &ldquo;Type Resident&rdquo;<br />\n- &ldquo;Home Owner&rdquo; dropdown is to choose between Homeowner, Landlord and Resident.<br />\n- &ldquo;Number of Resident&rdquo; dropdown is for number of residents and can be a number picker.<br />\n- &ldquo;Type Resident&rdquo; dropdown is option to pick from a list of profiles for residents: Student, Family, Senior and Shared House<br />\n- Room Type information displayed using tree layout<br />\n- User needs to able to select options for Room Type and Quantity<br />\n- &ldquo;Calculate&rdquo; button that placed in the bottom of screen. Click this button need shows a popup/overlay will appear with a % or even eventually $ we estimate the user can save, for now it suffices to have generic text (screenshot: Desktop/07B ~ Savings CTA.jpg)<br />\n- Sign Up Now button can be dead link<br />\n- Click &ldquo;Advance&rdquo; button will take user to Advance option explained below (&ldquo;10. Savings Setup Advance&rdquo;)</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/08A ~ Savings Setup.jpg<br />\n- Menu shows a back button<br />\n- Main navigation button hidden on this screen<br />\n- Page stacked House Information and Room type<br />\n- Root menu need displayed in single column<br />\n- Calculate and Advance button display as single line<br />\n- Match overlay content placement that show center alignment (screenshot: Mobile/08B ~ Savings CTA.jpg)</p>\n\n<p><strong>9. Savings Setup LandLord<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/08 ~ Landlord.jpg<br />\n- This screen show up after user change HomeOwner dropdown to Landlord<br />\n- In the right side of screen, form type changed.<br />\n- User can change building type<br />\n- Screen need shows 2 dropdowns for this Units and People.<br />\n- Calculate and Advance button placed in the bottom of screen</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/09 ~ Landlord.jpg<br />\n- Menu shows a back button<br />\n- Main navigation button hidden on this screen<br />\n- House information placed on top of screen<br />\n- Room type placed in the bottom</p>\n\n<p><strong>10. Savings Setup Advance<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/09A ~ Advanced Setup.jpg<br />\n- This is Advanced screen look<br />\n- User can edit/change the room size by select available options in the graphic<br />\n- Show different graphic for each different room size: (09A ~ Advanced Setup.jpg, 09B ~ Advanced Setup.jpg<br />\n09C ~ Advanced Setup.jpg, 09D ~ Advanced Setup.jpg, 09E ~ Advanced Setup.jpg)<br />\n- User can navigate to other rooms by click Next and Prev buttons<br />\n- Also user can change number of Vents and Windows<br />\n- User can add another new room. Put dead link for now<br />\n- Schedule button take user to next &ldquo;11. Savings Setup Schedule&rdquo; explained below<br />\n- Finish button take user to &ldquo;8. Savings Setup&rdquo;</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/10A ~ Advanced Setup.jpg<br />\n- Menu shows a back button<br />\n- Main navigation button hidden on this screen<br />\n- User can slide each room by click Next and Prev button<br />\n- Show different graphic for each different room size: (10A ~ Advanced Setup.jpg, 10B ~ Advanced Setup.jpg, 10C ~ Advanced Setup.jpg, 10D ~ Advanced Setup.jpg, 10E ~ Advanced Setup.jpg)<br />\n- Also need support swipe to navigate to Next and Prev room<br />\n- Vents and Windows dropdown placed below the graphic</p>\n\n<p><strong>11. Savings Setup Schedule<br />\nDesktop Version</strong><br />\nscreenshot: Desktop/10A ~ Shedule.jpg<br />\n- User landed to this screen after click the &ldquo;Schedule&rdquo; button<br />\n- In the first column, the different room name show up.<br />\n- In the right side of room name, there will be a place for 24hr timeline<br />\n- Match label for each cells<br />\n- Show different color based on color map on Set Temperature page<br />\n- There&rsquo;s temperature for each range, and always placed centered<br />\n- User can remove each room click the &ldquo;x&rdquo; button<br />\n- User can edit&nbsp; each room click the &ldquo;x&rdquo; button (screenshot: Desktop/10B ~ Shedule Edit.jpg)<br />\n- User can add new time range from &ldquo;+ Time&rdquo; button<br />\n- Done button need hide the modal<br />\n- Finish User and add a new room button, and take user to &ldquo;8. Savings Setup&rdquo;</p>\n\n<p><strong>Mobile Version</strong><br />\nscreenshot: Mobile/11A ~ Shedule Portrait.jpg<br />\n- Menu shows a back button<br />\n- Main navigation button hidden on this screen<br />\n- Add Room button placed in the top of screen<br />\n- Schedule displayed as fluid width<br />\n- User can edit&nbsp; each room click the &ldquo;x&rdquo; button (screenshot: Mobile/111B ~ Schedule-Edit.jpg)<br />\n- When user change orientation to landscape, schedule should expand to browser width (screenshot: Mobile/11C ~ Shedule Landscape.jpg)</p>\n\n<p><br />\n<strong>Client Priorities (The items that are considered highest prototype priorities)</strong><br />\n- Creating quality and efficient HTML/CSS3 code that works in all the requested browsers.<br />\n- All elements should be Pixel Precisions, pay attention to padding, margin, line-height, etc.<br />\n- Matching the storyboards (as close as possible) across the required browsers.<br />\n- Responsive Web Design solution!<br />\n<br />\n<strong>CODE REQUIREMENTS:<br />\nHTML/HTML5</strong><br />\n- Provide comments on the page elements to give clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts or errors.<br />\nElement and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Use semantically correct tags- use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- No inline CSS styles- all styles must be placed in an external stylesheet.<br />\n- Validate your code- reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.</p>\n\n<p><br />\n<strong>CSS3</strong><br />\n- Use CSS3 Media Queries to load different styles for each page and don&#39;t build different page for different device/layout.<br />\n- Provide comments on the CSS code. We need CSS comments to give a clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all CSS so developers can follow the code.<br />\n- All CSS naming should not have any conflicts.<br />\n- As possible use CSS3 style when create all styling.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to lay out your page. Only use table tags for tables of data/information and not for page layout.</p>\n\n<p><strong>Javascript</strong><br />\n- All JavaScript must not have a copyright by a third party.<br />\n- You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.</p>\n\n<p><strong>Images</strong><br />\n- Images should be properly compressed while still having good visual quality.<br />\n- Please use best practice repetition usage of background based image.<br />\n- Please use sprites when using icons for your submission.<br />\n- Make sure your submission look sharp for Retina and Standard devices</p>\n\n<p><strong>Browsers Requirements</strong><br />\n- Firefox Latest Version<br />\n- Safari Latest Version<br />\n- Chrome Latest Version<br />\n- Chrome, Firefox and Safari&nbsp; on iPhone 4, 4s, 5, 5s, 6 and 6+ (Landscape &amp; Portrait View)<br />\n- Android Browser</p>\n\n<p>&nbsp;</p>\n",
  "forumId": 30718,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=30718",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 19,
  "numberOfSubmissions": 1,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-10-30T02:03:00.000Z",
      "actualStartTime": "2015-10-30T02:03:00.000Z",
      "scheduledEndTime": "2015-10-30T02:05:00.000Z",
      "actualendTime": "2015-10-30T02:05:00.000Z",
      "_id": "58132933550dfb3b52b5fccd"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2015-10-30T02:05:00.000Z",
      "actualStartTime": "2015-10-30T02:05:00.000Z",
      "scheduledEndTime": "2015-10-30T04:19:00.000Z",
      "actualendTime": "2015-10-30T04:19:00.000Z",
      "_id": "58132933550dfb3b52b5fccc"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2015-10-30T04:19:00.000Z",
      "actualStartTime": "2015-10-30T04:19:00.000Z",
      "scheduledEndTime": "2015-11-01T04:20:00.000Z",
      "actualendTime": "2015-11-01T04:20:00.000Z",
      "_id": "58132933550dfb3b52b5fccb"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-10-30T04:24:00.000Z",
      "actualStartTime": "2015-10-30T04:24:00.000Z",
      "scheduledEndTime": "2015-11-06T04:19:00.000Z",
      "actualendTime": "2015-11-06T04:19:00.000Z",
      "_id": "58132933550dfb3b52b5fcca"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2015-11-06T04:19:00.000Z",
      "actualStartTime": "2015-11-06T04:19:00.000Z",
      "scheduledEndTime": "2015-11-06T15:01:00.000Z",
      "actualendTime": "2015-11-06T15:01:00.000Z",
      "_id": "58132933550dfb3b52b5fcc9"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2015-11-06T15:01:00.000Z",
      "actualStartTime": "2015-11-06T15:01:00.000Z",
      "scheduledEndTime": "2015-11-08T10:55:00.000Z",
      "actualendTime": "2015-11-08T10:55:00.000Z",
      "_id": "58132933550dfb3b52b5fcc8"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2015-11-08T10:55:00.000Z",
      "actualStartTime": "2015-11-08T10:55:00.000Z",
      "scheduledEndTime": "2015-11-09T10:55:00.000Z",
      "actualendTime": "2015-11-09T10:55:00.000Z",
      "_id": "58132933550dfb3b52b5fcc7"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2015-11-09T10:55:00.000Z",
      "actualStartTime": "2015-11-09T10:55:00.000Z",
      "scheduledEndTime": "2015-11-09T10:57:00.000Z",
      "actualendTime": "2015-11-09T10:57:00.000Z",
      "_id": "58132933550dfb3b52b5fcc6"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2015-11-09T10:57:00.000Z",
      "actualStartTime": "2015-11-09T10:57:00.000Z",
      "scheduledEndTime": "2015-11-09T14:48:00.000Z",
      "actualendTime": "2015-11-09T14:48:00.000Z",
      "_id": "58132933550dfb3b52b5fcc5"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-11-09T14:48:00.000Z",
      "actualStartTime": "2015-11-09T14:48:00.000Z",
      "scheduledEndTime": "2015-11-11T22:04:00.000Z",
      "actualendTime": "2015-11-11T22:04:00.000Z",
      "_id": "58132933550dfb3b52b5fcc4"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-11-11T22:04:00.000Z",
      "actualStartTime": "2015-11-11T22:04:00.000Z",
      "scheduledEndTime": "2015-11-12T02:11:00.000Z",
      "actualendTime": "2015-11-12T02:11:00.000Z",
      "_id": "58132933550dfb3b52b5fcc3"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-11-13T06:39:00.000Z",
      "actualStartTime": "2015-11-13T06:39:00.000Z",
      "scheduledEndTime": "2015-11-17T04:56:00.000Z",
      "actualendTime": "2015-11-17T04:56:00.000Z",
      "_id": "58132933550dfb3b52b5fcc2"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-11-12T02:11:00.000Z",
      "actualStartTime": "2015-11-12T02:11:00.000Z",
      "scheduledEndTime": "2015-11-12T19:57:00.000Z",
      "actualendTime": "2015-11-12T19:57:00.000Z",
      "_id": "58132933550dfb3b52b5fcc1"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-11-12T19:57:00.000Z",
      "actualStartTime": "2015-11-12T19:57:00.000Z",
      "scheduledEndTime": "2015-11-13T06:39:00.000Z",
      "actualendTime": "2015-11-13T06:39:00.000Z",
      "_id": "58132933550dfb3b52b5fcc0"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2015-10-30T04:19:00.000Z",
  "prize": [
    2400,
    1200
  ],
  "projectId": 9163,
  "registrants": [
    {
      "handle": "lwaranch",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T10:40:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcbf"
    },
    {
      "handle": "savon_cn",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T04:44:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcbe"
    },
    {
      "handle": "lintc",
      "reliability": "0%",
      "registrationDate": "2015-10-30T05:01:00.000Z",
      "submissionDate": null,
      "rating": "1589",
      "colorStyle": "color: #DDCC00",
      "_id": "58132933550dfb3b52b5fcbd"
    },
    {
      "handle": "kcchiu",
      "reliability": "6%",
      "registrationDate": "2015-10-30T06:42:00.000Z",
      "submissionDate": null,
      "rating": "1046",
      "colorStyle": "color: #00A900",
      "_id": "58132933550dfb3b52b5fcbc"
    },
    {
      "handle": "FArIZzX77",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T07:01:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcbb"
    },
    {
      "handle": "son4moon",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T08:00:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcba"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T09:30:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb9"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T10:37:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb8"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T12:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb7"
    },
    {
      "handle": "galeri",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T13:41:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb6"
    },
    {
      "handle": "nghi85",
      "reliability": "33%",
      "registrationDate": "2015-10-30T18:10:00.000Z",
      "submissionDate": "2015-11-06T04:09:00.000Z",
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "58132933550dfb3b52b5fcb5"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2015-10-30T21:42:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb4"
    },
    {
      "handle": "mudit.bodom",
      "reliability": "n/a",
      "registrationDate": "2015-10-31T00:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb3"
    },
    {
      "handle": "ofakher",
      "reliability": "n/a",
      "registrationDate": "2015-10-31T01:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb2"
    },
    {
      "handle": "yassine123",
      "reliability": "n/a",
      "registrationDate": "2015-10-31T01:59:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcb1"
    },
    {
      "handle": "poundinc_tc",
      "reliability": "n/a",
      "registrationDate": "2015-10-31T11:03:00.000Z",
      "submissionDate": null,
      "rating": "154",
      "colorStyle": "color: #999999",
      "_id": "58132933550dfb3b52b5fcb0"
    },
    {
      "handle": "Luckyodell",
      "reliability": "n/a",
      "registrationDate": "2015-10-31T20:16:00.000Z",
      "submissionDate": null,
      "rating": "258",
      "colorStyle": "color: #999999",
      "_id": "58132933550dfb3b52b5fcaf"
    },
    {
      "handle": "andresduque",
      "reliability": "26%",
      "registrationDate": "2015-10-31T20:42:00.000Z",
      "submissionDate": null,
      "rating": "1429",
      "colorStyle": "color: #6666FF",
      "_id": "58132933550dfb3b52b5fcae"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2015-11-01T02:45:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132933550dfb3b52b5fcad"
    }
  ],
  "registrationEndDate": "2015-11-01T04:20:00.000Z",
  "reliabilityBonus": 480,
  "reviewScorecardId": 30001571,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2015-11-06T04:19:00.000Z",
  "submissions": [
    {
      "handle": "nghi85",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 75.89,
      "finalScore": 75.89,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2015-11-06T04:09:00.000Z",
      "_id": "58132933550dfb3b52b5fcce"
    }
  ],
  "technology": [
    "CSS",
    "HTML",
    "JavaScript"
  ]
}