{
  "_id": 30051245,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:32:58.976Z",
  "appealsEndDate": "2015-09-12T13:07:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Product Inventory Audit Tool UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p>Welcome to &quot;<strong>Product Inventory Audit Tool UI Prototype Challenge</strong>&quot;. The goal of this challenge is to create Responsive HTML5 Prototype for our Product Inventory Audit Tool Application. The prototype must follow the best practices for coding Responsive applications. This challenge is the first prototype challenge to create the &quot;Base&quot; prototype that we can continue to develop with in future challenges.</p>\n\n<p><strong>NOTE: This application will need to use <a href=\"http://getbootstrap.com/getting-started\">Bootstrap</a> as it is part of our preferred frameworks.&nbsp;</strong></p>\n\n<p>As part of this challenge we need you to document your HTML5/CSS3/JavaScript code (using best practices). We are looking for a clear explanation of the code to allow us the ability to quickly update and integrate with future development. As this challenge is a FAST challenge we will allow documentation updates during final fixes if needed.</p>\n\n<p><span style=\"color:#0000FF\"><strong>Challenge Task Overview</strong></span><br />\n<strong>Background Overview&nbsp;</strong><br />\nProduct Inventory is a web application that will be used by Quality Department team members to audit product availability against expected availability. Essentially, this app will be used to help employees figure out if a product is available and if not, the reasons why it is not. The web application will be used primarily on desktop but will need to be responsive and work on tablet and mobile as well.&nbsp;</p>\n\n<p>The main task of this competition is to develop a Responsive HTML5 prototype based on the provided storyboard designs. We are focused on the &quot;Desktop&quot; view for this challenge. It is very important that you implement and use Bootstrap correctly so we can update the mobile views in a future challenge.</p>\n\n<p><span style=\"color:#008000\"><strong>Tips for Success: Ask questions early and get the Copilot or PM&#39;s feedback is very important for everyone to be successful in UI Prototype challenges.</strong></span></p>\n\n<p><strong>Key Requirements</strong><br />\n- Focus on overall Bootstrap/great code structure.<br />\n- Replicate the design of the approved Storyboards (PSD Files) for all pages.<br />\n- Ensure your pages display correctly in all browsers. It is your responsibility to make sure the pages display correctly.<br />\n- This new Portal will be a responsive HTML5 application - it will need to be scalable for different devices (mobile devices, tablets, and desktops), but for now, focus only on Desktop version.&nbsp;<br />\n- Ensure you submission clear of HTML and CSS Validation error and warning.</p>\n\n<p><span style=\"color:#0000FF\"><strong>Apps Use Case</strong></span><br />\n<strong>Quality Manager</strong><br />\n- Get an inventory of all products that are currently being sold on the company web site.<br />\n- Able to find specific product brand and categories by selects a set of filters to expose only those products that fall within that selection criterion.<br />\n- Able to select which data fields (attributes) that would like shown as a result of the inventory query. We should be able to save his unique preferences (e.g. brand, category, ratings, etc.) as well as reset to original search settings.<br />\n- Able to see all attributes associated with a particular product, along with able to drill down into next level of details for a particular product to view all of the associated detail attributes for that product.<br />\n- Able to export and/or email the raw table so that he can run further analysis<br />\n- Able to understand if the product being sold on the ecommerce web site are being displayed with the correct features, accessories, options, etc. &nbsp;<br />\n- Able to use this application on a regular basis to spot check new products and compare them with existing product documentation.</p>\n\n<p><strong>Product Manager</strong><br />\n- Ensure that the products that he/she is responsible for delivering to the marketplace are available for sale on the correct date. &nbsp;<br />\n- Able to configure the app to show the products in specific category, when they were added to the eCommerce site and validate that the product description, specs, etc. are all accurate.</p>\n\n<p><strong>Employees</strong><br />\n- Able to help customer who is looking to purchase a new product and has a specific idea of what he is looking for. &nbsp;Employees can verify that the product is available and that the options and accessories are accurately represented on the web site.<br />\n- If employees has another customer who has heard about a new product that will soon become available. The customer can ask if that particular product is available and what options and accessories come with it. Our Employees should be able to verify that the product is on the e-commerce site and show his friend all of the relevant information.<br />\n- Able to help customer who wants to buy a specific product. The customer knows that the product comes in various colors and wants to know what these specific colors are. &nbsp;Our Employees then use the application to verify product availability in the color requested.<br />\n- Helping a customer understand if a product and/or accessory is available for purchase from the company web site. Customer was not able to find exactly what he was looking for when searching on the company web site and has asked our employees to assist his search.<br />\n- Able to see that the product in question was recently removed from the store. Pulls up the specifications for the discontinued product and points the customer to a similar product that is available.<br />\n- Able to emails the product information to customer directly from the app/web page which includes a link to the product on the eCommerce site.</p>\n\n<p><span style=\"color:#0000FF\"><strong>Screen Requirements</strong></span><br />\n<strong>01. Login Screen</strong><br />\n<em>- Reference Screen &quot;04 Login.png&quot;</em><br />\n- User will need to provide their credential to use this apps<br />\n- Provide error login scenario if user enter incorrect credential.&nbsp;<br />\n- Provide forgot password functionality, get the content from wireframes and use the storyboard look and fee to create these functionality.<br />\n- Correct credential will bring user to dashboard screen.</p>\n\n<p><strong>02. Dashboard Screen</strong><br />\n<em>- Reference Screens &quot;01 Dashboard Screen.png&quot;, &quot;01-2 Dashboard_Saved_Search.png&quot;, &quot;01-3 Dashboard_Watched Items List.png&quot;</em><br />\n- Once user successfully logged in to the application, they will be redirected to this screen.<br />\n- This screen will show summary of inventory information to the user.<br />\n- User needs to quickly see important information and updates to products that previously searched for.<br />\n- Notice there are 3 tabs available in the dashboard, they are Alerts (01 Dashboard Screen.png), Saved Search (01-2 Dashboard_Saved_Search.png), and Watched Items (01-3 Dashboard_Watched Items List.png)<br />\n- Once a user has saved a search, the results of these saved searches will populate the dashboard. This could mean displaying multiple searches at once, or a single search at once but users must have the ability to toggle between saved search results easily. Users will be presented with high-level data on alerts related to changes to the contents of their saved search.<br />\n- Presentation of saved search results:<br />\n-- Product list from saved search<br />\n-- Recent alerts/changes to the contents of your saved search (availability: available now: out of stock, coming soon, empty soon, etc.)<br />\n-- List of specific settings from this search<br />\n-- Export CSV of data. Native OS export options.<br />\n-- Search through search results data to further analyze results:<br />\n---- Sort by rating/review<br />\n---- Sort by date added<br />\n---- Sort by availability: available now, out of stock, coming soon, empty soon, etc.<br />\n---- Sort by quality: color, size, etc.&nbsp;</p>\n\n<p><strong>03. Search Screen</strong><br />\n<em>- Reference Screens &quot;02 Search Screen.png&quot;, &quot;02-1 Search_Screen_Box.png&quot;, &quot;02-2 Search_Filter.png&quot;</em><br />\n- This screen should provide an ability to quickly and easily begin finding products within a huge set of data.&nbsp;<br />\n- Notice that the search result will have 2 differents view, list (02 Search Screen.png) and thumbnail (02-1 Search_Screen_Box.png) view.<br />\n- Since there will be huge of data available here, we will need a strong filter to make sure the data that shown to user is the correct one (02-2 Search_Filter.png).<br />\n----Note: Micro-filters do not need to be implemented in this prototype &quot;<em>02-2 Search_Filter.png&quot;</em><br />\n- User will be able to export the data to other applications (CSV files, etc).&nbsp;<br />\n- Need to be alerted to changes within the sets of data/products that the employees responsible for.<br />\n- Make sure to simulate the search result so user can find how the apps will filter the data.<br />\n- Notice there is a &quot;save search&quot; button in this screen, if user click this button after doing search filtering, this search criteria will be saved in the apps and appear in dashboard under tab &quot;Saved Search&quot;</p>\n\n<p><strong>04. Alerts/Notification Screen</strong><br />\n<em>- Reference Screen &quot;03 Alerts_Notifications Screen.png&quot;</em><br />\n- User need to stay up to date on the products that they are responsible for without having to repeatedly search for that information.<br />\n- User can see alerts/notification from the apps header.&nbsp;<br />\n- There should be a standalone page that listing all the notifications, re-use table layout in the dashboard to create the notification stand alone page.<br />\n- Reasons a product/search would receive an alert:<br />\n-- Product running low<br />\n-- Product out of stock<br />\n-- New product coming soon<br />\n-- New product available<br />\n-- New version of product</p>\n\n<p><strong>05. Product Detail Screen</strong><br />\n<em>- Reference Screens &quot;05 Product detail Screen.png&quot;, &quot;05-1 Product_detail_Tecnical_Spec.png&quot;, &quot;05-2 Product_detail_Accesories.png&quot;.</em><br />\n- Once user found the products that he want to check, they can drilled down to that particular item to see the item details<br />\n- There are 3 kind of information will be shown in this screen, they are About Product (05 Product detail Screen.png), Technical Spec (05-1 Product_detail_Tecnical_Spec.png), and Accessories (05-2 Product_detail_Accesories.png)</p>\n\n<p><strong>06. Profile Screen</strong><br />\n<em>- Reference Screens &quot;06 Profile_Screen.png&quot;, &quot;06-2 Profile_Web Crawler.png&quot;, &quot;06-3 Profile_Rebuild_Data_Base.png&quot;, &quot;06-4 Profile_My_Profile.png&quot;</em><br />\n- There are 4 tabs available in this screen, and they are Contacts (06 Profile_Screen.png), Web Crawler (06-2 Profile_Web Crawler.png), Rebuild Database (06-3 Profile_Rebuild_Data_Base.png), My Profile (06-4 Profile_My_Profile.png)<br />\n- Contacts tab will show list of other user in the apps, show their basic profile and how to contact them.<br />\n- Web Crawler tab will provide some tools to crawl particular pages of this apps so it can be easily added to user mapping list<br />\n- Rebuild Database tab will provide tools to repair user database (admin privileges)<br />\n- My Profile tab will provide your basic profile data. User can edit their data by clicking each fields (check wireframes for edit profile functionality)</p>\n\n<p><strong>07. Messages Sreen</strong><br />\n<em>- Reference Screens &quot;07 Messages_Screen.png&quot;, &quot;07-1 Messages_Write_New_Message.png&quot;, &quot;07-2 Messages_Detail.png&quot;, &quot;07-3 Messages_Replyl.png&quot;</em><br />\n- Users can send each other messages within the app<br />\n- Needs to have Inbox to receive new message from other user that using the apps<br />\n- Needs to have New message feature to create message to other apps user.<br />\n- Needs to have feature where user can reply others email in the apps.</p>\n\n<p><span style=\"color:#0000FF\"><strong>Specific HTML/CSS/JavaScript Requirements</strong></span><br />\n<strong>HTML/CSS Requirements:</strong><br />\n- Your HTML code must be valid HTML5 and follow best practices<br />\n- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.<br />\n- No inline CSS styles - all styles must be placed in an external style-sheet.<br />\n- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.<br />\n- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.</p>\n\n<p><strong>JavaScript Requirements:</strong><br />\n- All JavaScript used must not have any copyrights to any third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- You are allowed to use JQuery and Bootstrap framework for this challenge.</p>\n\n<p><strong>Browsers Requirements</strong><br />\n- Chrome is a priority<br />\n- Latest Firefox, Safari &amp; Chrome Browsers<br />\n- IE10++ (can be left for final fixes)</p>\n\n<p><span style=\"color:#0000FF\"><strong>Documentation Provided</strong></span><br />\n- Wireframes, Storyboard and All necessary flow documents can be found in forum!</p>\n",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30051245",
  "event": {
    "id": 3446,
    "description": "2016 TopCoder(R) Open",
    "shortDescription": "tco16"
  },
  "finalFixEndDate": "2015-09-14T08:06:00.000Z",
  "finalSubmissionGuidelines": "<p><strong>Submission Deliverables:</strong><br />\n- A complete list of deliverables can be viewed in the UI Prototype Competitions <a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\">Tutorial</a>.&nbsp;</p>\n\n<p><strong>Final Submission:</strong><br />\n- For each member, the final submission should be uploaded to the <a href=\"https://software.topcoder.com/review\">Online Review Tool</a>.</p>\n",
  "forumId": 30359,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=30359",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 41,
  "numberOfSubmissions": 4,
  "phases": [
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-09-13T03:27:00.000Z",
      "actualStartTime": "2015-09-13T03:27:00.000Z",
      "scheduledEndTime": "2015-09-13T12:40:00.000Z",
      "actualendTime": "2015-09-13T12:40:00.000Z",
      "_id": "5813295a550dfb3b52b63e3a"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-13T12:41:00.000Z",
      "actualStartTime": "2015-09-13T12:41:00.000Z",
      "scheduledEndTime": "2015-09-13T13:41:00.000Z",
      "actualendTime": "2015-09-13T13:41:00.000Z",
      "_id": "5813295a550dfb3b52b63e39"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-09-14T03:36:00.000Z",
      "actualStartTime": "2015-09-14T03:36:00.000Z",
      "scheduledEndTime": "2015-09-14T08:06:00.000Z",
      "actualendTime": "2015-09-14T08:06:00.000Z",
      "_id": "5813295a550dfb3b52b63e38"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-14T08:06:00.000Z",
      "actualStartTime": "2015-09-14T08:06:00.000Z",
      "scheduledEndTime": "2015-09-14T08:54:00.000Z",
      "actualendTime": "2015-09-14T08:54:00.000Z",
      "_id": "5813295a550dfb3b52b63e37"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-09-14T08:56:00.000Z",
      "actualStartTime": "2015-09-14T08:56:00.000Z",
      "scheduledEndTime": "2015-09-16T11:53:00.000Z",
      "actualendTime": "2015-09-16T11:53:00.000Z",
      "_id": "5813295a550dfb3b52b63e36"
    },
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-09-04T19:22:00.000Z",
      "actualStartTime": "2015-09-04T19:22:00.000Z",
      "scheduledEndTime": "2015-09-04T19:23:00.000Z",
      "actualendTime": "2015-09-04T19:23:00.000Z",
      "_id": "5813295a550dfb3b52b63e35"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-04T19:23:00.000Z",
      "actualStartTime": "2015-09-04T19:23:00.000Z",
      "scheduledEndTime": "2015-09-04T22:16:00.000Z",
      "actualendTime": "2015-09-04T22:16:00.000Z",
      "_id": "5813295a550dfb3b52b63e34"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2015-09-04T22:16:00.000Z",
      "actualStartTime": "2015-09-04T22:16:00.000Z",
      "scheduledEndTime": "2015-09-07T22:17:00.000Z",
      "actualendTime": "2015-09-07T22:17:00.000Z",
      "_id": "5813295a550dfb3b52b63e33"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-09-04T22:21:00.000Z",
      "actualStartTime": "2015-09-04T22:21:00.000Z",
      "scheduledEndTime": "2015-09-09T22:17:00.000Z",
      "actualendTime": "2015-09-09T22:17:00.000Z",
      "_id": "5813295a550dfb3b52b63e32"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2015-09-09T22:17:00.000Z",
      "actualStartTime": "2015-09-09T22:17:00.000Z",
      "scheduledEndTime": "2015-09-10T03:15:00.000Z",
      "actualendTime": "2015-09-10T03:15:00.000Z",
      "_id": "5813295a550dfb3b52b63e31"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-10T03:15:00.000Z",
      "actualStartTime": "2015-09-10T03:15:00.000Z",
      "scheduledEndTime": "2015-09-11T21:49:00.000Z",
      "actualendTime": "2015-09-11T21:49:00.000Z",
      "_id": "5813295a550dfb3b52b63e30"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2015-09-11T21:49:00.000Z",
      "actualStartTime": "2015-09-11T21:49:00.000Z",
      "scheduledEndTime": "2015-09-12T09:50:00.000Z",
      "actualendTime": "2015-09-12T09:50:00.000Z",
      "_id": "5813295a550dfb3b52b63e2f"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2015-09-12T09:50:00.000Z",
      "actualStartTime": "2015-09-12T09:50:00.000Z",
      "scheduledEndTime": "2015-09-12T13:07:00.000Z",
      "actualendTime": "2015-09-12T13:07:00.000Z",
      "_id": "5813295a550dfb3b52b63e2e"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2015-09-12T13:07:00.000Z",
      "actualStartTime": "2015-09-12T13:07:00.000Z",
      "scheduledEndTime": "2015-09-12T13:20:00.000Z",
      "actualendTime": "2015-09-12T13:20:00.000Z",
      "_id": "5813295a550dfb3b52b63e2d"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-09-12T13:20:00.000Z",
      "actualStartTime": "2015-09-12T13:20:00.000Z",
      "scheduledEndTime": "2015-09-12T22:54:00.000Z",
      "actualendTime": "2015-09-12T22:54:00.000Z",
      "_id": "5813295a550dfb3b52b63e2c"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-09-12T22:54:00.000Z",
      "actualStartTime": "2015-09-12T22:54:00.000Z",
      "scheduledEndTime": "2015-09-13T03:27:00.000Z",
      "actualendTime": "2015-09-13T03:27:00.000Z",
      "_id": "5813295a550dfb3b52b63e2b"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-09-13T13:41:00.000Z",
      "actualStartTime": "2015-09-13T13:41:00.000Z",
      "scheduledEndTime": "2015-09-14T03:34:00.000Z",
      "actualendTime": "2015-09-14T03:34:00.000Z",
      "_id": "5813295a550dfb3b52b63e2a"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2015-09-04T22:16:00.000Z",
  "prize": [
    1400,
    700
  ],
  "projectId": 8980,
  "registrants": [
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2015-09-04T22:21:00.000Z",
      "submissionDate": "2015-09-09T13:58:00.000Z",
      "rating": "2225",
      "colorStyle": "color: #EE0000",
      "_id": "5813295a550dfb3b52b63e29"
    },
    {
      "handle": "lintc",
      "reliability": "0%",
      "registrationDate": "2015-09-04T22:33:00.000Z",
      "submissionDate": null,
      "rating": "1589",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295a550dfb3b52b63e28"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2015-09-04T22:40:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e27"
    },
    {
      "handle": "ahmed.seddiq",
      "reliability": "n/a",
      "registrationDate": "2015-09-04T23:02:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e26"
    },
    {
      "handle": "Ganesh_Madhu",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T00:40:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e25"
    },
    {
      "handle": "Em_Hamza",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T01:08:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e24"
    },
    {
      "handle": "Luckyodell",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T02:33:00.000Z",
      "submissionDate": "2015-09-09T22:15:00.000Z",
      "rating": "261",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63e23"
    },
    {
      "handle": "moulyg",
      "reliability": "100%",
      "registrationDate": "2015-09-05T02:47:00.000Z",
      "submissionDate": "2015-09-09T17:55:00.000Z",
      "rating": "1637",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295a550dfb3b52b63e22"
    },
    {
      "handle": "savon_cn",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T03:25:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e21"
    },
    {
      "handle": "roarky",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T03:32:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e20"
    },
    {
      "handle": "leo.ananth",
      "reliability": "40%",
      "registrationDate": "2015-09-05T03:54:00.000Z",
      "submissionDate": null,
      "rating": "1477",
      "colorStyle": "color: #6666FF",
      "_id": "5813295a550dfb3b52b63e1f"
    },
    {
      "handle": "GaborTheWizard",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T04:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e1e"
    },
    {
      "handle": "ghk413",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T06:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e1d"
    },
    {
      "handle": "karthiks416",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T06:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e1c"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T06:12:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e1b"
    },
    {
      "handle": "kcchiu",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T07:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e1a"
    },
    {
      "handle": "pawan91",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T09:42:00.000Z",
      "submissionDate": null,
      "rating": "954",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63e19"
    },
    {
      "handle": "besabestin",
      "reliability": "20%",
      "registrationDate": "2015-09-05T10:23:00.000Z",
      "submissionDate": null,
      "rating": "1074",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63e18"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T12:36:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e17"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T13:20:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e16"
    },
    {
      "handle": "Trapti333",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T13:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e15"
    },
    {
      "handle": "Rakesh.Sa",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T14:20:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e14"
    },
    {
      "handle": "topcodder02",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T16:16:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e13"
    },
    {
      "handle": "poundinc_tc",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T19:33:00.000Z",
      "submissionDate": null,
      "rating": "154",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63e12"
    },
    {
      "handle": "arch_angel",
      "reliability": "0%",
      "registrationDate": "2015-09-05T20:06:00.000Z",
      "submissionDate": null,
      "rating": "768",
      "colorStyle": "color: #999999",
      "_id": "5813295a550dfb3b52b63e11"
    },
    {
      "handle": "srcjz",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T20:07:00.000Z",
      "submissionDate": "2015-09-09T21:52:00.000Z",
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e10"
    },
    {
      "handle": "diogenesjcs",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T21:18:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e0f"
    },
    {
      "handle": "zachmilne",
      "reliability": "n/a",
      "registrationDate": "2015-09-05T21:48:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e0e"
    },
    {
      "handle": "andresduque",
      "reliability": "46%",
      "registrationDate": "2015-09-05T22:33:00.000Z",
      "submissionDate": null,
      "rating": "1469",
      "colorStyle": "color: #6666FF",
      "_id": "5813295a550dfb3b52b63e0d"
    },
    {
      "handle": "rtriv",
      "reliability": "0%",
      "registrationDate": "2015-09-06T02:19:00.000Z",
      "submissionDate": null,
      "rating": "1076",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63e0c"
    },
    {
      "handle": "DawnB",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T03:56:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e0b"
    },
    {
      "handle": "vimrc",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T04:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e0a"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T05:29:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e09"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T07:13:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e08"
    },
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2015-09-06T09:54:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "5813295a550dfb3b52b63e07"
    },
    {
      "handle": "kreasindo",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T10:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e06"
    },
    {
      "handle": "gjw99",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T11:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e05"
    },
    {
      "handle": "linuxgeek",
      "reliability": "n/a",
      "registrationDate": "2015-09-06T14:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e04"
    },
    {
      "handle": "agus.mw",
      "reliability": "40%",
      "registrationDate": "2015-09-07T01:34:00.000Z",
      "submissionDate": null,
      "rating": "1361",
      "colorStyle": "color: #6666FF",
      "_id": "5813295a550dfb3b52b63e03"
    },
    {
      "handle": "KrisD",
      "reliability": "n/a",
      "registrationDate": "2015-09-07T06:34:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e02"
    },
    {
      "handle": "khanhlinh",
      "reliability": "n/a",
      "registrationDate": "2015-09-07T08:00:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295a550dfb3b52b63e01"
    }
  ],
  "registrationEndDate": "2015-09-07T22:17:00.000Z",
  "reliabilityBonus": 280,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2015-09-09T22:17:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 92.33,
      "finalScore": 96.67,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2015-09-09T13:58:00.000Z",
      "_id": "5813295a550dfb3b52b63e3e"
    },
    {
      "handle": "moulyg",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 89.11,
      "finalScore": 89.11,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2015-09-09T17:55:00.000Z",
      "_id": "5813295a550dfb3b52b63e3d"
    },
    {
      "handle": "srcjz",
      "placement": 3,
      "screeningScore": 100,
      "initialScore": 59.78,
      "finalScore": 61.67,
      "points": 0,
      "submissionStatus": "Failed Review",
      "submissionDate": "2015-09-09T21:52:00.000Z",
      "_id": "5813295a550dfb3b52b63e3c"
    },
    {
      "handle": "Luckyodell",
      "placement": null,
      "screeningScore": 0,
      "initialScore": null,
      "finalScore": null,
      "points": 0,
      "submissionStatus": "Failed Screening",
      "submissionDate": "2015-09-09T22:15:00.000Z",
      "_id": "5813295a550dfb3b52b63e3b"
    }
  ],
  "technology": [
    "Bootstrap",
    "CSS",
    "HTML",
    "HTML5",
    "JQuery",
    "JavaScript"
  ]
}