{
  "_id": 30054223,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:06:35.516Z",
  "appealsEndDate": "2016-06-21T01:31:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Dinnaco - Talent Advantage Front-End Functional Prototype Challenge",
  "challengeType": "Code",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<span style=\"color:#FF0000\"><span style=\"font-size:16px\"><strong><u>Challenge Overview</u></strong></span></span><br />\nWelcome to &quot;<strong>Dinnaco - Talent Advantage Front-End Functional Prototype Challenge</strong>&quot;. Recently, we finished the UI prototype challenge for this project. In this challenge, we are looking for you to help implement the functions required to display the information in this UI prototype.<br />\n&nbsp;<br />\nThe main goal of this project is to allow system users to search and rank their global workforce for the best match for specific roles based on requirements. Organizations will benefit by ensuring that the best candidates are placed in global roles or projects resulting in enhanced overall performance.<br />\n&nbsp;<br />\nOur client is very excited about this application and will be demonstrating this software to a large audience on June 28th. We&rsquo;re facing a challenging timeline to get it polished up and ready. As you&rsquo;ll see in the spec, there won&rsquo;t be a back end at this demo stage, however there are still a lot of features involved and we only have to complete this contest and to get it polished and ready for demo. We also need to allow some time for feedback and fixes before the demo. For this reason, we&rsquo;re using some tighter timelines for the challenge. Please think outside the box and help us meet our goal and achieve a successful demo!<br />\n&nbsp;<br />\n<strong>Please note:</strong> At this point, there is no backend for the demo. This is a completely front-end development challenge where we want the community to use <strong>Angular JS </strong>technology to implement prototype functions. We do expect to have backend at the later stage and hence you are expected design and implement keeping REST architecture in mind.<br />\nCurrently, we just want you to use the provided prototype and implement the Search and Map functions.We will host this code on web server -- please plan for that.<br />\n&nbsp;<br />\n<span style=\"font-size:16px\"><span style=\"color:#FF0000\"><strong><u>Platforms and Technologies</u></strong></span></span><br />\nAngular.js, HTML/HTML5, CSS3, D3, Bootstrap, JSON, JavaScript, Leaflet JS<br />\n&nbsp;<br />\n<u><span style=\"font-size:16px\"><strong>Important Expectations:</strong></span></u><br />\n&nbsp;<br />\n- Use <strong>Angular.js</strong> for functions.<br />\n- Please use data files provided.<br />\n- You MUST make sure all graphics remain intact.<br />\n- Challenge winner will be responsible to fix any issues we found or exists on existing Code after updated based on this challenge spec.<br />\n- For graph and map libraries, you are <strong>NOT</strong> allowed to change from what is used. You need to use the provided real data and computations that you implement to display information on map and graphs.<br />\n<strong>Please maintain the overall look and feel of the UI prototype.</strong><br />\n&nbsp;<br />\n<span style=\"color:#FF0000\"><span style=\"font-size:16px\"><strong><u>Data </u></strong></span></span><br />\n&nbsp;<br />\n<strong><u>Combined Matrix.xlsx </u></strong>- This file contains multiple sheets which has all the data that has to be used for this demo. Currently the data is in xlsx format. You <strong>need to convert </strong>the data into <strong>JSON </strong>format to use it. Please discuss in forums if you have questions related to this conversion.<br />\nThe first sheet in the data &ldquo;Summary&rdquo; provides all information about the data available in other sheets.<br />\n&nbsp;<br />\n<strong>THERE ARE MANY MINUTE DETAILS IN THE REQUIREMENTS SECTION TO HELP YOU MOVE FAST. PLEASE READ SPEC CAREFULLY AND ASK QUESTIONS AS EARLY AS POSSIBLE IN FORUMS TO CLARIFY ANY DOUBT.</strong><br />\n&nbsp;<br />\n<span style=\"color:#FF0000\"><span style=\"font-size:16px\"><strong><u>Code Challenge Page Requirements</u></strong></span></span><br />\n&nbsp;<br />\nThere are 5 main pages in the prototype:<br />\n&nbsp;<br />\n1.) Landing Page &ndash; Main Search page.<br />\n2.) Main Search Results Page &ndash; Contains map and score meters with top search results<br />\n3.) Country Details Page &ndash; Provides statistics about talents in specific country.<br />\n4.) User Details Page &ndash; Provided information about an individual (talent).<br />\n5.) Comparison Page &ndash; Provides comparison on talent statistics between (up to) three countries.<br />\n&nbsp;<br />\n<strong>Please note: All the computations are based on concept of two countries &ndash; Host Country and Home Country. Following are their definitions</strong><br />\n&nbsp;<br />\n<strong>Host Country: The country that the user of this application selects in &ldquo;Location&rdquo; field of the first page.</strong><br />\n<strong>Home Country: The country of the individual talent obtained in the search results. </strong><br />\n&nbsp;<br />\n<span style=\"font-size:14px\"><strong><span style=\"color:#FF0000\">&nbsp;</span><u>Score Metrics</u></strong></span><br />\n&nbsp;<br />\nThere are two main scores that you would compute:\n<ol>\n\t<li>Individual Talent Score (Matching Score) &ndash; Score of an individual talent based on the search criteria<br />\n\tCountry Score &ndash; This is the average score of a country based on three second level score metric &ndash; Speed, Cost and Difficulty. These scores are calculated as aggregate scores for a country based on all individual talents found matching to the search results.</li>\n</ol>\n&nbsp;<br />\nIf you see terms Country 1 and Country 2, they stand for Host Country and Home Country.<br />\n&nbsp;<br />\n<span style=\"color:#FF0000\"><strong><em><u>Country Score Computation</u></em></strong></span><br />\n&nbsp;<br />\n&nbsp;<br />\n<strong>Step 1: Calculate each of Speed, Cost and Difficulty for a Country based on following conditions. All three will be an aggregated score over all individuals satisfying the matching criteria and the normalized between 1-10.</strong><br />\n&nbsp;<br />\n<strong>Speed</strong>: this should be calculated by comparing the Start Date that the user selects on the first page and the Availability Date of an individual in the dataset as follows:<br />\n- if Availabilty Date is equal to or less than the Start Date score 10.<br />\n- if Availabilty Date is after the Start Date and within 1 month of Start Date score 8.<br />\n- if Availabilty Date is after the Start Date and between 1-4 months score 6.<br />\n- if Availabilty Date is after the Start Date and between 5-10 months score 4.<br />\n- if Availabilty Date is after the Start Date and 10+ months score 2.<br />\n<br />\n<strong>Cost</strong>: this should be calculated by comparing the Cost Multiplier between Country 1 and Country 2 as follows:<br />\n- if multiplier difference between Country 1 and Country 2 is between 1-3 score 10.<br />\n- if multiplier difference between Country 1 and Country 2 is between 3-5 score 8.<br />\n- if multiplier difference between Country 1 and Country 2 is between 5-7 score 6.<br />\n- if multiplier difference between Country 1 and Country 2 is between 8-10 score 4.<br />\n- if multiplier difference between Country 1 and Country 2 is 11+ score 2.<br />\n<br />\n<strong>Difficulty</strong>: this should be calculated by comparing the Immigration Complexity between Country 1 and Country 2 as follows:<br />\n- if N/A score 10<br />\n- if Easy score 7<br />\n- if Moderate score 4<br />\n- if Difficult score 1<br />\n&nbsp;&nbsp;<br />\n<strong>Step 2: Once you have these three numbers, compute their average to get the total score for the country.</strong><br />\n&nbsp;&nbsp;<br />\n<span style=\"color:#FF0000\"><strong><em><u>Individual Talent Selection and Score (Matching Score) Computation</u></em></strong></span><br />\n&nbsp;<br />\nLet score = 0.0<br />\n&nbsp;<br />\n<strong>1st Step: Filter Individuals based on Categorical Fields</strong><br />\n&nbsp;\n<ol>\n\t<li>Skills: If an individual from the dataset has one or more of the skills that are selected by the user then they should be returned as a match<br />\n\tJob Family: If an individual from the dataset has <strong>&ldquo;exact match&rdquo;</strong> with the Job family selected by the user then they should be returned as a match.<br />\n\tExperience: If an individual from the dataset has experience selected by the user then they should be returned as a match.</li>\n</ol>\n<strong>2nd Step: After applying all the above filters, score the remaining individuals based on below criteria</strong>&nbsp;<br />\n&nbsp;\n<ol>\n\t<li>Languages Spoken: If any of the individual&rsquo;s languages spoken match either the primary or secondary languages in the host location (per the data in tab &#39;8. Languages&#39;) then score 10, otherwise no score.<br />\n\tNationality: Please score as mentioned in the Difficulty section for Country computation.<br />\n\tPerformance Rating: If the individual has a performance rating of &#39;Distinctive&#39; then score 10, if it is &#39;Strong&#39; then score 6, if it is &#39;Fair&#39; then score 2. Please see the revised matrix we have provided - tab &#39;7. Sample Data&#39; (column L).<br />\n\tCost - Please score as mentioned in the Cost section for Country computation.</li>\n</ol>\n&nbsp;<br />\n<strong>3rd Step: Normalize the score to be between&nbsp;1 and 10 and return those individuals sorted by score and sorted by score aggregated by country. You will use these two rankings further in displaying various details on pages described below.</strong><br />\n&nbsp;<br />\n<span style=\"color:#0000FF\"><strong>01. Landing Page &ndash; Main Search Page</strong></span><br />\n&nbsp;<br />\n- Please see all the fields. There is a validation already implemented &ndash; Please maintain that.<br />\n- All the fields already contain the options that are to be used in computing search results.<br />\n- You just need to use the selected information to compute the &ldquo;search&rdquo; Results.<br />\n- Based on the information selected on this page, you will compute the &ldquo;<strong>Matching Score&rdquo;</strong> of each individual available in the dataset and fetch corresponding required information.<br />\n&nbsp;<br />\n<strong><u>Reference Data for various fields:</u></strong><br />\nPlease refer to provided data file <strong>Combined Matrix.xlsx - Sheet 7 (Sample Data)</strong>.<br />\nJob Family: Use all unique values from Job Family Column.<br />\nSkill: Use all 20 values in Skills table.<br />\nDuration: 0-3 months, 3-12 months, 1-3 years and 3+ years<br />\nLocation: Country-City Pair<br />\nExperience: Unique values from Experience Column.<br />\nStart Date: Calendar.<br />\n&nbsp;<br />\n<span style=\"color:#0000FF\"><strong>02. Main Search Results Page</strong></span><br />\n&nbsp;<br />\n- <strong>Header Panel: </strong>Please see the number on the right top with title &ldquo;Global Matches&rdquo;. It should show the total number of matches found globally based on search criteria on first page.<br />\n- <strong>Second Panel: </strong><br />\n1.) In the center, it displays the skills that are selected on Search page. This is already implemented. Please maintain it.<br />\n2.) The icon on left side of this panel, opens a &ldquo;Refine&rdquo; box. This allows you to refine your Search results. You need to use the same logic as first page Search to refine your results.<br />\n3.) The right icon opens another panel below it: Comparison Panel. Here you can select up to three countries for comparison and click on the &ldquo;two arrows&rdquo; icon to go to comparison page. When you open this panel &ndash; the page goes into <strong>&ldquo;Comparison Mode&rdquo;. </strong>The changes behavior of several elements on page during comparison vs. non-comparison mode will be described later.<br />\n&nbsp;<br />\n- <strong>Third Panel: </strong>This is comparison panel described above and will be displayed only if you open it for comparison.<br />\n&nbsp;<br />\n- <strong>Flyouts on right margin: </strong>There are two flyouts on right side: <strong>&ldquo;Top Country by Score&rdquo;</strong> and <strong>&ldquo;Top Individuals&rdquo;</strong>. You need to rank your search results based on the score and display them here accordingly. For <strong>&ldquo;Top Country by Score&rdquo;,</strong> use the country score computed as mentioned above. <strong>&ldquo;Top Individuals&rdquo;</strong> will be the Matching Score computed as mentioned above. Please note that this score is on global level and not specific to each country.<br />\n&nbsp;<br />\n<strong>These two flyouts will display only Top 10 results in each of them.</strong><br />\n&nbsp;<br />\n- <strong>Map:</strong><br />\n&nbsp;<br />\n1.) The Zoom in and Zoom out button on left is used for zooming effect while the &ldquo;Center&rdquo; button brings the map to center.<br />\n2.) The grey pins that are seen on the map should come from your result. They should be placed on <strong>Top 10 Countries</strong> in your search results. This means it should exactly match the <strong>&ldquo;Top Country by Score&rdquo; </strong>flyout as mentioned above.<br />\n3.) When you hover over the country, a black hexagon appears. In this hexagon, you should display the number of matches from that country as obtained in your result and the score for that country.<br />\n4.) Clicking the hexagon will take you to country details page.<br />\n&nbsp;<br />\n- <strong>Score Meters:</strong><br />\n&nbsp;<br />\n1.) These are the three meters at the bottom. They belong to <strong>&ldquo;Top 3&rdquo; countries in your match results.</strong><br />\n2.) The top of the meters should display &ldquo;Country Name&rdquo; And &ldquo;Number of Matches&rdquo; for that country.<br />\n3.) The three numbers Speed, Difficulty and Cost are same as you computed using &ldquo;Country Score computation&rdquo;.<br />\n4.) The score in the center is the Average score based on above three scores.<br />\n&nbsp;<br />\n<strong>Please note: The three score meters are live and should display those circular bars correctly matching the score.</strong><br />\n&nbsp;<br />\n- <strong>Explanation of Comparison vs. Non-comparison Mode:</strong><br />\n&nbsp;<br />\nNot in Comparison mode (i.e. the comparison panel is not open)<br />\n&nbsp;<br />\n1.) hover on bubble - show hexagon<br />\n2.) Click on bubble - nothing happens<br />\n3.) click on hexagon - take to country details page<br />\n4.) In the flyout menu of top 10 countries. click on country - take to country details page<br />\n&nbsp;<br />\nWhen in comparison mode (i.e. the comparison panel is open)<br />\n1.) hover on bubble - show hexagon<br />\n2.) Click on bubble - Add country for comparison<br />\n3.) click on hexagon - take to country details page<br />\n4.) In the flyout menu of top 10 countries. click on country - Add country for comparison.<br />\n&nbsp;<br />\n&nbsp;<br />\n<span style=\"color:#0000FF\"><strong>03. Country Detail Page</strong></span><br />\n&nbsp;<br />\n- You can go to country detail page as shown above.<br />\n- In the left panel, you will display various statistics. All statistics are self- explanatory and available in provided data but please ask in forums if something is not clear. You need to compute or fetch this from data. Currently we just display dummy numbers.<br />\n- The three meters at the bottom of left panel are scores for that country as discussed earlier. Please note that the meters are live and the circular bar should match the actual score.<br />\n- The right hand side displays the matching individuals from that country with some information about them and their score. This will display all the individuals <strong>from that country</strong> that were found match as per the search criteria.<br />\n&nbsp;<br />\n<span style=\"color:#0000FF\"><strong>04. User Detail Page</strong></span><br />\n&nbsp;<br />\n- You can come to this page either by clicking the individual&rsquo;s link form Top 10 talents displayed on map page or clicking any individual by clicking their link on Country Detail page.<br />\n- Use dummy but different and reasonable data for different individuals. One way to do this is to create a small data on your side by filling some dummy details for all individuals in data. There are not many individuals and so this should be easy. You should use any data that is already available if that is to be displayed in this page.<br />\n- Please ask any clarifying questions in forums.<br />\n&nbsp;<br />\n<span style=\"color:#0000FF\"><strong>05. Comparison Page</strong></span><br />\n&nbsp;<br />\n- Clicking on the comparison icon brings you to this page.<br />\n- Here the comparison data needs to be replaced by actual data from your computations.<br />\n- As you can observe, the fields compared here are same as the one displayed in left panel of each Country Detail Page.<br />\n&nbsp;<br />\n&nbsp;<br />\n<span style=\"color:#FF0000\"><span style=\"font-size:16px\"><strong><u>Client Priorities (The items that are considered highest prototype priorities)</u></strong></span></span><br />\n&nbsp;<br />\n- Creating quality and efficient code that works in all the requested browsers.<br />\n<strong>- Please give special attention to Search performance.</strong><br />\n<strong>- Please give special attention to Response time and Display time.</strong><br />\n- All elements should be consistent, pay attention to padding, margin, line-height, etc.<br />\n&nbsp;<br />\n&nbsp;<span style=\"font-size:16px\"><u><strong>Browsers Requirements</strong></u></span><br />\n- Chrome Latest Browser<br />\n- Safari Latest Browser<br />\n- Firefox Latest Browser<br />\n- IE 11 and above<br />\n- Chrome, Firefox and Safari on iPad (Landscape &amp; Portrait View)<br />\n- Android Browser",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30054223",
  "finalSubmissionGuidelines": "<span style=\"color:rgb(255, 0, 0); font-family:sofia pro,merriweather sans,helvetica,arial,sans-serif; font-size:14px\"><strong>Submission Deliverables:</strong></span><br />\n<span style=\"color:rgb(0, 0, 0); font-family:sofia pro,merriweather sans,helvetica,arial,sans-serif; font-size:14px\">- Please attach your code as a ZIP file in OR.</span>",
  "forumId": 33079,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=33079",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 51,
  "numberOfSubmissions": 2,
  "phases": [
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-06-12T16:11:00.000Z",
      "actualStartTime": "2016-06-12T16:11:00.000Z",
      "scheduledEndTime": "2016-06-17T04:12:00.000Z",
      "actualendTime": "2016-06-17T04:12:00.000Z",
      "_id": "5813232b550dfb3b52b3e119"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-06-12T16:16:00.000Z",
      "actualStartTime": "2016-06-12T16:16:00.000Z",
      "scheduledEndTime": "2016-06-17T16:16:00.000Z",
      "actualendTime": "2016-06-17T16:16:00.000Z",
      "_id": "5813232b550dfb3b52b3e118"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-06-17T16:16:00.000Z",
      "actualStartTime": "2016-06-17T16:16:00.000Z",
      "scheduledEndTime": "2016-06-19T14:25:00.000Z",
      "actualendTime": "2016-06-19T14:25:00.000Z",
      "_id": "5813232b550dfb3b52b3e117"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2016-06-19T14:25:00.000Z",
      "actualStartTime": "2016-06-19T14:25:00.000Z",
      "scheduledEndTime": "2016-06-20T14:25:00.000Z",
      "actualendTime": "2016-06-20T14:25:00.000Z",
      "_id": "5813232b550dfb3b52b3e116"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2016-06-20T14:25:00.000Z",
      "actualStartTime": "2016-06-20T14:25:00.000Z",
      "scheduledEndTime": "2016-06-21T01:31:00.000Z",
      "actualendTime": "2016-06-21T01:31:00.000Z",
      "_id": "5813232b550dfb3b52b3e115"
    }
  ],
  "platforms": [
    "Heroku",
    "HTML"
  ],
  "postingDate": "2016-06-12T16:11:00.000Z",
  "prize": [
    800,
    400
  ],
  "projectId": 9622,
  "registrants": [
    {
      "handle": "solokop",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T20:41:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e114"
    },
    {
      "handle": "blackbiron",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T19:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e113"
    },
    {
      "handle": "ouyangki",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T16:31:00.000Z",
      "submissionDate": "2016-06-17T15:18:00.000Z",
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e112"
    },
    {
      "handle": "tuxing",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T16:41:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e111"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T17:00:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e110"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T17:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e10f"
    },
    {
      "handle": "susiak",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T17:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e10e"
    },
    {
      "handle": "natnael_getahun",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T17:34:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e10d"
    },
    {
      "handle": "g.prog",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T17:47:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e10c"
    },
    {
      "handle": "ananthhh",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T17:49:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e10b"
    },
    {
      "handle": "thkang91",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T18:00:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e10a"
    },
    {
      "handle": "iversonLv",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T18:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e109"
    },
    {
      "handle": "ShindouHikaru",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T18:13:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e108"
    },
    {
      "handle": "zsudraco",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T20:29:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e107"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T20:44:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e106"
    },
    {
      "handle": "nghi85",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T21:18:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e105"
    },
    {
      "handle": "gets0ul",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T21:21:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e104"
    },
    {
      "handle": "playgameTL",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T22:29:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e103"
    },
    {
      "handle": "Rakesh.Sa",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T22:54:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e102"
    },
    {
      "handle": "ecavalier313",
      "reliability": "n/a",
      "registrationDate": "2016-06-12T23:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e101"
    },
    {
      "handle": "genycopedison",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T04:41:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e100"
    },
    {
      "handle": "renqingwei123",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T04:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0ff"
    },
    {
      "handle": "baoqger",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T05:08:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0fe"
    },
    {
      "handle": "cam.ashwini",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T05:36:00.000Z",
      "submissionDate": "2016-06-17T16:13:00.000Z",
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0fd"
    },
    {
      "handle": "srajas",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T07:42:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0fc"
    },
    {
      "handle": "Jarnanchen",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T07:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0fb"
    },
    {
      "handle": "Colinh84",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T09:03:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0fa"
    },
    {
      "handle": "pfilippi",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T11:25:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f9"
    },
    {
      "handle": "wcheung",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T12:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f8"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T13:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f7"
    },
    {
      "handle": "nobita889",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T14:02:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f6"
    },
    {
      "handle": "XinScirpt",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T14:47:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f5"
    },
    {
      "handle": "allen1128",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T16:17:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f4"
    },
    {
      "handle": "fish00",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T16:29:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f3"
    },
    {
      "handle": "wsobolewski",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T18:01:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f2"
    },
    {
      "handle": "gjw99",
      "reliability": "n/a",
      "registrationDate": "2016-06-13T23:05:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f1"
    },
    {
      "handle": "moulyg",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T02:14:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0f0"
    },
    {
      "handle": "arihanqt",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T02:18:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0ef"
    },
    {
      "handle": "testXuSanping",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T02:59:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0ee"
    },
    {
      "handle": "wangke",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T04:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0ed"
    },
    {
      "handle": "Gando19850304",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T06:30:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0ec"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T10:56:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0eb"
    },
    {
      "handle": "frozenfx",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T12:57:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0ea"
    },
    {
      "handle": "moagi.anela",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T13:27:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e9"
    },
    {
      "handle": "tosha5252",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T16:22:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e8"
    },
    {
      "handle": "avbngera",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T17:27:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e7"
    },
    {
      "handle": "Twy86",
      "reliability": "n/a",
      "registrationDate": "2016-06-14T18:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e6"
    },
    {
      "handle": "jlatouf33",
      "reliability": "n/a",
      "registrationDate": "2016-06-15T13:42:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e5"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2016-06-15T16:46:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e4"
    },
    {
      "handle": "mtj111",
      "reliability": "n/a",
      "registrationDate": "2016-06-15T23:52:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e3"
    },
    {
      "handle": "me.pradp",
      "reliability": "n/a",
      "registrationDate": "2016-06-16T03:20:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813232b550dfb3b52b3e0e2"
    }
  ],
  "registrationEndDate": "2016-06-17T04:12:00.000Z",
  "reviewScorecardId": 30001610,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": null,
  "submissionEndDate": "2016-06-17T16:16:00.000Z",
  "submissions": [
    {
      "handle": "ouyangki",
      "placement": 1,
      "screeningScore": null,
      "initialScore": 82.5,
      "finalScore": 85,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-06-17T15:18:00.000Z",
      "_id": "5813232b550dfb3b52b3e11b"
    },
    {
      "handle": "cam.ashwini",
      "placement": 2,
      "screeningScore": null,
      "initialScore": 80,
      "finalScore": 82.5,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2016-06-17T16:13:00.000Z",
      "_id": "5813232b550dfb3b52b3e11a"
    }
  ],
  "technology": [
    "Angular.js",
    "Bootstrap",
    "CSS",
    "HTML5",
    "JSON"
  ]
}