{
  "_id": 30052375,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:32:22.299Z",
  "appealsEndDate": "2015-12-19T16:32:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "SiBM - DES Web Specialists Contact Responsive App Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p><span style=\"color:#FF0000\"><strong>CHALLENGE OVERVIEW</strong></span><br />\nWelcome to the &quot;<strong>SiBM - DES Web Specialists Contact Responsive App Prototype Challenge</strong>&quot;. The goal of this challenge is to create responsive HTML5 Prototype for our web specialist contact application using the provided wireframes and storyboards. The prototype must follow our standards and our guidelines. Review the details below.</p>\n\n<p>As part of this challenge we need you to document your HTML5/CSS3/JavaScript code (using best practices). We are looking for a clear explanation of the code to allow us the ability to quickly update and integrate with future development. We will allow documentation updates during final fixes (but still required).</p>\n\n<p><span style=\"color:#008000\"><strong>Tips for Success: Asking questions early and getting Copilot or PM&#39;s feedback is very important for the success of this challenge.</strong></span></p>\n\n<p><span style=\"color:#FF0000\"><strong>Competition Task Overview</strong></span><br />\nThe main task of this competition is to develop a Responsive HTML5 prototype based on the provided storyboard designs. Both Desktop and Mobile view are required for this challenge. It is very important that you pay attention to the responsiveness of your code to make sure it works in different devices.</p>\n\n<p><strong>Key Requirements:</strong><br />\n- We would like to ensure prototype is responsive (consider leveraging Bootstrap, Foundation, Pure, etc.) - it needs to work in desktop and mobiles.<br />\n- Test in all the required browsers (see the list below)<br />\n- Ensure your submission is clear of validation errors and warnings (HTML, CSS, JS).<br />\n- You are provided with a wireframe and storyboards.<br />\n- Screens/layout in wireframes and storyboards might be different, wherever the screens/layout are different, storyboards takes precedence - please follow that! (Wireframe should be helpful with the flow).<br />\n<strong><em>- NOTE: We have provided storyboards for mobile and desktop and also wireframes that show the flow of the application in challenge forum!!</em></strong></p>\n\n<p><span style=\"color:#FF0000\"><strong>User Flow Scenario</strong></span><br />\n<strong>Administrator:&nbsp;</strong><br />\n- The administration is used via full web interface (i.e. mobile version should be working but not priority, so some features can be omitted)<br />\n- After login, the administrator user can create, delete or update rules.&nbsp;<br />\n- Also, Admin user can list all notifications generated by the tool (check log history).</p>\n\n<p><strong>User (not logged in):&nbsp;</strong><br />\n- User can search for any information about IBM.com pages and report issues.</p>\n\n<p><strong>User (logged in):&nbsp;</strong><br />\n- User can search for any information about IBM.com pages and report issues.<br />\n- User can additionally see information about himself/herself and update it, or provide/vote for suggestions to any web pages information.</p>\n\n<p><span style=\"color:#FF0000\"><strong>Required Pages/Interactions</strong></span><br />\nThere are 2 user roles (Admin and User) that use this application and we need both roles to be created. Please create the following screens and interactions in the prototype :</p>\n\n<p><strong>General Requirements</strong><br />\n- Make sure navigation and menu working in all devices<br />\n- Provide hover condition for all links and button in web devices<br />\n- For all input form in any screens (URL, email address, etc), please provide error condition if user entry wrong value<br />\n<span style=\"color:#FF0000\">- IMPORTANT!! There are several differences between web and mobile screens, there are several areas that becomes hidden in mobile but available in web screen.&nbsp;</span></p>\n\n<p><span style=\"color:#0000FF\"><strong>A. User Screens (Desktop and Mobile)</strong></span><br />\n<strong>01. Search Screen</strong><br />\n<em>- WF references:<br />\n--- Mobile - Search &quot;Non-Logged In&quot; and &quot;Logged In.&quot;<br />\n--- Web - Search &quot;Non-Logged In Web&quot; and Search &quot;Logged In Web.&quot;</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-NonLogin Folder -&gt; 00.Search.jpg, 01.Search-Error.jpg (Non logged in User)<br />\n--- Mobile - Mobile-Logged Folder -&gt; 02.Search.jpg, 03.Search-Error.jpg (Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 02.Search.jpg, 03.Search-Error.jpg (both for non and logged in user)</em></p>\n\n<p>- Default page that will be open every time a user opens the app<br />\n- This page will be available for all users either they are logged in or not to the application<br />\n- Provide error condition if user entry wrong/invalid input or perform search query that break the rules.<br />\n- The &quot;Search&quot; button appear only after user finish enter the URL text in the available searchbox and once search submitted it gets information from tool and shows the result.<br />\n- There are several differences layout content between web and mobile, where several content on the web not included in the mobile parts, please be aware of it.</p>\n\n<p><strong>02. Search Result Screen</strong><br />\n<em>- WF references:<br />\n--- Mobile - Confirmed Contact (Non-Logged In) and (Logged In) &amp; Web - Confirmed Contact (Non-Logged In) and (Logged In)<br />\n--- Mobile - Suggested Contacts (Non-Logged In) and (Logged In) &amp; Web - Suggested Contacts (Non-Logged In) and (Logged In)<br />\n--- Mobile - No Contact (Non-Logged In) and (Logged In) &amp; Web - No Contact (Non-Logged In) and (Logged In)<br />\n--- Mobile - Suggested Owners (Non-Logged In) and (Logged In) &amp; Web - Suggested Owners (Non-Logged In) and (Logged In)</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-NonLogin Folder -&gt; 03.Result-Confirmed.jpg, 05.Result-Suggested.jpg (Non logged in User)<br />\n--- Mobile - Mobile-Logged Folder -&gt; &nbsp;05.Result-Confirmed.jpg, 06.Result-Suggested.jpg (Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 04.Search-Confirmed.jpg, 05.Search-Suggested.jpg (both for non and logged in user)</em></p>\n\n<p>- Search should be a very simple screen that will show the most relevant result based on user criteria (there can be more than 1 result for URL but only the most relevant (based on created rules in administration) is used to display result)<br />\n- If the user does not find the correct result, they should be able to perform another search quickly from the top area.&nbsp;<br />\n- There are several differences in the content layout between web and mobile, where some of the web content is not included in the mobile view - &nbsp;please be aware of it.<br />\n- There are two types of contacts: &quot;Owner&quot; and &quot;Contact person&quot;, they are independent (no relation between them) - in wireframes are shown cases when &quot;Owner&quot; is confirmed and &quot;Contact person&quot; has different status but the same statuses can apply for &quot;Owner&quot; as well (see &quot;Suggested Owners&quot; content to see how it looks like when both &quot;Owner&quot; and &quot;Contact person&quot; are not validated yet)&nbsp;</p>\n\n<p>- This screen will have different content variation when showing the result depending on the owner/contact information completeness in the system:<br />\n--- If the search result have confirmed/validated &quot;Owner&quot; and/or &quot;Contact person&quot; in the system, then it will show &quot;Confirmed Contact&quot; content (for particular contact type).<br />\n--- If the search result have one or both of &quot;Owner&quot; and/or &quot;Contact person&quot; with the contact information not yet valid in the system, then it will show &quot;Suggested Contact&quot; content (for particular contact type).<br />\n--- If the search result don&#39;t have any &quot;Owner&quot; and/or &quot;Contact person&quot; then it will show &quot;No Contact&quot; content (for particular contact type).</p>\n\n<p>- The differences between &quot;non-logged in&quot; and &quot;logged in&quot; user held in the ability for user to suggest and vote for suggested &quot;Owner&quot; and &quot;Contact person&quot;. There will be a button to suggest these information for logged in user.<br />\n- A Confirmed/Valid owner and contact will be defined by the number of votes give to them by other user that suggest the owner and contact information.&nbsp;<br />\n- If user thinks the information is not correct, they can report the web page information to admin for revision.</p>\n\n<p><strong>03. Report Screen</strong><br />\n<em>- WF references:<br />\n--- Mobile - Report (Non-Logged In) and (Logged In)</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-Logged Folder -&gt; &nbsp;07.Report.jpg (both for Non-Logged In and Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 07.Report.jpg (both for non and logged in user)</em></p>\n\n<p>- If user thinks the information in the search result page is incorrect, they can report it to admin and ask for revision.<br />\n- This feature is available both for non-logged in and logged in user, the storyboard only provide screen for logged in user, please replicate the screen for non logged in user.<br />\n- Simple comment form to enter user report and a submit button to send the report.<br />\n- Ability to choose whether user want to get (periodically) notification about the report status or not.<br />\n- In web parts, this screen created as modal window in search result screen.</p>\n\n<p><strong>04. Login Screen</strong><br />\n<em>- WF references:<br />\n--- &quot;Mobile - Login&quot; and &quot;Web - Login.&quot;</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-Logged Folder -&gt; &nbsp;00.Login.jpg, 01.Login-Error.jpg (both for Non-Logged In and Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 00.Login.jpg, 01.Login-Error.jpg (both for non and logged in user)</em></p>\n\n<p>- The user needs to log-in using IBM Intranet ID&nbsp;<br />\n- Provide ordinary login form (IBM ID as username, password, login button, etc.) as the layout content for this page.<br />\n- The application should also have a &quot;remember me&quot; so users do not need to log-in each time they want to use the application<br />\n- Provide error scenario when user input wrong credential or incomplete information.</p>\n\n<p><strong>05. Suggestion Contact Screen</strong><br />\n<em>- WF references:<br />\n--- &quot;Mobile - Suggest Contact (Logged In)&quot;</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-Logged Folder -&gt; &nbsp;08.Suggested-Contact.jpg (Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 08.Suggest.jpg (Logged in user)</em></p>\n\n<p>- This screen is only available for logged in user, user can access it from the &quot;suggest&quot; button/navigation in search result page.<br />\n- User will be able to recommends any IBM user as an owner and contact for particular IBM.com webpages including themselves as the owner and/or contact information.<br />\n- If there are already some contact suggestions there, user can &quot;vote&quot; for the suggested contact to make the contact confirmed/valid.&nbsp;<br />\n- There will be some calculation needed to move the contact status from &quot;suggested&quot; to &quot;confirmed&quot; state (vote more than 20 amount of people, etc.)<br />\n- If there are 3 contact suggestions already available and suggest new (4th) the one with lowest number of votes is removed from the list (the new one is kept, of course).<br />\n- In web parts, this screen created as modal window in search result screen.</p>\n\n<p><strong>06. Contact Screen</strong><br />\n<em>- WF references:<br />\n--- Mobile - Contact Details (Non-Logged In) &amp; (Logged In)<br />\n--- Web - Contact Details (Non-Logged In)</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-Logged Folder -&gt; &nbsp;09.Contact-Details.jpg (Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 06.Contact-Details.jpg (Logged in user)</em></p>\n\n<p>- The user can navigate to see details information of owner/contact and reach them by contacting via mail (verse) by clicking the mail button.&nbsp;</p>\n\n<p><strong>07. Settings Screen</strong><br />\n<em>- WF references:<br />\n--- &quot;Mobile - Suggest Contact (Logged In)&quot;</em></p>\n\n<p><em>- Storyboard references:<br />\n--- Mobile - Mobile-Logged Folder -&gt; &nbsp;10.MyProfile.jpg, 11.Edit-Profile.jpg, 12.Replace-All.jpg, 13.My-Confirmed-Contacts.jpg, 14.Replace-Contacts.jpg, 15.My-Suggested-Contacts.jpg (Logged In User)<br />\n--- Desktop - Desktop User Folder -&gt; 09.My-Profile.jpg, 10.Replace-Contact.jpg (Logged in user)</em></p>\n\n<p>- This screen is only available for logged in user, a user can access it from the &quot;Update My Profile&quot; button/navigation in the search page.<br />\n- The user can see their current profile and edit it if necessary.<br />\n- From this screen, they will be able to see their all records history in the apps which divide into three differents areas:<br />\n--- Replace All, Replace all records that connected to the user with someone else (mass replacement)s<br />\n--- My Confirmed Contacts, Manage all user records where the user mentioned as confirmed contacts (user can remove himself/herself or replace for single contact by another person)<br />\n--- My Suggested Contacts, Manage all user records where the user mentioned as suggested contacts (user can confirm himself/herself as contact or remove from suggestion list)</p>\n\n<p><span style=\"color:#0000FF\"><strong>B. Admin Screens (Desktop Only)</strong></span><br />\n<strong>08. Dashboard Screen</strong><br />\n<em>- WF references Admin - Dashboard<br />\n- Storyboard References - Desktop-Admin Folder -&gt; 00.Dashboard.jpg, 01.Search-Result.jpg</em></p>\n\n<p>- Default page for admin whenever they open the application<br />\n- This page will provide the admin a quick and easy navigation to check all apps features and apps information status.<br />\n- There is a list of recent application activity with clear icons to indicates the activity status. Admin can view latest activities or all activities (just ones that require attention). Items are removed from the list after the action is completed.<br />\n- Quick and simple search form to find information about IBM.com pages, please provide the search result page.<br />\n- Administrators need to have an interface to update data on web interface only (super user).<br />\n- List of administrators is kept within the tool.<br />\n- User can search using URLs, users, or rules :<br />\n--- If a URL, user name, or rule is entered, will find any rule that refers to the URL, any rule that has that rule-part, or any rule that involves that user&#39;s name.<br />\n--- If a user name is entered, will also find that user&#39;s profile.</p>\n\n<p><strong>09. Webpage Details Screen</strong><br />\n<em>- WF references Admin - Webpage Details (Confirmed Contact) (Suggested Contact) (Suggested Contact)<br />\n- Storyboard References - Desktop-Admin Folder -&gt; 03.Webpage-Details.jpg</em></p>\n\n<p>- Admin can access this page from search result and Admin can view details information about any IBM.com webpages in this page.<br />\n- There are three slightly different types of information that will be presented depending on the completeness of the information:<br />\n--- Confirmed Contact<br />\n--- Suggested Contact<br />\n--- No Contact</p>\n\n<p><strong>10. Users Details Screens</strong><br />\n<em>- WF references Admin - User Details<br />\n- Storyboard References - Desktop-Admin Folder -&gt; 04.Manage-User-Details.jpg</em></p>\n\n<p>- View users (found by search)<br />\n- View a user&#39;s profile (which shows where he is listed as owner, contact, or suggested contact)<br />\n- Contact users<br />\n- Confirm the user as a suggested contact, or remove them&nbsp;</p>\n\n<p><strong>11. Manage Rules Screens</strong><br />\n<em>- WF references Admin - Manage Users and Admin - Rule Create<br />\n- No Storyboard preferences - Reuse existing storyboard.</em></p>\n\n<p>- Administrator will be able to manage all rules for the search criteria from this screen<br />\n- All rules that have been created will be appear on this screen so admin can easily check the rules.<br />\n- Administrator also will be able to create new rules for the search criteria by click &quot;Create New Rules&quot; button&nbsp;<br />\n- Admin can do the following things from this page :<br />\n- View rules<br />\n- Add new rules<br />\n- Edit rules<br />\n- Remove rules<br />\n- Filter the list.</p>\n\n<p><strong>12. Admin - Activity (Wrong Info Report)</strong><br />\n<em>- WF references Admin - Manage Webpages<br />\n- No Storyboard preferences - Reuse existing storyboard.</em></p>\n\n<p>- All report from users will be available here<br />\n- The administrator can check all detail reports from the user regarding wrong information for owner/contact information in any IBM.com pages.</p>\n\n<p><strong>13. Get Help</strong><br />\n- No wireframe references<br />\n- List of FAQ or tutorial to help and explaining any features in the apps to the administrator.</p>\n\n<p><span style=\"color:#FF0000\"><strong>Target Audience&nbsp;</strong></span><br />\n- Global IBM Employees</p>\n\n<p><span style=\"color:#FF0000\"><strong>Specific HTML/CSS/JavaScript Requirements:</strong></span><br />\n<strong>HTML/CSS Requirements:</strong><br />\n- Your HTML code must be valid HTML5 and follow best practices<br />\n- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.<br />\n- No inline CSS styles - all styles must be placed in an external style-sheet.<br />\n- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.<br />\n- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.</p>\n\n<p><strong>JavaScript Requirements:</strong><br />\n- All JavaScript used must not have any copyrights to any third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- You are allowed to use JQuery (MIT License) &nbsp;for this contest.</p>\n\n<p><span style=\"color:#FF0000\"><strong>Browsers Requirements:</strong></span><br />\n- Android Mobile Browser<br />\n- Mobile Safari on iOS&nbsp;<br />\n- Internet Explorer 9+ &nbsp;on PC<br />\n- Firefox on Mac / PC<br />\n- Chrome on Mac / PC<br />\n- Safari on Mac<br />\n- Chrome on iOS / Android</p>\n\n<p><span style=\"color:#FF0000\"><strong>Documentation Provided:</strong></span><br />\n- Storyboard and Source files<br />\n- Wireframes</p>\n",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30052375",
  "event": {
    "id": 3446,
    "description": "2016 TopCoder(R) Open",
    "shortDescription": "tco16"
  },
  "finalFixEndDate": "2015-12-23T13:49:00.000Z",
  "finalSubmissionGuidelines": "<p><strong>Submission Deliverables:</strong><br />\n- A complete list of deliverables can be viewed in the <a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\">UI Prototype Competitions Tutorial</a>.</p>\n\n<p><strong>Final Submission:</strong><br />\n- For each member, the final submission should be uploaded to the <a href=\"http://software.topcoder.com/review\">Online Review Too</a>l.</p>\n",
  "forumId": 31443,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=31443",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 33,
  "numberOfSubmissions": 3,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-12-08T18:30:00.000Z",
      "actualStartTime": "2015-12-08T18:30:00.000Z",
      "scheduledEndTime": "2015-12-08T18:32:00.000Z",
      "actualendTime": "2015-12-08T18:32:00.000Z",
      "_id": "58132936550dfb3b52b60288"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2015-12-08T18:32:00.000Z",
      "actualStartTime": "2015-12-08T18:32:00.000Z",
      "scheduledEndTime": "2015-12-08T20:51:00.000Z",
      "actualendTime": "2015-12-08T20:51:00.000Z",
      "_id": "58132936550dfb3b52b60287"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2015-12-09T01:08:00.000Z",
      "actualStartTime": "2015-12-09T01:08:00.000Z",
      "scheduledEndTime": "2015-12-11T01:08:00.000Z",
      "actualendTime": "2015-12-11T01:08:00.000Z",
      "_id": "58132936550dfb3b52b60286"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2015-12-09T01:13:00.000Z",
      "actualStartTime": "2015-12-09T01:13:00.000Z",
      "scheduledEndTime": "2015-12-16T01:08:00.000Z",
      "actualendTime": "2015-12-16T01:08:00.000Z",
      "_id": "58132936550dfb3b52b60285"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2015-12-16T01:08:00.000Z",
      "actualStartTime": "2015-12-16T01:08:00.000Z",
      "scheduledEndTime": "2015-12-16T12:01:00.000Z",
      "actualendTime": "2015-12-16T12:01:00.000Z",
      "_id": "58132936550dfb3b52b60284"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2015-12-16T12:01:00.000Z",
      "actualStartTime": "2015-12-16T12:01:00.000Z",
      "scheduledEndTime": "2015-12-18T10:19:00.000Z",
      "actualendTime": "2015-12-18T10:19:00.000Z",
      "_id": "58132936550dfb3b52b60283"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2015-12-18T10:19:00.000Z",
      "actualStartTime": "2015-12-18T10:19:00.000Z",
      "scheduledEndTime": "2015-12-19T10:20:00.000Z",
      "actualendTime": "2015-12-19T10:20:00.000Z",
      "_id": "58132936550dfb3b52b60282"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2015-12-19T10:20:00.000Z",
      "actualStartTime": "2015-12-19T10:20:00.000Z",
      "scheduledEndTime": "2015-12-19T16:32:00.000Z",
      "actualendTime": "2015-12-19T16:32:00.000Z",
      "_id": "58132936550dfb3b52b60281"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2015-12-19T16:32:00.000Z",
      "actualStartTime": "2015-12-19T16:32:00.000Z",
      "scheduledEndTime": "2015-12-20T01:01:00.000Z",
      "actualendTime": "2015-12-20T01:01:00.000Z",
      "_id": "58132936550dfb3b52b60280"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-12-20T01:01:00.000Z",
      "actualStartTime": "2015-12-20T01:01:00.000Z",
      "scheduledEndTime": "2015-12-20T17:34:00.000Z",
      "actualendTime": "2015-12-20T17:34:00.000Z",
      "_id": "58132936550dfb3b52b6027f"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-12-20T17:34:00.000Z",
      "actualStartTime": "2015-12-20T17:34:00.000Z",
      "scheduledEndTime": "2015-12-21T00:58:00.000Z",
      "actualendTime": "2015-12-21T00:58:00.000Z",
      "_id": "58132936550dfb3b52b6027e"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-12-21T00:59:00.000Z",
      "actualStartTime": "2015-12-21T00:59:00.000Z",
      "scheduledEndTime": "2015-12-22T03:57:00.000Z",
      "actualendTime": "2015-12-22T03:57:00.000Z",
      "_id": "58132936550dfb3b52b6027d"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2015-12-22T03:59:00.000Z",
      "actualStartTime": "2015-12-22T03:59:00.000Z",
      "scheduledEndTime": "2015-12-23T13:49:00.000Z",
      "actualendTime": "2015-12-23T13:49:00.000Z",
      "_id": "58132936550dfb3b52b6027c"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2015-12-23T13:49:00.000Z",
      "actualStartTime": "2015-12-23T13:49:00.000Z",
      "scheduledEndTime": "2015-12-23T18:23:00.000Z",
      "actualendTime": "2015-12-23T18:23:00.000Z",
      "_id": "58132936550dfb3b52b6027b"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2015-12-23T18:25:00.000Z",
      "actualStartTime": "2015-12-23T18:25:00.000Z",
      "scheduledEndTime": "2015-12-31T15:37:00.000Z",
      "actualendTime": "2015-12-31T15:37:00.000Z",
      "_id": "58132936550dfb3b52b6027a"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2015-12-09T01:08:00.000Z",
  "prize": [
    1800,
    900
  ],
  "projectId": 9258,
  "registrants": [
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2015-12-09T01:27:00.000Z",
      "submissionDate": "2015-12-15T16:47:00.000Z",
      "rating": "2074",
      "colorStyle": "color: #DDCC00",
      "_id": "58132936550dfb3b52b60279"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T01:59:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60278"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T02:11:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60277"
    },
    {
      "handle": "virose",
      "reliability": "0%",
      "registrationDate": "2015-12-09T02:21:00.000Z",
      "submissionDate": null,
      "rating": "976",
      "colorStyle": "color: #00A900",
      "_id": "58132936550dfb3b52b60276"
    },
    {
      "handle": "dsng3192",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T02:49:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60275"
    },
    {
      "handle": "srajas",
      "reliability": "13%",
      "registrationDate": "2015-12-09T02:56:00.000Z",
      "submissionDate": null,
      "rating": "1598",
      "colorStyle": "color: #DDCC00",
      "_id": "58132936550dfb3b52b60274"
    },
    {
      "handle": "pbeta",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T03:11:00.000Z",
      "submissionDate": null,
      "rating": "1042",
      "colorStyle": "color: #00A900",
      "_id": "58132936550dfb3b52b60273"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T04:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60272"
    },
    {
      "handle": "naeem95m",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T04:53:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60271"
    },
    {
      "handle": "arch_angel",
      "reliability": "13%",
      "registrationDate": "2015-12-09T04:53:00.000Z",
      "submissionDate": null,
      "rating": "830",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b60270"
    },
    {
      "handle": "nomo_kazza",
      "reliability": "66%",
      "registrationDate": "2015-12-09T05:22:00.000Z",
      "submissionDate": "2015-12-15T22:30:00.000Z",
      "rating": "1351",
      "colorStyle": "color: #6666FF",
      "_id": "58132936550dfb3b52b6026f"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T05:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6026e"
    },
    {
      "handle": "Luckyodell",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T05:53:00.000Z",
      "submissionDate": null,
      "rating": "265",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b6026d"
    },
    {
      "handle": "son4moon",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T07:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6026c"
    },
    {
      "handle": "PeterBest",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T08:56:00.000Z",
      "submissionDate": null,
      "rating": "512",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b6026b"
    },
    {
      "handle": "gottam.ui",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T09:15:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6026a"
    },
    {
      "handle": "amrKh",
      "reliability": "33%",
      "registrationDate": "2015-12-09T09:16:00.000Z",
      "submissionDate": null,
      "rating": "1040",
      "colorStyle": "color: #00A900",
      "_id": "58132936550dfb3b52b60269"
    },
    {
      "handle": "bannie2492",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T10:29:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60268"
    },
    {
      "handle": "fxaeberhard",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T10:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60267"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T14:47:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60266"
    },
    {
      "handle": "softbalajibi",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T15:35:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60265"
    },
    {
      "handle": "Rakesh.Sa",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T17:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60264"
    },
    {
      "handle": "prasenjitroy",
      "reliability": "n/a",
      "registrationDate": "2015-12-09T20:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60263"
    },
    {
      "handle": "vikasverma",
      "reliability": "0%",
      "registrationDate": "2015-12-10T04:21:00.000Z",
      "submissionDate": null,
      "rating": "681",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b60262"
    },
    {
      "handle": "Rahul.Ravindran",
      "reliability": "13%",
      "registrationDate": "2015-12-10T05:19:00.000Z",
      "submissionDate": "2015-12-16T00:35:00.000Z",
      "rating": "771",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b60261"
    },
    {
      "handle": "topcodder02",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T05:33:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b60260"
    },
    {
      "handle": "linuxgeek",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T10:26:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6025f"
    },
    {
      "handle": "Rahul.A",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T13:27:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6025e"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T13:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6025d"
    },
    {
      "handle": "poundinc_tc",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T14:36:00.000Z",
      "submissionDate": null,
      "rating": "154",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b6025c"
    },
    {
      "handle": "iCare",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T15:42:00.000Z",
      "submissionDate": null,
      "rating": "770",
      "colorStyle": "color: #999999",
      "_id": "58132936550dfb3b52b6025b"
    },
    {
      "handle": "Trapti333",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T17:13:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132936550dfb3b52b6025a"
    },
    {
      "handle": "codebump",
      "reliability": "n/a",
      "registrationDate": "2015-12-10T21:45:00.000Z",
      "submissionDate": null,
      "rating": "934",
      "colorStyle": "color: #00A900",
      "_id": "58132936550dfb3b52b60259"
    }
  ],
  "registrationEndDate": "2015-12-11T01:08:00.000Z",
  "reliabilityBonus": 360,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2015-12-16T01:08:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 89,
      "finalScore": 96,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2015-12-15T16:47:00.000Z",
      "_id": "58132936550dfb3b52b6028b"
    },
    {
      "handle": "nomo_kazza",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 75.89,
      "finalScore": 78.89,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2015-12-15T22:30:00.000Z",
      "_id": "58132936550dfb3b52b6028a"
    },
    {
      "handle": "Rahul.Ravindran",
      "placement": null,
      "screeningScore": 0,
      "initialScore": null,
      "finalScore": null,
      "points": 0,
      "submissionStatus": "Failed Screening",
      "submissionDate": "2015-12-16T00:35:00.000Z",
      "_id": "58132936550dfb3b52b60289"
    }
  ],
  "technology": [
    "CSS",
    "HTML",
    "HTML5",
    "JavaScript",
    "jQuery"
  ]
}