{
  "_id": 30056026,
  "_isComplete": true,
  "__v": 4071,
  "_lastUpdate": "2017-01-10T19:51:52.246Z",
  "appealsEndDate": "2017-01-04T17:36:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Atlantis - iPAM Integrated Pricing Application Management - UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p><span style=\"color:rgb(0, 0, 255)\"><strong>Challenge Introduction:</strong></span><br />\nWelcome to Atlantis - iPAM Integrated Pricing Application Management - UI Prototype Challenge. In this challenge we are looking for your help to create a prototype for a web application based on the provided storyboards!<br />\n&nbsp;<br />\nAs part of this challenge we need you to document your HTML / CSS / JS (using best practices). We are looking for a clear explanation of the code to allow us the ability to quickly update and integrate with future development. We will allow documentation updates during final fixes (but still required).<br />\n<br />\nAt the of this challenge, we need a solid UI prototype using best coding practice/solutions. Good luck and we&rsquo;re looking forward to your submissions!<br />\n<br />\n<span style=\"color:rgb(0, 128, 0)\"><strong>Tips for Success: Asking questions early and getting Copilot or PM&#39;s feedback is very important for the success of this challenge.</strong></span><br />\n<br />\n<span style=\"color:rgb(178, 34, 34)\"><strong>UI Prototype Considerations:</strong></span><br />\n- Ensure your submission is clear of validation errors and warnings (HTML &amp; CSS).<br />\n- style.css - use this name for all custom css.<br />\n- Please use proper id&rsquo;s and classes in your naming conventions.<br />\n- Please find all required assets in the forums!<br />\n- Please use Angular 2 and follow John Papa&rsquo;s style guide (or) use&nbsp;Angular 1.6&nbsp;<br />\n-&nbsp;<span style=\"color:#FF0000\"><strong>NOTE: We will be adding an additional BONUS prize of $500 for the winner who do the prototype using Angular 2).</strong></span><br />\n- Please use SASS/SCSS for CSS pre-processor (preferred)<br />\n<br />\n<span style=\"color:rgb(0, 0, 255)\"><strong>Required Screens:</strong></span><br />\nWe need below screens and interactions in the prototype. There are four types of users for this application, we will handling all types of users in this challenge.<br />\n<br />\n<strong>00 Login:</strong><br />\n<span style=\"color:rgb(0, 0, 255)\"><em>Reference: 00.a. Log in.png</em></span><br />\n- Please create the view as shown in reference<br />\n- Based on the user type chosen, we need to direct the users to appropriate screen<br />\n- If LOPT is selected, then take them to 01. Dashboard Active.png<br />\n- If CBIL is selected, then take them to 70. CIBL Dashboard.png<br />\n- If SPS is selected, then take them to 56. SPS Dashboard.png<br />\n- If APT is selected, then take them to 88. APT-List view.png<br />\n- Show a simulation of how the error will be shown (00.c. Log in - error.png)<br />\n<br />\n<strong>01 Header:</strong><br />\n- All types of user logo should take the user back to appropriate homepage for the user.<br />\n- Clicking on the notification icon should show the notifications as in 03. Notifications.png<br />\n<br />\n<strong>User Thumbnail Drop-down:</strong><br />\n- We need to provide a way for the user to logout<br />\n- Maybe on clicking the drop-down icon near the name, we can show a logout option, clicking on which will take the user back to login page (<em>00.a. Log in.png)</em><br />\n<br />\n<strong>Notifications:</strong><br />\n- &ldquo;Check all&rdquo; can be a dead link for now<br />\n- please make sure the pagination works<br />\n- Clicking anywhere outside the notifications or the notification icon will hide it.<br />\n<br />\n<strong><span style=\"color:rgb(178, 34, 34)\">A. LOPT:</span></strong><br />\n<strong>01 Dashboard:</strong><br />\n<em>Reference: 01. Dashboard Active.png</em><br />\n- Have the search bar (no links required)<br />\n- &ldquo;Add New Request&rdquo; this should show Add Request - Step 01.png<br />\n- Navigation: Active Requests, New Response, Starred, Countries, sort (Values: Latest Response)<br />\n- Note: Those with an alert (pink dot next to name) is indicated by highlighting the row.<br />\n- Each row has additional options, shown as a &ldquo;&hellip;&rdquo; at the end of the row...make it a dead link.<br />\n- Please use placeholder for tree view.<br />\n- Please make sure the pagination works, you can repeat the contents!<br />\n<br />\n<strong>02 Add Request:</strong><br />\n<em>Reference: 19. Add Request - Step 01.png</em><br />\n- Include all the fields as shown in the screens, for the 1st section &ldquo;contacts&rdquo;, user will be able to enter the name (start typing the name) and we show suggestion based on the match &nbsp;-for now, please use the drop-down similar to 72. Assign Team (but no need the search, and assign button as shown in 72. Assign Team...just listing the users should be fine)<br />\n- After entering name, clicking on &ldquo;X&rdquo; in the field should empty the field<br />\n- &ldquo;?&rdquo; icon will will be a tool tip (make it a dead link)<br />\n- &ldquo;back&rdquo; button takes user back to 01. Dashboard Active.png<br />\n- &ldquo;Continue&rdquo; button takes user to next page 20. Add Request - Step 02.png<br />\n- &ldquo;Save as draft&rdquo; takes user to 01. Dashboard Active.png<br />\n<br />\n<strong><em>Service Description:</em></strong><br />\n<em>Reference: 20. Add Request - Step 02.png</em><br />\n- Hover over any of the service will show options to view and edit (21. hover.png)<br />\n- User will click on a row to view this page 22. Edit Description.png<br />\n- User will be able select the required service descriptions<br />\n- &ldquo;Back&rdquo; button takes user back to Add Request - Step 01.png<br />\n- &ldquo;Continue&rdquo; button takes user to next page 39. Country list.png<br />\n- &ldquo;Save as draft&rdquo; takes user to 01. Dashboard Active.png<br />\n- Clicking on &ldquo;1 project details&rdquo; should take the user to Add Request - Step 01.png<br />\n<br />\n<strong><em>Edit Description:</em></strong><br />\n- &ldquo;Back to service description&rdquo; takes user back to 20. Add Request - Step 02.png<br />\n- We would like to change the interaction of &ldquo;Editing&rdquo; a point shown in the storyboards (24. Editing.png), instead of editing a user will only be able to add or remove points (if they want to edit a point, they will remove that point and add a new point again)<br />\n- Once any edits are made (add or remove points), please show a &ldquo;Save changes&rdquo; button at the top, also the green icon changes to &ldquo;customed&rdquo; from &ldquo;default state&rdquo; as an edit has been done.<br />\n- Clicking on &ldquo;Save Changes&rdquo; shows a message &ldquo;saved&rdquo; as shown in 36. saved.png<br />\n- Clicking on &ldquo;x&rdquo; icon in each of the point will remove that point<br />\n- Clicking on &ldquo;Add Helper Text&rdquo; will show a textbox similar to how a user adds a point, similarly an &ldquo;Edit&rdquo; link is shown if the helper text has already been added.<br />\n- Clicking on &ldquo;+ add new point&rdquo; will add an empty textbox below existing point as shown in 29. tapped.png,30. adding new point.png, 31. adding new point2.png,32. new point added.png<br />\n- Show Changes toggle button should show the changes that were made to the description as shown in 33. Tapped.png, 34. Show-changes.png (note: we don&rsquo;t need to capture / show the edits that were made to individual words as shown in provided storyboard).<br />\n- Clicking on &quot;+ add new section&quot; should add a new section where a user can include, somthing similar to &quot;Applicability&quot; (in the left) and ability to add points in the right.<br />\n- User should be able to delete these section (you can see a delete icon in &quot;Applicability&quot; - clicking on which delete the entires section.<br />\n- - - Note: Those points that were removed are striked out in a color<br />\n- - - Note: Those point that were newly added are shown in blue color<br />\n<br />\n<strong><em>Country Selection:</em></strong><br />\n<em>Reference: 39. Country list.png</em><br />\n- We show list of countries as checkboxes and allow user to select it.<br />\n- Based on the number of countries chosen, we show the appropriate numbers at the bottom &ldquo;ex: 4 countries selected&rdquo;<br />\n- &ldquo;Import from excel&rdquo;: This will allow user to select excel file and initiate upload - for this prototype, just allow user to select some file and show the upload progress as shown in User will be able to 40. uploading<br />\nfile.png, once file has been uploaded show 41. uploaded.png<br />\n- &ldquo;Review Data&rdquo; button should take the user to 55. Review.png<br />\n- &ldquo;Back&rdquo; button takes user back to 20. Add Request - Step 02.png<br />\n- &ldquo;Continue&rdquo; button takes user to next page 42. Country Details.png<br />\n- &ldquo;Save as draft&rdquo; takes user to 01. Dashboard Active.png</p>\n\n<p><strong><em>Country Details:</em></strong><br />\n<em>Reference: 42. Country Details.png</em><br />\n- This shows the list of countries that were selected in the previous step!<br />\n- &ldquo;Assign CBIL&rdquo;: will show list of CBIL as shown in 43. Assign CIBL.png, user will select a person and we show this assigned view 44. CIBL Assigned.png<br />\n- &ldquo;Add Notes&rdquo;: Clicking on it will show the add notes pop-up as shown in 53. Adding notes.png<br />\n- In &ldquo;Add notes&rdquo;, user will enter the notes in text area<br />\n- - - &ldquo;Add Notes&rdquo; button to hide it (&ldquo;Add Notes&rdquo; link changes to &ldquo;Show Notes&rdquo; as shown in 54. Notes Added.png)<br />\n- - - &ldquo;Cancel&rdquo; button will just hide the &ldquo;add notes&rdquo; pop-up<br />\n- &ldquo;Show Notes&rdquo; should show a pop-up similar to &ldquo;Add notes but it will just show the text without textarea, no buttons required...clicking anywhere outside the pop-up should hide it.<br />\n- Clicking on &ldquo;Remove&rdquo; should remove the country in which they clicked remove.<br />\n- &ldquo;Back&rdquo; button takes user back to 39. Country list.png<br />\n- &ldquo;Continue&rdquo; button takes user to next page 55. Review.png<br />\n- &ldquo;Save as draft&rdquo; takes user to 01. Dashboard Active.png<br />\n<br />\n<em><strong>Review</strong></em><br />\n<em>Reference: 55. Review.png</em><br />\n- This is the last step, use the information as shown in the storyboard<br />\n- Please use placeholder for tree view.<br />\n- Selected Service type links can be dead links.<br />\n- &ldquo;Back&rdquo; button takes user back to 42. Country Details.png<br />\n- &ldquo;Continue&rdquo; takes user to 01. Dashboard Active.png<br />\n- &ldquo;Save as draft&rdquo; takes user to 01. Dashboard Active.png<br />\n<br />\n<span style=\"color:rgb(178, 34, 34)\"><strong>B CBIL</strong></span><br />\n<strong>03 CBIL Dashboard:</strong><br />\n<em>Reference: 70. CIBL Dashboard.png</em><br />\n- In the top right, we can see &ldquo;Delegate&rdquo; section that allows 2 persons to be chosen when the drop-down is clicked show a pop-up similar to 43. Assign CIBL.png but change the text &ldquo;Assign CBIL&rdquo; to &ldquo;Delegate&rdquo;...selecting a person will show that person as active selection<br />\n<br />\nArriving (6):<br />\n- Please use placeholder for tree view.<br />\n- Mouse hover on service will show &ldquo;Assign&rdquo; as an option as shown in 71. Hover.png<br />\n- Clicking on &ldquo;Assign&rdquo; will show the pop as in 72. assign team.png, user will able to search for a user and select the members for the team using the checkbox and click &ldquo;Assign Team&rdquo;<br />\n<br />\nIn Progress (8):<br />\n- Selecting a value &ldquo;Sugar Rush&rdquo; (73. tapped.png) will take the user to 74. Project Detail.png<br />\n- Please use placeholder for tree view.<br />\n- Note: In the storyboards you will find that some text are bold and some regular, make sure to follow that.<br />\n<br />\nJust Completed:<br />\n- Make &quot;View Archive&quot; a dead link<br />\n- Please use placeholder for tree view.<br />\n<br />\n<strong>04 Project Details:</strong><br />\n<em>Reference: 74. Project Detail.png</em><br />\n- &ldquo;Back to Dashboard&rdquo; should take the user to 70. CIBL Dashboard.png<br />\n- Customized Service: All links can be dead links<br />\n- Latest Activity: Pagination need to work, you can use the same content for other 2 pages.<br />\n- Please use placeholder for tree view.<br />\n<br />\n<strong><em>Service Details:</em></strong><br />\n<em>Reference: 76. Service Detail copy.png</em><br />\n- Clicking on &ldquo;customed service description&rdquo; will show 78. Service Detail.png<br />\na. Clicking on &ldquo;edit&rdquo; button will show a view as in 83. Editing.png, user will see 2 buttons on clicking this and also the fields below becomes editable in the table, clicking on<br />\nb. - - - &ldquo;save&rdquo; will change the button to &ldquo;Edit&rdquo; and need to show the done icon (green tick icon) for Indirect tax title and also in the sidebar (tree) for indirect tax - this can be seen in 84. done.png<br />\nc. - - - &ldquo;cancel&rdquo; will change the button back to &ldquo;Edit&rdquo;<br />\n- 85. Description Completed.png: Same way the process (a,b, c) is completed for all other items (Sales Gmbh, Distributor Gmbh, Manufacturing PLC, Sales PLC), once all items are complete we need to show the tick mark icon and also the message &ldquo;Data completed&rdquo; next to &ldquo;2 days&rdquo; and change the &ldquo;Incomplete&rdquo; message to &ldquo;Send to LOPT&rdquo;<br />\n- Clicking on &ldquo;Send to LOPT&rdquo;, changes the button to &ldquo;Sent&rdquo; message as shown in 87. Sent.png<br />\n<br />\n<em><strong>Service Description:</strong></em><br />\n<em>Reference: 78. Service Detail.png</em><br />\n- This is same as 20. Add Request - Step 02.png but this is a read-only view<br />\n- 79. Tracking Changes.png: User can use the toggle switch (Tracking changes) to see the changes that been done (removed points are stiked out in a color and newly added points are in bold blue color)<br />\n- Clicking on &ldquo;Back&rdquo; should take the user back to 76. Service Detail copy.png<br />\n<br />\n<span style=\"color:rgb(178, 34, 34)\"><strong>C. SPS</strong></span><br />\n<strong>05 SPS Dashboard:</strong><br />\n<em>Reference: 56. SPS Dashboard.png</em><br />\n- At the top right below header, show the delegation users&hellip;(Note: it&rsquo;s not editable like CBIL user)<br />\n<br />\nActive Project (3)<br />\n- Please use placeholder for tree view.<br />\n- User clicks on &ldquo;Sugar Rush&rdquo; to view the project details shown in 60. SPS-Project-detail.png<br />\n<br />\nIn Review (8)<br />\n- Please use placeholder for tree view.<br />\n<br />\nJust Completed<br />\n- Make Archive will be a dead link<br />\n- Please use placeholder for tree view.<br />\n<br />\n<strong>06 Project Details:</strong><br />\n<em>Reference: 60. SPS-Project-detail.png</em><br />\n- This works in the same way as 74. Project Detail.png, but user does not complete all the items.<br />\n- In this example, they will just complete the &ldquo;Direct Tax&rdquo; under Manufacturing PLC..user clicks on &ldquo;Direct Tax&rdquo; under that and sees this view 62. Direct Tax-Detail.png<br />\n- User taps on &ldquo;customed service description&rdquo; to see 64. Direct tax - detail.png and user will use the tracking changes toggle switch to 65. Direct tax - with tracking.png<br />\n- Clicking &ldquo;Back&rdquo; in 64. Direct tax - detail.png will take them back to 66. Direct tax - back.png<br />\n<br />\n<em>Requested Level:</em><br />\na. Clicking on &ldquo;edit&rdquo; button will show a view as in 68. Direct Tax-Edit.png, user will see 2 buttons on clicking this and also the fields below becomes editable in the table, clicking on<br />\nb. - - - &ldquo;save&rdquo; will change the button to &ldquo;Edit&rdquo; and need to show the done icon (green tick icon) for Indirect tax title and also in the sidebar (tree) for indirect tax - this can be seen in 69. Direct Tax-done.png<br />\nc. - - - &ldquo;cancel&rdquo; will change the button back to &ldquo;Edit&rdquo;<br />\n<br />\n<span style=\"color:rgb(178, 34, 34)\"><strong>D APT:</strong></span><br />\n<strong>07 APT Dashboard:</strong><br />\n<em>Reference: 88. APT-List view.png</em><br />\n- Map View Tab: On click goes to 89. APT-Map View.png<br />\n- Escalated Requests (2) can be a dead link for now<br />\n- &ldquo;Add New Request&rdquo; will have the same flow like &ldquo;02 Add Request&rdquo;<br />\n- Please use placeholder for tree view.<br />\n<br />\n<em><strong>Map View:</strong></em><br />\n<em>Reference: 89. APT-Map View.png</em><br />\n- List View Tab: On click goes to 88. APT-List view.png<br />\n- Checkboxes within the map needs to work, selecting &ldquo;New&rdquo; should show all green items in map and selecting &ldquo;In progress&rdquo; should show all the yellow items in map<br />\n<br />\n<span style=\"color:rgb(255, 0, 0)\"><strong>Client Priorities (The items that are considered highest prototype priorities)</strong></span><br />\n- Code Documentation<br />\n- Creating quality and efficient HTML/CSS3 code that works in all the requested browsers.<br />\n- All elements should be consistent, pay attention to padding, margin, line-height, etc.<br />\n- Matching the storyboards (as close as possible) across the required browsers.<br />\n<br />\n<span style=\"color:rgb(0, 0, 255)\"><strong>Specific HTML/CSS/JavaScript Requirements</strong></span><br />\n<strong>HTML/HTML5</strong><br />\n- Provide comments on the page elements to give clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts or errors.<br />\n-&nbsp;Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Use semantically correct tags- use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- No inline CSS styles- all styles must be placed in an external stylesheet.<br />\n- Validate your code- reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n<br />\n<strong>CSS/SCSS</strong><br />\n- Provide comments on the CSS code. We need CSS comments to give a clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all CSS so developers can follow the code.<br />\n- All CSS naming should not have any conflicts.<br />\n- As possible use CSS3 style when creating all styling.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to lay out your page. Only use table tags for tables of data/information and not for page layout.<br />\n<br />\n<strong>Javascript</strong><br />\n- Please use Angular 2 and following best practice i.e. John Papa&#39;s guidelines where possible.&nbsp;<br />\n-&nbsp;All JavaScript must not have a copyright by a third party.<br />\n- You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n<br />\n<strong>Images</strong><br />\n- Images should be properly compressed while still having good visual quality.<br />\n- Please use best practice repetition usage of background based image.<br />\n- Please use sprites when using icons for your submission (not applicable for members using angular 2)<br />\n<br />\n<span style=\"color:rgb(0, 0, 255)\"><strong>Device Requirements:</strong></span><br />\n- Latest Chrome, Safari, Opera, Firefox, IE11+<br />\n<br />\n<span style=\"color:rgb(0, 0, 255)\"><strong>Provided Assets:</strong></span><br />\n- Storyboard and Screenshots are provided in challenge forums.<br />\n- Invision Link to the prototype (please see in forums)</p>\n",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30056026",
  "event": {
    "id": 3447,
    "description": "2017 TopCoder(R) Open",
    "shortDescription": "tco17"
  },
  "finalFixEndDate": "2017-01-05T16:13:00.000Z",
  "finalSubmissionGuidelines": "<p><span style=\"color:rgb(255, 0, 0)\"><strong>Submission Deliverables:</strong></span><br />\n- A complete list of deliverables can be viewed in the<a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\">&nbsp;UI Prototype Competitions Tutorial</a>.<br />\n<br />\n<span style=\"color:rgb(255, 0, 0)\"><strong>Final Submission:</strong></span><br />\n- For each member, the final submission should be uploaded to the<a href=\"http://software.topcoder.com/review\">&nbsp;Online Review Tool</a></p>\n",
  "forumId": 34804,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=34804",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 37,
  "numberOfSubmissions": 3,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-12-24T10:39:00.000Z",
      "actualStartTime": "2016-12-24T10:39:00.000Z",
      "scheduledEndTime": "2016-12-24T10:41:00.000Z",
      "actualendTime": "2016-12-24T10:41:00.000Z",
      "_id": "58753b5890ca64469c7c9de4"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-12-24T10:41:00.000Z",
      "actualStartTime": "2016-12-24T10:41:00.000Z",
      "scheduledEndTime": "2016-12-24T11:41:00.000Z",
      "actualendTime": "2016-12-24T11:41:00.000Z",
      "_id": "58753b5890ca64469c7c9de3"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-12-24T13:08:00.000Z",
      "actualStartTime": "2016-12-24T13:08:00.000Z",
      "scheduledEndTime": "2016-12-27T13:08:00.000Z",
      "actualendTime": "2016-12-27T13:08:00.000Z",
      "_id": "58753b5890ca64469c7c9de2"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-12-24T13:13:00.000Z",
      "actualStartTime": "2016-12-24T13:13:00.000Z",
      "scheduledEndTime": "2016-12-30T13:13:00.000Z",
      "actualendTime": "2016-12-30T13:13:00.000Z",
      "_id": "58753b5890ca64469c7c9de1"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2016-12-30T13:13:00.000Z",
      "actualStartTime": "2016-12-30T13:13:00.000Z",
      "scheduledEndTime": "2016-12-30T20:57:00.000Z",
      "actualendTime": "2016-12-30T20:57:00.000Z",
      "_id": "58753b5890ca64469c7c9de0"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-12-30T20:57:00.000Z",
      "actualStartTime": "2016-12-30T20:57:00.000Z",
      "scheduledEndTime": "2017-01-03T15:31:00.000Z",
      "actualendTime": "2017-01-03T15:31:00.000Z",
      "_id": "58753b5890ca64469c7c9ddf"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2017-01-03T15:31:00.000Z",
      "actualStartTime": "2017-01-03T15:31:00.000Z",
      "scheduledEndTime": "2017-01-04T15:32:00.000Z",
      "actualendTime": "2017-01-04T15:32:00.000Z",
      "_id": "58753b5890ca64469c7c9dde"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2017-01-04T15:32:00.000Z",
      "actualStartTime": "2017-01-04T15:32:00.000Z",
      "scheduledEndTime": "2017-01-04T17:36:00.000Z",
      "actualendTime": "2017-01-04T17:36:00.000Z",
      "_id": "58753b5890ca64469c7c9ddd"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2017-01-04T17:36:00.000Z",
      "actualStartTime": "2017-01-04T17:36:00.000Z",
      "scheduledEndTime": "2017-01-04T17:40:00.000Z",
      "actualendTime": "2017-01-04T17:40:00.000Z",
      "_id": "58753b5890ca64469c7c9ddc"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2017-01-04T17:40:00.000Z",
      "actualStartTime": "2017-01-04T17:40:00.000Z",
      "scheduledEndTime": "2017-01-05T16:13:00.000Z",
      "actualendTime": "2017-01-05T16:13:00.000Z",
      "_id": "58753b5890ca64469c7c9ddb"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2017-01-05T16:13:00.000Z",
      "actualStartTime": "2017-01-05T16:13:00.000Z",
      "scheduledEndTime": "2017-01-05T19:46:00.000Z",
      "actualendTime": "2017-01-05T19:46:00.000Z",
      "_id": "58753b5890ca64469c7c9dda"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2017-01-05T19:46:00.000Z",
      "actualStartTime": "2017-01-05T19:46:00.000Z",
      "scheduledEndTime": "2017-01-10T19:47:00.000Z",
      "actualendTime": "2017-01-10T19:47:00.000Z",
      "_id": "58753b5890ca64469c7c9dd9"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-12-24T13:08:00.000Z",
  "prize": [
    1800,
    900
  ],
  "projectId": 11029,
  "registrants": [
    {
      "handle": "nomo_kazza",
      "reliability": "86%",
      "registrationDate": "2016-12-24T13:46:00.000Z",
      "submissionDate": null,
      "rating": "1563",
      "colorStyle": "color: #DDCC00",
      "_id": "58753b5890ca64469c7c9dd8"
    },
    {
      "handle": "dwij",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T15:21:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dd7"
    },
    {
      "handle": "johnhawnk",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T00:08:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dd6"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T06:51:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dd5"
    },
    {
      "handle": "Savvas_cl",
      "reliability": "20%",
      "registrationDate": "2016-12-24T15:46:00.000Z",
      "submissionDate": null,
      "rating": "738",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dd4"
    },
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2016-12-24T13:23:00.000Z",
      "submissionDate": "2016-12-30T12:19:00.000Z",
      "rating": "2258",
      "colorStyle": "color: #EE0000",
      "_id": "58753b5890ca64469c7c9dd3"
    },
    {
      "handle": "anosama",
      "reliability": "50%",
      "registrationDate": "2016-12-24T14:00:00.000Z",
      "submissionDate": "2016-12-30T13:04:00.000Z",
      "rating": "966",
      "colorStyle": "color: #00A900",
      "_id": "58753b5890ca64469c7c9dd2"
    },
    {
      "handle": "rajrkrish",
      "reliability": "26%",
      "registrationDate": "2016-12-24T14:13:00.000Z",
      "submissionDate": null,
      "rating": "1506",
      "colorStyle": "color: #DDCC00",
      "_id": "58753b5890ca64469c7c9dd1"
    },
    {
      "handle": "csy2012",
      "reliability": "n/a",
      "registrationDate": "2016-12-24T16:30:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dd0"
    },
    {
      "handle": "DawnB",
      "reliability": "n/a",
      "registrationDate": "2016-12-24T17:02:00.000Z",
      "submissionDate": null,
      "rating": "321",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dcf"
    },
    {
      "handle": "Sky_",
      "reliability": "6%",
      "registrationDate": "2016-12-24T17:25:00.000Z",
      "submissionDate": null,
      "rating": "1735",
      "colorStyle": "color: #DDCC00",
      "_id": "58753b5890ca64469c7c9dce"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-12-24T18:02:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dcd"
    },
    {
      "handle": "serunkuma",
      "reliability": "n/a",
      "registrationDate": "2016-12-24T18:37:00.000Z",
      "submissionDate": null,
      "rating": "229",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dcc"
    },
    {
      "handle": "diogenesjcs",
      "reliability": "0%",
      "registrationDate": "2016-12-25T00:32:00.000Z",
      "submissionDate": null,
      "rating": "973",
      "colorStyle": "color: #00A900",
      "_id": "58753b5890ca64469c7c9dcb"
    },
    {
      "handle": "h_n_y",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T02:25:00.000Z",
      "submissionDate": null,
      "rating": "626",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dca"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T08:31:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dc9"
    },
    {
      "handle": "Colinh84",
      "reliability": "0%",
      "registrationDate": "2016-12-25T09:32:00.000Z",
      "submissionDate": null,
      "rating": "1672",
      "colorStyle": "color: #DDCC00",
      "_id": "58753b5890ca64469c7c9dc8"
    },
    {
      "handle": "moagi.anela",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T16:32:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dc7"
    },
    {
      "handle": "chris438",
      "reliability": "n/a",
      "registrationDate": "2016-12-25T18:45:00.000Z",
      "submissionDate": null,
      "rating": "547",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dc6"
    },
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2016-12-26T02:51:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "58753b5890ca64469c7c9dc5"
    },
    {
      "handle": "penpo",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T19:21:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dc4"
    },
    {
      "handle": "cam.ashwini",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T04:45:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dc3"
    },
    {
      "handle": "venkatlingala",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T04:55:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dc2"
    },
    {
      "handle": "wwxyxgy",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T05:01:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dc1"
    },
    {
      "handle": "fish00",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T11:32:00.000Z",
      "submissionDate": null,
      "rating": "446",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dc0"
    },
    {
      "handle": "mohhasbias",
      "reliability": "6%",
      "registrationDate": "2016-12-26T11:53:00.000Z",
      "submissionDate": "2016-12-30T12:38:00.000Z",
      "rating": "538",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dbf"
    },
    {
      "handle": "mhykol",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T13:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dbe"
    },
    {
      "handle": "republic82",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T16:59:00.000Z",
      "submissionDate": null,
      "rating": "476",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9dbd"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-12-26T17:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dbc"
    },
    {
      "handle": "Yurii",
      "reliability": "n/a",
      "registrationDate": "2016-12-27T00:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dbb"
    },
    {
      "handle": "Taquion",
      "reliability": "n/a",
      "registrationDate": "2016-12-27T02:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9dba"
    },
    {
      "handle": "glint",
      "reliability": "20%",
      "registrationDate": "2016-12-27T09:58:00.000Z",
      "submissionDate": null,
      "rating": "1269",
      "colorStyle": "color: #6666FF",
      "_id": "58753b5890ca64469c7c9db9"
    },
    {
      "handle": "Gando19850304",
      "reliability": "0%",
      "registrationDate": "2016-12-27T05:46:00.000Z",
      "submissionDate": null,
      "rating": "989",
      "colorStyle": "color: #00A900",
      "_id": "58753b5890ca64469c7c9db8"
    },
    {
      "handle": "nascent.",
      "reliability": "n/a",
      "registrationDate": "2016-12-27T06:36:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9db7"
    },
    {
      "handle": "013ayush",
      "reliability": "n/a",
      "registrationDate": "2016-12-27T07:01:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9db6"
    },
    {
      "handle": "btgd88",
      "reliability": "n/a",
      "registrationDate": "2016-12-27T09:40:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58753b5890ca64469c7c9db5"
    },
    {
      "handle": "poundinc_tc",
      "reliability": "n/a",
      "registrationDate": "2016-12-27T11:49:00.000Z",
      "submissionDate": null,
      "rating": "154",
      "colorStyle": "color: #999999",
      "_id": "58753b5890ca64469c7c9db4"
    }
  ],
  "registrationEndDate": "2016-12-27T13:08:00.000Z",
  "reliabilityBonus": 360,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2016-12-30T13:13:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 86.33,
      "finalScore": 84.83,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-12-30T12:19:00.000Z",
      "_id": "58753b5890ca64469c7c9de7"
    },
    {
      "handle": "anosama",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 77.5,
      "finalScore": 77,
      "points": 0,
      "submissionStatus": "Completed Without Win",
      "submissionDate": "2016-12-30T13:04:00.000Z",
      "_id": "58753b5890ca64469c7c9de6"
    },
    {
      "handle": "mohhasbias",
      "placement": 3,
      "screeningScore": 100,
      "initialScore": 23.5,
      "finalScore": 23.5,
      "points": 0,
      "submissionStatus": "Failed Review",
      "submissionDate": "2016-12-30T12:38:00.000Z",
      "_id": "58753b5890ca64469c7c9de5"
    }
  ],
  "technology": [
    "Angular.js",
    "CSS",
    "HTML5",
    "JavaScript"
  ]
}