{
  "_id": 30052900,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:33:02.570Z",
  "appealsEndDate": "2016-02-22T06:49:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Styx OnGuard Integration Application UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "<p>Welcome to <strong>Styx OnGuard Integration Application UI Prototype Challenge</strong></p>\n\n<p>The primary task of this challenge needs to create the Styx OnGuard Integration Application UI Prototype based on provided wireframe layout and function. At the same time, you must follow provided .ai Illustrator file to guide you of our expected User Interface and User Experience Design.</p>\n\n<p>The result of this prototype need use responsive solution for desktop only.</p>\n",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30052900",
  "event": {
    "id": 3446,
    "description": "2016 TopCoder(R) Open",
    "shortDescription": "tco16"
  },
  "finalFixEndDate": "2016-02-27T07:21:00.000Z",
  "finalSubmissionGuidelines": "<p><strong>Downloadable Files</strong><br />\nOG_logo.zip - OnGuard Logo<br />\ntruPortal-logo.zip - truPortal Logo<br />\nUI-UX-Guidelines.zip - UI/UX Guidelines<br />\nstyx_og_integration_wf.zip -&nbsp; Styx OnGuard Integration Application Wireframe<br />\nonguard-full-prototype.zip - UI Prototype as Reference (DO NOT USE this prototype as base of you submission. We need new clean set of HTML/CSS/JS)</p>\n\n<p><strong>Important:</strong><br />\n- As possible we need all pages on this prototype linked each other.&nbsp; Please check how wireframe works.<br />\n- Use Roboto Fonts on your UI Prototype submission. Download font from here: <a href=\"https://www.google.com/fonts/specimen/Roboto\">https://www.google.com/fonts/specimen/Roboto &nbsp;</a><br />\n- For each screen explained below we need you build prototype by following wireframe layout and at the same time apply design theme based on provided UI/UX Guidelines<br />\n- Do not create custom styling, as possible we need you stick with Client UX/UI Guidelines. There are some separated files of UX/UI Guidelines; please review and check around the file content.<br />\n- Let&#39;s discuss if you need confirmation of any doubts of this challenge.<br />\n- Create responsive prototype that supports minimum 1024px width and use fluid solution on wider screen<br />\n- For all tasks explained below, you always need to follow the provided Styx OnGuard Integration Application Wireframe for required layout and functions.</p>\n\n<p><strong>1. Login</strong><br />\nUI/UX Guideline: Login Page Reference - Storyboard_SC.pdf</p>\n\n<p>- This screen is login page look and feel<br />\n- For your prototype, no need display the gray bar on the header. You just show Login box that vertically and horizontally centered on a browser screen.<br />\n- Page background color should be #f1f1f2<br />\n- truPortal and OnGuard Logo placed on top of Login box. Use the provided logo.<br />\n- Match style for text input and dropdown&nbsp;&nbsp; &nbsp;<br />\n- Login button by default is disabled and use gray color.<br />\n- After filled both text input and select dropdown, Login button becomes enable and then turn into blue color<br />\n- Match styling for text input and dropdown styling<br />\n- For drop-down menu option, follow this design styling (Confirmation Modal - Storyboard_UMM_delRole.pdf)<br />\n- Login success takes user to Panel page<br />\n- Create separated Login pages to show these following error scenarios:</p>\n\n<p>Error - Choose Directory<br />\n- When user does not select a directory, &ldquo;choose a directory&rdquo; error appears</p>\n\n<p>Error - Invalid Credentials<br />\n- When user does not enter valid credentials (either username or password), &ldquo;Login failed&rdquo; error appears</p>\n\n<p>Error - Network Down<br />\n- When user attempts to log in, but network is not available, &ldquo;Login failed&rdquo; error appears</p>\n\n<p><strong>2. Panel Page</strong><br />\n- This Panel page shows up after user logged in<br />\n- Panel page divided into these sections:</p>\n\n<p>Left Navigation<br />\n- Left Navigation consists of these menus:<br />\n-- tP Panels<br />\n-- Assign Access<br />\n-- Change Access<br />\n-- Integrate Events<br />\n- Please re-use icons from Breadcrumbs Storyboard_APM_exemption.ai. We will swap with the correct graphic in the future updates.<br />\n- Blue background row is style for active menu<br />\n- Configuration and Collapse menu buttons always displayed at the bottom of screen<br />\n- Configuration can be a dead link<br />\n- Click collapse button need collapse the left navigation to show the icons without the label title.<br />\n- Please check this file for how to collapse and expand works: Example of open, closed left nav - Storyboard_UMM.pdf &gt; page 24 &amp; 25</p>\n\n<p>Header bar<br />\n- Header bar needs use fluid width<br />\n- Header bar needs to be in fixed placement when user is scrolling the page content.<br />\n- &ldquo;Integration Application&rdquo; title display on the left side of header bar<br />\n- Jhon Smith is a drop-down menu<br />\n- Click the username and arrow need show the Logout option. Refer this file: Lef NavStoryboard_APM.pdf &gt; page 20<br />\n- Click Logout button take user back to Login page<br />\n- Notification icons need show the list of Notification, re-use styling from the username dropdown<br />\n- On the right side, there&#39;s full-screen button. Click this button makes the page use full-screen mode.<br />\n- On full-screen mode, you need to hide the header bar and left navigation bar<br />\n- Then, the full-screen icon changed, refer to this file: Lef NavStoryboard_APM.pdf &gt; page 22 &amp; page 23</p>\n\n<p>Content area<br />\n- Content bar needs use fluid width</p>\n\n<p><strong>a. Panel - Empty &nbsp;</strong><br />\n- This page will show empty message until new panel added or imported<br />\n- For this screen, you need show &quot;0 of 0&quot; message next to the page title<br />\n- Search filter need works like provided UI/UX-Guideline: search-components.pdf<br />\n- Click the zoom icon and arrow need display drop-down option<br />\n- For the placement and sizing, please follow this&nbsp; UI/UX-Guideline: search-placement&amp;sizing.pdf<br />\n- Match checkboxes, and scrollbar styling<br />\n- User can type in the Search text input<br />\n- Add and Import buttons placed on the right side<br />\n- Click Add button need add the new row on tP Panels table and show up a panel on the right side of the table. More information explained below<br />\n- Click Import button need show modal Import Panel Modal Windows. More information explained below.</p>\n\n<p><strong>b. Panel - List</strong><br />\n- This screen shows how tP Panels look with complete table view<br />\n- Next to panel title, there&#39;re numbers of data, and then search and filter<br />\n- Quick Actions dropdown show up before Add button<br />\n- Re-use consistent styling for the Actions button. Refer this document: Confirmation Modal - Storyboard_UMM_delRole.pdf &gt; page 1<br />\n- Match data on table<br />\n- Notice on the table header, you need to sort display arrow and underlined text<br />\n- Create sort function for table header with arrow icon. Make sure you apply for other table in another pages.<br />\n- In the right side of table, there&#39;s icons for Assign Access and Validate Connection<br />\n- Create tooltips for icons. Refer to this document: Breadcrumbs Storyboard_APM_exemption.pdf &gt; page 1<br />\n- Click Assign Access icon need show up the modal window. Explained more details below<br />\n- Click Validate Connection icon need show up the modal window. Explained more details below<br />\n- Match styling for selected row like existing UI/UX Guidelines</p>\n\n<p><strong>c. Panel - Add</strong><br />\n- User clicks Add button on Panel list to show the new Panel on the right side<br />\n- All forms are text inputs and password in the bottom<br />\n- Match form styling like existing UI/UX Guidelines<br />\n- The table width reduced when New Panel show up on the right side<br />\n- Match form content like existing wireframe<br />\n- By default Save button use gray colored style. While on this state, click the Save button need show up the Incomplete data modal window<br />\n- For every modal window on the page, use transparent gray background.<br />\n- Click Ok need to hide the modal<br />\n- After filling all form, Save button turn to blue colored style<br />\n- Click the Save button again need show connection failed modal window<br />\n- Click Cancel and Try again button need hide the modal window.<br />\n- Then re-click the Save button need show the success modal window.<br />\n- Add Another and Done buttons need to close the panel and show up the table list<br />\n- Click X button need close the New Panel area<br />\n- While user open the New Panel area, navigate to another rows in the left side need show up the <span>Unsaved changes modal window</span></p>\n\n<p><strong>d. Panel - Edit</strong><br />\n- When user click each row on Panel List, they will automatically see Edit Panel on the right side<br />\n- Display current values for each text inputs<br />\n- Save button use blue colored background<br />\n- Click save button need show the failed modal window first then after that re-click the save button need to show the success message<br />\n- X button needs hide the modal window<br />\n- While user open the New Panel area, navigate to another rows in the left side need show up the <span>Unsaved changes modal window</span></p>\n\n<p><strong>e. Panel - Import</strong><br />\n- Replace the placeholder with standard file upload field.<br />\n- Cancel button needs to hide the modal window<br />\n- Click Import button need display the Import Failed, then click the Import button again need show the success message</p>\n\n<p><strong>f. Panel - Retrieve Events</strong><br />\n- This screen displays as modal windows<br />\n- On progressing, click Cancel button need close the modal and display the table list<br />\n- After progress completed you need show another modal window that informs user Events retrieved successfully<br />\n- Click Ok button need show the Panel List</p>\n\n<p><strong>g. Panel - Assign Access</strong><br />\n- Click Assign Acces icon need show up the modal window<br />\n- Re-use existing layout and functions like existing UI/UX Guideline: Storyboard_APM_exemption.pdf<br />\n- Re-use the icons from the Storyboard_APM_exemption.pdf<br />\n- Search and filter displayed below the Panel title<br />\n- Assign Access contains these three steps:</p>\n\n<p>Step 1: Select User Badge<br />\n- For this step, there&#39;s table content on the left side and panel on the right side<br />\n- No selected row&nbsp; and no panel show on page load<br />\n- Styling and function on this step need works like this screen: Confirmation Modal - Storyboard_UMM_delRole.pdf<br />\n- On the right panel, there&#39;s Profile and Badge row with expand/collapse function by click the arrow<br />\n- Make sure you create consistent styling.<br />\n- User need selected the Badge before click the Next button<br />\n- Next button takes user to next Step 2<br />\n- Cancel button needs to close the modal</p>\n\n<p>Step 2: Select Access Level<br />\n- Each row on table need collapsed by default<br />\n- Notice there&#39;s checkboxes on 1st column. Follow styling from existing UI/UX Guideline<br />\n- When to expand the row, there&#39;s tab content for Readers and Floors<br />\n- Follow active and inactive tab styling from Example of open closed left nav - Storyboard_UMM.pdf &gt; page 24 &amp; page 25<br />\n- Readers Tab: This tab will contain all Reader Name<br />\n- User can expand each row<br />\n- Each row consists of these sub-tab:<br />\n- Intervals Sub-Tab: This interval contains rows of hours interval<br />\n- You need to display active and inactive days with black and gray colored text<br />\n- Holiday Group Sub-Tab: This Holiday contains rows of&nbsp; holiday groups<br />\n- Floors Tabs: will be a list of Floors<br />\n- Match content for both Readers and Floors tab<br />\n- Cancel button needs to close the modal<br />\n- The previous button takes user to next Step 1<br />\n- Next button takes user to next Step 3</p>\n\n<p>Step 3: Set Expiration<br />\n- Function and layout for this step need works similar like Step 1<br />\n- This step divided by 2 column for Access Level and Expiration panel<br />\n- Expiration Panel only show up when user select the Access level row.<br />\n- Expiration panel, need display Start Date and End Date<br />\n- Click both dates need show up the date-picker<br />\n- Re-use datepicker from existing prototype (onguard-full-prototype.zip)<br />\n- Assign button need display the Record added modal window and took user back to Panel List</p>\n\n<p><strong>h. Panel - Validate Connection</strong><br />\n- This screen displays as modal windows<br />\n- On progressing, click Cancel button need close the modal and display the table list<br />\n- After progress completed you need show another modal window that informs user Connection validated successfully<br />\n- Click Ok button need show the Panel List</p>\n\n<p><strong>3. Assign Access</strong><br />\n- Show active state for Assign Access menu<br />\n- Search and filter show up next to the title<br />\n- You need display table list below the search and filter<br />\n- Match Assign Access table information<br />\n- Click each row need display the Assign Access Panel<br />\n- You can re-use Panel styling from Lef NavStoryboard_APM.pdf &gt; page 5 &amp; 6<br />\n- There are two expandable sections of Profile and Badges<br />\n- For Profile section, image needs to be placed on the right side<br />\n- All Profile information need to be divided into two columns layout<br />\n- Badges section, display search and filter below the title</p>\n\n<p>Assign Access - Choose User<br />\n- Here&#39;s the flow to Assign Access - Choose User<br />\n- Assign Access need to disable before select the Badge row<br />\n- Click the badge need show the error information modal window<br />\n- Each row of Badge table is selectable<br />\n- Selected row using yellow background, then Assign Access button become enable<br />\n- Click the Assign Access button need show up the Progress Step Modal Window<br />\n- For Progress Step icons, please re-use icons from Breadcrumbs Storyboard_APM_exemption.pdf &gt; page 2 (We will swap icons in the future updates)</p>\n\n<p>Step 1: Select Panel &amp; Levels<br />\n- For this step, there is a table information<br />\n- On 1st column, display the checkboxes<br />\n- User only able to select 1 row only<br />\n- After 1 row selected, other checkboxes on another rows need to be disable<br />\n- Each row needs able to expand and collapse<br />\n- On sub-row, another table needs display checkboxes and arrow toggle<br />\n- Checked on the checkboxes on sub row need auto select the checkboxes on parent row. Then, disable the other rows<br />\n- Also, each row need display the Readers and Floors tab<br />\n- Match content for the sub-tabs<br />\n- Cancel button needs to close the modal<br />\n- Next button takes user to next Step 2</p>\n\n<p>Step 2: Set Expirations<br />\n- This step divided by 2 column for Access Level and Expiration<br />\n- Access Level display list of information<br />\n- Expiration column, need display Start Date and End Date<br />\n- Click both dates need show up the date-picker<br />\n- Assign button need display the Record added modal window and took user back to Assign Access page<br />\n- Back button takes user to the previous step<br />\n- Cancel button needs to close the modal<br />\n- Assign button need display the Record added modal window and took user back to Panel List</p>\n\n<p><strong>4. Change Access</strong><br />\n- Table same like Assign Access<br />\n- When to click each row, under Badges button text is Change Access<br />\n- Click the button need display the modal window<br />\n- For this Change Access flow, on Step 1 after selecting the Panel name, you need to display new modal window for No Assignment message, click Select another button need take back to Step 1<br />\n- on Step 2, there&#39;s another Delete button<br />\n- Click the Delete button need show Delete confirmation modal window<br />\n- Click the Update button need show the Successfully updated message<br />\n- Ok button needs close modal window and take user back to change access<br />\n- Match the differences based on wireframe content</p>\n\n<p><strong>5. Integrate Events</strong><br />\n- This is Integrate Events page<br />\n- On the right side search and filter, there&#39;s quick action buttons for Enable, Disabled, and Set Severity<br />\n- Click each option need to show up related modal window<br />\n- Follow checkboxes logic based on this file: search-checkboxfunctionality.pdf<br />\n- Follow how disabled and enable rows to look on this file: Example of open closed left nav - Storyboard_UMM.pdf<br />\n- Disable rows need to add new column for disabling icon and text for disabling rows need to be gray colored<br />\n- Click each row need show up panel details on the right side<br />\n- Each row in panel details needs able to expand/collapse<br />\n- Save button need take user Integrate Events list</p>\n\n<p><strong>Client Priorities</strong><br />\n- Creating quality and efficient HTML/CSS3 code that works in all the requested browsers.<br />\n- All elements should be Consistent, pay attention to padding, margin, line-height, etc.<br />\n- Matching the storyboards (as close as possible) across the required browsers.<br />\n- Documentation of your prototype<br />\n<br />\n<strong>CODE REQUIREMENTS:<br />\nHTML5</strong><br />\n- Provide comments on the page elements to give the clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts or errors.</p>\n\n<p><strong>CSS3</strong><br />\n- Provide comments on the CSS code. We need CSS comments to give a clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all CSS so developers can follow the code.<br />\n- All CSS naming should not have any conflicts.<br />\n- As possible use CSS3 style when to create all styling.</p>\n\n<p><strong>JAVASCRIPT</strong><br />\n- All JavaScript must not have a copyright by a third party.<br />\n- You are encouraged to use your scripts or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.</p>\n\n<p><strong>IMAGES</strong><br />\n- Images must compress while still having good visual quality.<br />\n- Please use best practice repetition usage of background based image.<br />\n- Please use sprites when using icons for your submission.</p>\n\n<p><strong>Web Browsers Requirements</strong><br />\n- IE10+<br />\n- Firefox latest version<br />\n- Safari latest version<br />\n- Chrome latest version</p>\n",
  "forumId": 31901,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=31901",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 29,
  "numberOfSubmissions": 2,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-02-11T13:23:00.000Z",
      "actualStartTime": "2016-02-11T13:23:00.000Z",
      "scheduledEndTime": "2016-02-11T13:23:00.000Z",
      "actualendTime": "2016-02-11T13:23:00.000Z",
      "_id": "5813295e550dfb3b52b64778"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-11T13:23:00.000Z",
      "actualStartTime": "2016-02-11T13:23:00.000Z",
      "scheduledEndTime": "2016-02-11T17:08:00.000Z",
      "actualendTime": "2016-02-11T17:08:00.000Z",
      "_id": "5813295e550dfb3b52b64777"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-02-11T17:08:00.000Z",
      "actualStartTime": "2016-02-11T17:08:00.000Z",
      "scheduledEndTime": "2016-02-13T17:08:00.000Z",
      "actualendTime": "2016-02-13T17:08:00.000Z",
      "_id": "5813295e550dfb3b52b64776"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-02-11T17:13:00.000Z",
      "actualStartTime": "2016-02-11T17:13:00.000Z",
      "scheduledEndTime": "2016-02-18T17:06:00.000Z",
      "actualendTime": "2016-02-18T17:06:00.000Z",
      "_id": "5813295e550dfb3b52b64775"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2016-02-18T17:06:00.000Z",
      "actualStartTime": "2016-02-18T17:06:00.000Z",
      "scheduledEndTime": "2016-02-18T22:13:00.000Z",
      "actualendTime": "2016-02-18T22:13:00.000Z",
      "_id": "5813295e550dfb3b52b64774"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-18T22:13:00.000Z",
      "actualStartTime": "2016-02-18T22:13:00.000Z",
      "scheduledEndTime": "2016-02-20T21:09:00.000Z",
      "actualendTime": "2016-02-20T21:09:00.000Z",
      "_id": "5813295e550dfb3b52b64773"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2016-02-20T21:09:00.000Z",
      "actualStartTime": "2016-02-20T21:09:00.000Z",
      "scheduledEndTime": "2016-02-21T21:09:00.000Z",
      "actualendTime": "2016-02-21T21:09:00.000Z",
      "_id": "5813295e550dfb3b52b64772"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2016-02-21T21:09:00.000Z",
      "actualStartTime": "2016-02-21T21:09:00.000Z",
      "scheduledEndTime": "2016-02-22T06:49:00.000Z",
      "actualendTime": "2016-02-22T06:49:00.000Z",
      "_id": "5813295e550dfb3b52b64771"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2016-02-22T06:49:00.000Z",
      "actualStartTime": "2016-02-22T06:49:00.000Z",
      "scheduledEndTime": "2016-02-22T11:50:00.000Z",
      "actualendTime": "2016-02-22T11:50:00.000Z",
      "_id": "5813295e550dfb3b52b64770"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-02-22T11:50:00.000Z",
      "actualStartTime": "2016-02-22T11:50:00.000Z",
      "scheduledEndTime": "2016-02-23T10:10:00.000Z",
      "actualendTime": "2016-02-23T10:10:00.000Z",
      "_id": "5813295e550dfb3b52b6476f"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-23T10:10:00.000Z",
      "actualStartTime": "2016-02-23T10:10:00.000Z",
      "scheduledEndTime": "2016-02-23T16:07:00.000Z",
      "actualendTime": "2016-02-23T16:07:00.000Z",
      "_id": "5813295e550dfb3b52b6476e"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-02-25T14:33:00.000Z",
      "actualStartTime": "2016-02-25T14:33:00.000Z",
      "scheduledEndTime": "2016-02-26T05:08:00.000Z",
      "actualendTime": "2016-02-26T05:08:00.000Z",
      "_id": "5813295e550dfb3b52b6476d"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-02-23T16:07:00.000Z",
      "actualStartTime": "2016-02-23T16:07:00.000Z",
      "scheduledEndTime": "2016-02-24T12:53:00.000Z",
      "actualendTime": "2016-02-24T12:53:00.000Z",
      "_id": "5813295e550dfb3b52b6476c"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-24T12:53:00.000Z",
      "actualStartTime": "2016-02-24T12:53:00.000Z",
      "scheduledEndTime": "2016-02-24T21:36:00.000Z",
      "actualendTime": "2016-02-24T21:36:00.000Z",
      "_id": "5813295e550dfb3b52b6476b"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-02-24T21:36:00.000Z",
      "actualStartTime": "2016-02-24T21:36:00.000Z",
      "scheduledEndTime": "2016-02-25T09:57:00.000Z",
      "actualendTime": "2016-02-25T09:57:00.000Z",
      "_id": "5813295e550dfb3b52b6476a"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-25T09:57:00.000Z",
      "actualStartTime": "2016-02-25T09:57:00.000Z",
      "scheduledEndTime": "2016-02-25T14:33:00.000Z",
      "actualendTime": "2016-02-25T14:33:00.000Z",
      "_id": "5813295e550dfb3b52b64769"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-02-26T05:08:00.000Z",
      "actualStartTime": "2016-02-26T05:08:00.000Z",
      "scheduledEndTime": "2016-02-26T15:12:00.000Z",
      "actualendTime": "2016-02-26T15:12:00.000Z",
      "_id": "5813295e550dfb3b52b64768"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-26T15:12:00.000Z",
      "actualStartTime": "2016-02-26T15:12:00.000Z",
      "scheduledEndTime": "2016-02-27T01:08:00.000Z",
      "actualendTime": "2016-02-27T01:08:00.000Z",
      "_id": "5813295e550dfb3b52b64767"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-02-27T01:08:00.000Z",
      "actualStartTime": "2016-02-27T01:08:00.000Z",
      "scheduledEndTime": "2016-02-27T04:00:00.000Z",
      "actualendTime": "2016-02-27T04:00:00.000Z",
      "_id": "5813295e550dfb3b52b64766"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-02-27T04:01:00.000Z",
      "actualStartTime": "2016-02-27T04:01:00.000Z",
      "scheduledEndTime": "2016-02-27T07:21:00.000Z",
      "actualendTime": "2016-02-27T07:21:00.000Z",
      "_id": "5813295e550dfb3b52b64765"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-02-27T07:21:00.000Z",
      "actualStartTime": "2016-02-27T07:21:00.000Z",
      "scheduledEndTime": "2016-02-27T09:26:00.000Z",
      "actualendTime": "2016-02-27T09:26:00.000Z",
      "_id": "5813295e550dfb3b52b64764"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-02-27T09:27:00.000Z",
      "actualStartTime": "2016-02-27T09:27:00.000Z",
      "scheduledEndTime": "2016-03-03T09:27:00.000Z",
      "actualendTime": "2016-03-03T09:27:00.000Z",
      "_id": "5813295e550dfb3b52b64763"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-02-11T17:08:00.000Z",
  "prize": [
    2000,
    1000
  ],
  "projectId": 9410,
  "registrants": [
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T17:12:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64762"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T17:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64761"
    },
    {
      "handle": "srcjz",
      "reliability": "6%",
      "registrationDate": "2016-02-11T17:28:00.000Z",
      "submissionDate": null,
      "rating": "941",
      "colorStyle": "color: #00A900",
      "_id": "5813295e550dfb3b52b64760"
    },
    {
      "handle": "soso0574",
      "reliability": "100%",
      "registrationDate": "2016-02-11T17:30:00.000Z",
      "submissionDate": "2016-02-18T15:52:00.000Z",
      "rating": "2072",
      "colorStyle": "color: #DDCC00",
      "_id": "5813295e550dfb3b52b6475f"
    },
    {
      "handle": "ghk413",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T17:31:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6475e"
    },
    {
      "handle": "lintc",
      "reliability": "0%",
      "registrationDate": "2016-02-11T17:34:00.000Z",
      "submissionDate": null,
      "rating": "1452",
      "colorStyle": "color: #6666FF",
      "_id": "5813295e550dfb3b52b6475d"
    },
    {
      "handle": "vishal8725",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T18:35:00.000Z",
      "submissionDate": "2016-02-18T16:35:00.000Z",
      "rating": "452",
      "colorStyle": "color: #999999",
      "_id": "5813295e550dfb3b52b6475c"
    },
    {
      "handle": "Rahul.A",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T18:45:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6475b"
    },
    {
      "handle": "ssp555",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T19:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6475a"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T19:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64759"
    },
    {
      "handle": "sapila",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T19:56:00.000Z",
      "submissionDate": null,
      "rating": "1057",
      "colorStyle": "color: #00A900",
      "_id": "5813295e550dfb3b52b64758"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-02-11T21:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64757"
    },
    {
      "handle": "savon_cn",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T02:25:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64756"
    },
    {
      "handle": "solokop",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T02:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64755"
    },
    {
      "handle": "TopG",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T03:58:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64754"
    },
    {
      "handle": "InteR1337",
      "reliability": "20%",
      "registrationDate": "2016-02-12T04:05:00.000Z",
      "submissionDate": null,
      "rating": "1189",
      "colorStyle": "color: #00A900",
      "_id": "5813295e550dfb3b52b64753"
    },
    {
      "handle": "topcodder02",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T05:53:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64752"
    },
    {
      "handle": "leo.ananth",
      "reliability": "40%",
      "registrationDate": "2016-02-12T06:47:00.000Z",
      "submissionDate": null,
      "rating": "1273",
      "colorStyle": "color: #6666FF",
      "_id": "5813295e550dfb3b52b64751"
    },
    {
      "handle": "Luckyodell",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T09:28:00.000Z",
      "submissionDate": null,
      "rating": "265",
      "colorStyle": "color: #999999",
      "_id": "5813295e550dfb3b52b64750"
    },
    {
      "handle": "son4moon",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T11:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6474f"
    },
    {
      "handle": "Taquion",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T19:44:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6474e"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T19:50:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6474d"
    },
    {
      "handle": "jzh08",
      "reliability": "n/a",
      "registrationDate": "2016-02-12T23:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6474c"
    },
    {
      "handle": "PeterBest",
      "reliability": "n/a",
      "registrationDate": "2016-02-13T01:36:00.000Z",
      "submissionDate": null,
      "rating": "504",
      "colorStyle": "color: #999999",
      "_id": "5813295e550dfb3b52b6474b"
    },
    {
      "handle": "MichaelTopLi",
      "reliability": "n/a",
      "registrationDate": "2016-02-13T09:24:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b6474a"
    },
    {
      "handle": "graphit",
      "reliability": "n/a",
      "registrationDate": "2016-02-13T09:30:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64749"
    },
    {
      "handle": "xuyixin",
      "reliability": "n/a",
      "registrationDate": "2016-02-13T12:56:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64748"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2016-02-13T14:48:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "5813295e550dfb3b52b64747"
    },
    {
      "handle": "besabestin",
      "reliability": "13%",
      "registrationDate": "2016-02-13T16:58:00.000Z",
      "submissionDate": null,
      "rating": "1114",
      "colorStyle": "color: #00A900",
      "_id": "5813295e550dfb3b52b64746"
    }
  ],
  "registrationEndDate": "2016-02-13T17:08:00.000Z",
  "reliabilityBonus": 400,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2016-02-18T17:06:00.000Z",
  "submissions": [
    {
      "handle": "soso0574",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 92.89,
      "finalScore": 96.44,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-02-18T15:52:00.000Z",
      "_id": "5813295e550dfb3b52b6477a"
    },
    {
      "handle": "vishal8725",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 73.11,
      "finalScore": 74.67,
      "points": 0,
      "submissionStatus": "Failed Review",
      "submissionDate": "2016-02-18T16:35:00.000Z",
      "_id": "5813295e550dfb3b52b64779"
    }
  ],
  "technology": [
    "CSS",
    "HTML",
    "JavaScript"
  ]
}