{
  "_id": 30055458,
  "_isComplete": true,
  "__v": 1011,
  "_lastUpdate": "2016-11-05T11:07:29.621Z",
  "appealsEndDate": "2016-11-12T13:00:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "GE Receipt Optimization Responsive UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": "2016-11-08T13:00:00.000Z",
  "currentPhaseName": "Submission",
  "currentPhaseRemainingTime": 262435,
  "currentStatus": "Active",
  "detailedRequirements": "Welcome to &quot;<strong>GE Receipt Optimization Responsive UI Prototype Challenge</strong>&quot;. We are looking for your help to create responsive HTML prototype for Receipt Optimization (ROD) application that will allow buyers and management to keep track of key dates for their materials shipments and also gain insight into whether moving the date of receipt up or down in time will have a positive, negative or neutral impact upon GE&#39;s cash flow. <strong>Read more details below and Join with us NOW!!</strong><br />\n<br />\n<strong><em><span style=\"color:#008000\">Tips for Success: Asking questions early and getting Copilot or PM&#39;s feedback is very important for the success of this challenge.</span></em></strong><br />\n<br />\n<span style=\"color:#0000FF\"><em><strong>Additional GE Challenge Rules</strong><br />\n- Please refer to GE Official Rules attached to this challenge.<br />\n- To the extent there is any conflict between these Official Rules and additional Topcoder Terms and Conditions of Use referenced off the Website, these Official Rules govern.<br />\n- All winners from this challenge need print, sign and send back to us the IP Rights document from GE before eligible for the prizes.</em></span><br />\n<br />\n<span style=\"color:#FF0000\"><strong>Background Overview</strong></span><br />\nWe want to build HTML5 web application that will allow buyers to keep track of key dates for their materials shipments (eg: wind turbine parts, blades, towers, gearboxes, etc) and also gain insight into whether moving the date of receipt up or down in time will have a positive, negative or neutral impact upon GE&#39;s cash flow.&nbsp;<br />\n<br />\nThe app should be able to forecast/highlight the dates where we are currently expected to receive material but has potential to postponed to further push out cash. This is an easy logic. Ex. <em>(If a supplier has 30 day terms. When GE received material from them we have 30 days to pay the supplier) So if we expect material on 3/1/2016 we will have to pay on 3/31/2016, This would be a cash payment in the 1st quarter. However if we were to accept the material on 3/2/2016 we will have to pay on 4/1/2016 which will push the cash out from the 1st quarter to the 2nd quarter</em>.<br />\n<br />\nThis site will allow managers to keep track of their accounts and be alerted when there are opportunities to beneficially change the timing of their materials shipments. Users will be able to search for material shipment records and view a calendar that will display key dates and key weeks for the various shipments.<br />\n<br />\nThe most critical thing is to quickly and easily allow a user to search/filter for the content they need and then be able to track the results that are important to them.<br />\n<br />\n<strong>Useful Background Information:</strong><br />\n- <em><strong>How Shipment Timing Benefits GE Explained:</strong></em> The app should be able to forecast/highlight the dates where GE currently expects to receive material but have potential to postpone to further push out cash. The Logic: Ex: (If a supplier has 30 day terms. When GE received material from them we have 30 days to pay the supplier) So if we expect material on 3/1/2016 we will have to pay on 3/31/2016, This would be a cash payment in the 1st quarter. However if we were to accept the material on 3/2/2016 we will have to pay on 4/1/2016 which will push the cash out from the 1st quarter to the 2nd quarter.&nbsp;<br />\n<br />\n- <em><strong>How Shipments Are Handled:</strong></em> GE buyers are responsible for certain type of material. The material we typically receive are quite large and are shipped via boat or train at shipping docks. There is a separate interface where suppliers submit an invoice when the material is delivered. GE is then responsible for accepting and acknowledging the receipt of the material. They buyer is in charge of this process. Thus if a buyer will be able to communicate with the supplier that we can receive the material until a certain date as long as it doesn&#39;t impact other operations.<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Primary Goal</strong></span><br />\n- We are looking for your help to help us create responsive UI Prototype (front end only) that will help use to determine and forecast the best timing to receive materials.<br />\n- Create an interaction for basic scenario analysis functionality, Ex. &quot;<em>If a supplier has 30 day terms. When GE received material from them we have 30 days to pay the supplier) So if we expect material on 3/1/2016 we will have to pay on 3/31/2016, This would be a cash payment in the 1st quarter. However if we were to accept the material on 3/2/2016 we will have to pay on 4/1/2016 which will push the cash out from the 1st quarter to the 2nd quarter.</em>&quot;<br />\n- We are targetting desktop, tablet and mobile devices for this challenge (tablet will share same layout like desktop).<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Competition Task Overview</strong></span><br />\nThe main task of this competition is to develop Responsive HTML5 prototype based on the provided storyboard designs. Your prototype must work properly in all the required browsers.<br />\n<br />\n<strong>General Requirements</strong><br />\n- Replicate the design of the approved Storyboards (PSD Files) for all pages.<br />\n- Your pages must match the colors and structure of the provided storyboards.<br />\n- Provide hover and active condition for all link and buttons<br />\n- Ensure your pages display correctly in all browsers. It is your responsibility to make sure the pages display correctly.<br />\n- Ensure you submission clear of HTML and CSS Validation error and warning.<br />\n- Test in all the required browsers.<br />\n- Provide all hover, active state for buttons and links in desktop version.<br />\n<br />\n<strong>Screen Requirements<br />\n01. Login Screen</strong><br />\n<em>Desktop: 00-login.png<br />\nMobile: 01-01_Mobile_Login.png, 01-02_Mobile_Login Error.png</em><br />\n- User needs to login first before able to use the application<br />\n- Provide error login for wrong credential scenario<br />\n<br />\n<strong>02. Dashboard Page</strong><br />\n<em>Desktop: 01-Dashboard-01-Default.png to 01-Dashboard-03-D-Hover-highlights-date.png<br />\nMobile: 02-01_Mobile_Dashboard.png to 02-09_Mobile_Dashboard_Cal Click Date 2_Opportunity.png</em><br />\n- After successful login, user will be redirected to the dashboard screen<br />\n- This screen will show summary information about the application activity and the user&#39;s recent activity<br />\n- Goal is to optimize how/when the user should receive materials.<br />\n- Taking into account when/do user need the materials.<br />\n- User will be able to view the following informations in the dashboard:<br />\n<br />\n<em><strong>02.1 View Summary of material status.</strong></em><br />\n- Show the summmary information via chart/graph (circle graph)<br />\n- User will be able to select summary information via drop down &quot;PO Payment Due Status&quot; (use dummy content for the drop down value)<br />\n- The chart/graph data content should be collected via json data and not embedded in the HTML page.&nbsp;&nbsp; &nbsp;<br />\n<br />\n<em><strong>02.2 User latest activity (log history)</strong></em><br />\n- Show list of user and other user activity in the application in this area.<br />\n- Scrollbar can be browser based<br />\n- Ability to sort the activity via dropdown (by supplier/by buyer/by management)<br />\n- Ability to search and filter the activity data (provide simulation for this area). User can do multiple search, if they provide commas &quot;,&quot; then wrapped their initial search criteria in grey rounded box and user can add more search criteria.<br />\n<br />\n<em><strong>02.3 List of Material and Activity via Calendar view</strong></em><br />\n- User will be able to see all shipment schedule in this section<br />\n- Clicking the blue left and right arrow button or the &quot;1 March 2016 - 2 May 2016&quot; will navigate user to next/prev month.&nbsp;<br />\n- User will be able to filter shipment schedule data from the calendar view (search box, all buyers dropdown, and all vendors)<br />\n- There are two ways to view the shipment schedule, via calendar (month) view or via timeline view<br />\n<br />\n<em>- Via Calendar:</em><br />\n-- Please refer to &quot;01-Dashboard-01-Default.png until 01-Dashboard-03-D-Hover-highlights-date.png&quot;.<br />\n-- User will be able to see all active shipment schedule via calendar (01-Dashboard-01-Default.png).<br />\n-- Clicking the active shipment schedule box will highlight and expand the calendar and show the schedule of that material and activity (01-Dashboard-02-A-click-highlights-date.png).<br />\n-- depends on the schedule time, the schedule highlight will show different status:<br />\n---- Blue colors: means the schedule is optimized and show the perfect schedule for the shipment (01-Dashboard-02-A-click-highlights-date.png)<br />\n---- Red colors: means the schedule is not optimized and it is recommended for the user to move the schedule (01-Dashboard-02-B-click-highlights-date.png)<br />\n-- Clicking the &quot;Q1&quot; icon will show bubble message that show the payment status. (01-Dashboard-03-A-Hover-Quarter14-icon.png)<br />\n-- Clicking the green dollar &quot;$&quot; icon will show the opportunities bubble message that cames from the system that recommends the user to move the schedule to gain maximum saving optimization (01-Dashboard-03-B-Hover-Opportunities-icon.png)<br />\n-- Clicking the link &quot;+2 more vendors&quot; will show PO number status and any organization that involved in the shipment (01-Dashboard-03-C-Hover-highlights-date.png)<br />\n-- If the shipment schedule have &quot;$&quot; icon in it, when user click the link &quot;+2 more vendors&quot;, it will show the opportunities recommendation to moved the schedule (01-Dashboard-03-D-Hover-highlights-date.png)<br />\n<br />\n<em>- Via Timeline:</em><br />\n-- Please refer to &quot;00-Desktop_Calendar-Timeline.png&quot; to get the layout for timeline view in the dashboard.<br />\n-- User will be able to view the shipment schedule by scrolling the data.<br />\n-- By default, the timeline will show data from old to newest date.<br />\n-- User will be able to filter the data that they want to look for, either by provide search criteria via texts box, &nbsp;by buyers (All buyers) and by vendors (All vendors).<br />\n-- User will be able to view the timeline monthly and will be able to navigate to see other months via dropdown (March 2016)<br />\n<br />\n<em><strong>02.4 Insight/Forecast about some material and their impact to the company?</strong></em><br />\n- The application will simulated all data in the application and check the best way for company to gain maximum saving.<br />\n- It will show information about activity or materials that can be optimized by moving out the shipment schedule to particular dates.&nbsp;<br />\n- Clicking the &quot;view in calendar&quot; will bring user to Calendar view page that showing the shipment schedule that can be optimized.<br />\n<br />\n<strong>03. Advance Filter Page / PO Reports Page</strong><br />\n<em>Desktop: 03-Advance-Filter-Screen-02-Filtered.png, 03-Advance-Filter-Screen-03-Filtered.png, 03-Advance-Filter-Screen-04-Column-view-options.png<br />\nMobile: 03-01_Mobile__Open PO.png, 03-02_Mobile_Open PO_Colapse.png, 03-03_Mobile__Open PO_Filter.png, 03-04_Mobile_Open PO_Filter Result.png</em><br />\n- While user can search for any data easily in the apps from dashboard, there should be a way where user can search for some specific data with more specific criteria.<br />\n- User should be able to search/filter any data from the apps using the following criteria (03-Advance-Filter-Screen-02-Filtered.png):<br />\n-- Critical Dates<br />\n-- Buyer<br />\n-- Vendor/Supplier Name<br />\n-- Materials&nbsp;<br />\n-- The priority is a user should be able to select their name and see the suppliers only related to them.&nbsp;<br />\n- The search result should be real time, so when user finish apply one filter, the result will automatically triggered (since we don&#39;t have action button to execute the filter)<br />\n- User will be able to see and select what kind of data that needs to be shown for the result (03-Advance-Filter-Screen-04-Column-view-options.png)<br />\n- Make the &quot;Showing 72 Result&quot; as a link that will navigate user to Calendar View page.<br />\n<br />\n<strong>04. Calendar View page</strong><br />\n<em>Desktop: 04-calendar-01-Default.png to 04-calendar-04-Expand-critical-date.png, 00-Desktop_Calendar-Timeline.png&nbsp;<br />\nMobile: 04-01_Mobile_Calendar View_Month.png, 04-02_Mobile_Calendar View_Open Filter.png, 04-03_Mobile_Calendar View_Filter Result.png, 04-05_Mobile_Calendar View_Timeline.png</em><br />\n- Once user click search or filter the data and click the result summary link, user will be navigated to calendar view page.<br />\n- The calendar and timeline view will have same basic function like the calendar view in dashboard, but this time the size much more bigger than the dashboard version<br />\n- The left side area is the place where user can track any data of shipment activity and material, and the right side area will show the details of the shipment.<br />\n- As an additional features, when user click any shipment schedule in the calendar or timeline view, it will highlight the connected data on the right side (04-calendar-03-01A-click-on-highlight-date.png and 04-calendar-03-01B-click-on-Critical-date-listing.png).<br />\n- On the right side, user can open and expand the details data (04-calendar-04-Expand-critical-date.png)&nbsp;<br />\n<br />\n<strong>05. Detail Result Page</strong><br />\n<em>Desktop: 05-Materials-suppliers-01-Default.png, 05-Materials-suppliers-02-view-supplier.png, 05-Materials-suppliers-03-view-table-options.png<br />\nMobile: 05-01_Mobile_Material List.png</em><br />\n- User will be able to see details information about the material here.<br />\n- Basic information like material content, stock, supplier, etc can be added in the top area<br />\n- There is a content differences between desktop and mobile version, please use desktop version for the table content in all devices and please put the 4 mobile top content (MSD, Indirect, Services and Suppliers) on the desktop and tablet.&nbsp;<br />\n<br />\n<span style=\"color:#FF0000\"><strong>Specific HTML/CSS/JavaScript Requirements:</strong></span><br />\n<strong>HTML/CSS Requirements:</strong><br />\n- Your HTML code must be valid HTML5 and follow best practices<br />\n- Validate your code - reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to layout your page. Only use table tags for tables of data/information and not for page layout.<br />\n- No inline CSS styles - all styles must be placed in an external style-sheet.<br />\n- Use semantically correct tags - use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- Element and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Label all CSS, JavaScript, or HTML hacks with explanations so others will understand.<br />\n- Your code must render properly in all browsers listed in the scorecard in both Mac and PC environments.<br />\n<br />\n<strong>JavaScript Requirements:</strong><br />\n- All JavaScript used must not have any copyrights to any third party. You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- You are allowed to use Bootstrap or AngularJS for this challenge.<br />\n<span style=\"color:#FF0000\"><strong>- For Calendar/Timeline framework/plugin, please confirm first in forum.&nbsp;</strong></span><br />\n<br />\n<span style=\"color:#FF0000\"><strong>Browsers Requirements:</strong></span><br />\n- Desktop: IE11 above, Latest Firefox, Safari &amp; Chrome Browsers<br />\n- Tablet and Mobile: Android Browser, Mobile Chrome &amp; Firefox, Safari Mobile<br />\n<em>*Tablet will share same design like desktop</em><br />\n<br />\n<span style=\"color:#FF0000\"><strong>Documentation Provided:</strong></span><br />\n- Storyboards",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30055458",
  "event": {
    "id": 3447,
    "description": "2017 TopCoder(R) Open",
    "shortDescription": "tco17"
  },
  "finalFixEndDate": "2016-11-13T19:00:00.000Z",
  "finalSubmissionGuidelines": "<strong>Submission Deliverables:</strong><br />\n- A complete list of UI prototype deliverables can be viewed at: <a href=\"http://apps.topcoder.com/wiki/display/tc/UI+Prototype+Competitions\">UI Prototype Tutorial</a><br />\n<br />\n<strong>Final Submission:</strong><br />\n- For each member, the final submission should be uploaded to: <a href=\"https://software.topcoder.com/review\">Online Review Tool</a>",
  "forumId": 34245,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=34245",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 43,
  "numberOfSubmissions": 0,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-11-02T04:57:00.000Z",
      "actualStartTime": "2016-11-02T04:57:00.000Z",
      "scheduledEndTime": "2016-11-02T04:59:00.000Z",
      "actualendTime": "2016-11-02T04:59:00.000Z",
      "_id": "581dbd71550dfb3b52be4598"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-11-02T04:59:00.000Z",
      "actualStartTime": "2016-11-02T04:59:00.000Z",
      "scheduledEndTime": "2016-11-02T10:35:00.000Z",
      "actualendTime": "2016-11-02T10:35:00.000Z",
      "_id": "581dbd71550dfb3b52be4597"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-11-02T10:35:00.000Z",
      "actualStartTime": "2016-11-02T10:35:00.000Z",
      "scheduledEndTime": "2016-11-04T10:35:00.000Z",
      "actualendTime": "2016-11-04T10:35:00.000Z",
      "_id": "581dbd71550dfb3b52be4596"
    },
    {
      "type": "Submission",
      "status": "Open",
      "scheduledStartTime": "2016-11-02T10:41:00.000Z",
      "actualStartTime": "2016-11-02T10:41:00.000Z",
      "scheduledEndTime": "2016-11-08T13:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be4595"
    },
    {
      "type": "Screening",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-08T13:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-09T01:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be4594"
    },
    {
      "type": "Review",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-09T01:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-11T01:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be4593"
    },
    {
      "type": "Appeals",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-11T01:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-12T01:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be4592"
    },
    {
      "type": "Appeals Response",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-12T01:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-12T13:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be4591"
    },
    {
      "type": "Aggregation",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-12T13:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-12T19:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be4590"
    },
    {
      "type": "Final Fix",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-12T19:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-13T19:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be458f"
    },
    {
      "type": "Final Review",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-13T19:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-14T07:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be458e"
    },
    {
      "type": "Approval",
      "status": "Scheduled",
      "scheduledStartTime": "2016-11-14T07:00:00.000Z",
      "actualStartTime": null,
      "scheduledEndTime": "2016-11-19T07:00:00.000Z",
      "actualendTime": null,
      "_id": "581dbd71550dfb3b52be458d"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-11-02T10:35:00.000Z",
  "prize": [
    2000,
    1000
  ],
  "projectId": 10737,
  "registrants": [
    {
      "handle": "veshu",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T10:38:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be458c"
    },
    {
      "handle": "virose",
      "reliability": "0%",
      "registrationDate": "2016-11-02T10:44:00.000Z",
      "submissionDate": null,
      "rating": "976",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be458b"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T11:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be458a"
    },
    {
      "handle": "leo.ananth",
      "reliability": "26%",
      "registrationDate": "2016-11-02T11:31:00.000Z",
      "submissionDate": null,
      "rating": "1309",
      "colorStyle": "color: #6666FF",
      "_id": "581dbd71550dfb3b52be4589"
    },
    {
      "handle": "jimczj007",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T11:37:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4588"
    },
    {
      "handle": "chandima86",
      "reliability": "n/a",
      "registrationDate": "2016-11-04T09:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4587"
    },
    {
      "handle": "Sky_",
      "reliability": "6%",
      "registrationDate": "2016-11-02T12:41:00.000Z",
      "submissionDate": null,
      "rating": "1735",
      "colorStyle": "color: #DDCC00",
      "_id": "581dbd71550dfb3b52be4586"
    },
    {
      "handle": "hi4sandy",
      "reliability": "46%",
      "registrationDate": "2016-11-02T12:43:00.000Z",
      "submissionDate": null,
      "rating": "1841",
      "colorStyle": "color: #DDCC00",
      "_id": "581dbd71550dfb3b52be4585"
    },
    {
      "handle": "ouyangki",
      "reliability": "13%",
      "registrationDate": "2016-11-02T13:01:00.000Z",
      "submissionDate": null,
      "rating": "1154",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be4584"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T13:03:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4583"
    },
    {
      "handle": "sin_hu",
      "reliability": "100%",
      "registrationDate": "2016-11-02T16:15:00.000Z",
      "submissionDate": null,
      "rating": "1914",
      "colorStyle": "color: #DDCC00",
      "_id": "581dbd71550dfb3b52be4582"
    },
    {
      "handle": "nghi85",
      "reliability": "100%",
      "registrationDate": "2016-11-02T13:37:00.000Z",
      "submissionDate": null,
      "rating": "1378",
      "colorStyle": "color: #6666FF",
      "_id": "581dbd71550dfb3b52be4581"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T13:34:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4580"
    },
    {
      "handle": "codebala",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T14:04:00.000Z",
      "submissionDate": null,
      "rating": "906",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be457f"
    },
    {
      "handle": "kreasindo",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T14:05:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be457e"
    },
    {
      "handle": "besabestin",
      "reliability": "0%",
      "registrationDate": "2016-11-02T14:37:00.000Z",
      "submissionDate": null,
      "rating": "1085",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be457d"
    },
    {
      "handle": "AltaiEzioR",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T15:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be457c"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T15:19:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be457b"
    },
    {
      "handle": "dwij",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T15:53:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be457a"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T16:32:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4579"
    },
    {
      "handle": "ssp555",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T18:21:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4578"
    },
    {
      "handle": "Cristian77",
      "reliability": "n/a",
      "registrationDate": "2016-11-02T18:39:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4577"
    },
    {
      "handle": "aukintux",
      "reliability": "33%",
      "registrationDate": "2016-11-02T20:46:00.000Z",
      "submissionDate": null,
      "rating": "980",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be4576"
    },
    {
      "handle": "prasenjitroy",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T04:14:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4575"
    },
    {
      "handle": "roarky",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T13:32:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4574"
    },
    {
      "handle": "fireflysmile",
      "reliability": "53%",
      "registrationDate": "2016-11-03T00:57:00.000Z",
      "submissionDate": null,
      "rating": "1151",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be4573"
    },
    {
      "handle": "asteroidiv",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T01:30:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4572"
    },
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2016-11-03T03:02:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be4571"
    },
    {
      "handle": "adalahoscar",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T03:54:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4570"
    },
    {
      "handle": "fish00",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T04:01:00.000Z",
      "submissionDate": null,
      "rating": "446",
      "colorStyle": "color: #999999",
      "_id": "581dbd71550dfb3b52be456f"
    },
    {
      "handle": "DawnB",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T04:27:00.000Z",
      "submissionDate": null,
      "rating": "480",
      "colorStyle": "color: #999999",
      "_id": "581dbd71550dfb3b52be456e"
    },
    {
      "handle": "narasimha.dvnr",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T05:30:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be456d"
    },
    {
      "handle": "frozenfx",
      "reliability": "0%",
      "registrationDate": "2016-11-03T08:00:00.000Z",
      "submissionDate": null,
      "rating": "1464",
      "colorStyle": "color: #6666FF",
      "_id": "581dbd71550dfb3b52be456c"
    },
    {
      "handle": "testXuSanping",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T12:41:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be456b"
    },
    {
      "handle": "jorje.b",
      "reliability": "9%",
      "registrationDate": "2016-11-03T12:41:00.000Z",
      "submissionDate": null,
      "rating": "1046",
      "colorStyle": "color: #00A900",
      "_id": "581dbd71550dfb3b52be456a"
    },
    {
      "handle": "vegetablewater",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T14:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4569"
    },
    {
      "handle": "moagi.anela",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T14:56:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4568"
    },
    {
      "handle": "penpo",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T15:08:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4567"
    },
    {
      "handle": "mhykol",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T15:52:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4566"
    },
    {
      "handle": "glint",
      "reliability": "40%",
      "registrationDate": "2016-11-03T17:05:00.000Z",
      "submissionDate": null,
      "rating": "1269",
      "colorStyle": "color: #6666FF",
      "_id": "581dbd71550dfb3b52be4565"
    },
    {
      "handle": "btgd88",
      "reliability": "n/a",
      "registrationDate": "2016-11-03T23:43:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4564"
    },
    {
      "handle": "Colinh84",
      "reliability": "0%",
      "registrationDate": "2016-11-04T10:04:00.000Z",
      "submissionDate": null,
      "rating": "1672",
      "colorStyle": "color: #DDCC00",
      "_id": "581dbd71550dfb3b52be4563"
    },
    {
      "handle": "linuxgeek",
      "reliability": "n/a",
      "registrationDate": "2016-11-04T09:44:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "581dbd71550dfb3b52be4562"
    }
  ],
  "registrationEndDate": "2016-11-04T10:35:00.000Z",
  "reliabilityBonus": 400,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30000591,
  "submissionEndDate": "2016-11-08T13:00:00.000Z",
  "submissions": [],
  "technology": [
    "Angular.js",
    "CSS",
    "HTML",
    "HTML5",
    "JavaScript"
  ]
}