{
  "_id": 30054176,
  "_isComplete": true,
  "__v": 1,
  "_lastUpdate": "2016-10-28T10:32:17.708Z",
  "appealsEndDate": "2016-07-05T06:11:00.000Z",
  "challengeCommunity": "develop",
  "challengeName": "Living Progress - Impact Entrepreneurship Desktop UI Prototype Challenge",
  "challengeType": "UI Prototype Competition",
  "checkpointSubmissionEndDate": null,
  "currentPhaseEndDate": null,
  "currentPhaseName": "Stalled",
  "currentPhaseRemainingTime": 0,
  "currentStatus": "Completed",
  "detailedRequirements": "Welcome to <strong>Living Progress - Impact Entrepreneurship UI Prototype Challenge</strong><br />\nThis UI Prototype is part of the Living Progress Blitz Challenge Series. Make sure to check it out!<br />\n<br />\nThe main task of this challenge is to create Responsive UI Prototype of the Living Progress - Impact Entrepreneurship application based on the provided Storyboard design and specification below<br />\n<br />\nAt the end of this challenge, we need a solid UI prototype using best coding practice/solutions. Good luck and we&rsquo;re looking forward to your submissions!",
  "digitalRunPoints": null,
  "directUrl": "https://www.topcoder.com/direct/contest/detail.action?projectId=30054176",
  "finalFixEndDate": "2016-07-07T10:15:00.000Z",
  "finalSubmissionGuidelines": "<strong>Downloadable Files:</strong><br />\n<a href=\"https://drive.google.com/folderview?id=0B31nrwic_6z0cmFjX2NtNGlZR3M&amp;usp=sharing\">https://drive.google.com/folderview?id=0B31nrwic_6z0cmFjX2NtNGlZR3M&amp;usp=sharing</a><br />\nStoryboard.zip - Use this storyboard design when build UI Prototype<br />\nWireframe.zip - Living Progres - Impact Entrepreneurship Wireframe Reference<br />\n<br />\n<strong>Important!</strong><br />\n- Suggest best practice Responsive Web Design Breakpoints.<br />\n- Use <a href=\"http://bower.io/\">Bower</a> for Library Package Manager. DO NOT just put raw javascript library inside your prototype<br />\n- If you use custom styling/function based on existing library. Put them in separated files.<br />\n- Use <a href=\"http://sass-lang.com/install\">SASS</a> for CSS Pre-Processor<br />\n- Put original sass folder also the output on your prototype<br />\n- You can use Bootstrap to build the layout<br />\n- Use separated JSON to store data.<br />\n- Your prototype submission need build for Desktop Size only<br />\n- Provided storyboard using 1280px and height up to page content<br />\n- For Desktop version, you need make the fluid version based on tablat starting from 1025px and upper<br />\n- Please do your best adjust the layout for desktop layout for 1025px and 1280px, we&rsquo;ll ask more edits later on Final Fixes<br />\n- As possible all buttons and links need linked each other. If the page not exists on storyboard, put dead links.<br />\n- Bring consistency placement/styling in your UI Prototype submission<br />\n- Let discuss any of your questions and let us know if need clarification.<br />\n<br />\n<strong>UI Prototype Page Requirements<br />\n0). Index page</strong><br />\n- Create index page that will link user to these 2 following roles:<br />\n<br />\n<strong>A). Entrepreneur Flow<br />\n1). Login</strong><br />\nScreenshot: 01_1_login.png<br />\n- Background image need covered browser screen<br />\n- Endeavour logo placed centered<br />\n- Login form need use transparent styling<br />\n- Match style for default and typed value on text inputs<br />\n- For Password field there&rsquo;s show/hide to display password value. Build this function on your prototype.<br />\n- Create error validation function, match styling like storyboard (Screenshot: 01_2_login_error.png)<br />\n- Then, Login button need take user Dashboard (blank page), more details below<br />\n<br />\n<strong>2). Walkthrough</strong><br />\nScreenshot: 02_2_walk_through.png<br />\n- This modal window need show up at first time user landed on Dashboard page<br />\n- Transparent background need covered whole browser screen<br />\n- Build slideshow function<br />\n- Dots pagination need able to navigate to different slide<br />\n- Click on the overlay need hide the modal window<br />\n- Get Started button take user to Dashboard (default) page, more details below.<br />\n<br />\n<strong>3). Dashboard (blank)</strong><br />\nScreenshot: 02_1_dashboard_blank.png<br />\n- This is dashboard look at first time user landed on Dashboard page that still display blank content on each section<br />\n- Dashboard page layout divided by these following sections below. Each sections need re-use consistent implementation on every pages<br />\n<br />\nHeader<br />\n- Header need use fluid width<br />\n- Endeavor logo placed on the left side area, this logo can be dead link<br />\n- Logo always placed on the left side of browser screen<br />\n- Main navigation placed on the right side area<br />\n- Match active/inactive state<br />\n- User thumbnail need wrapped with css properties, username place on the right side<br />\n- Notification button placed on the right side<br />\n- Display number indicator on top of the icon, make sure when filled with more characters rounded corner shape not auto expand the width<br />\n- Header area need use fixed placement when user scrolling down/up the page<br />\n&nbsp;&nbsp; &nbsp;<br />\nContent<br />\n- Content area need use fluid width and use 2 columns format<br />\n- Follow empty message for each section like storyboard look<br />\n- Click Get Started button need take user to Dashboard (default) page, more details below.<br />\n<br />\nFooter<br />\n- Footer need use fluid width<br />\n- Endeavor logo and copyright text placed on the left side<br />\n- Footer links placed on the right side<br />\n- Footer area need stick with the bottom of browser viewport screen if there are less content. If there are more content you need make the footer area scrollable<br />\n<br />\n<strong>4). Dashboard (default)</strong><br />\nScreenshot: 03_1_dashboard.png<br />\n- For this dashboard default page, you need add new user area below the header bar<br />\n- Top banner is display user profile information<br />\n- Match columns layout design<br />\n- No need build the &ldquo;+&rdquo; button function<br />\n- Website and Email need trigger correct link format<br />\n<br />\nMy Application Profile<br />\n- Overall scoring on the right side of title<br />\n- Create quick animation effect for number and progress bar on page load<br />\n- Match each row content<br />\n- Display number indicator for with different red and grey color<br />\n- Update Profile button placed on the bottom right, click this take user to &ldquo;5). My Application - Details&rdquo;<br />\n<br />\nRecent Activities<br />\n- There are dot timelines on the left side<br />\n- User thumbnails need wrapped from css circle<br />\n- Match content layout<br />\n<br />\nEvents<br />\n- Event icon and date placed on the left side<br />\n- Event information display as 2 lines, there&rsquo;s more link<br />\n- Action buttons placed on the right side<br />\n<br />\nTop Banner Function<br />\nScreenshot: 03_2_banner_hover.png<br />\n- Hover on banner need display 2 action buttons on the bottom right side<br />\n- Click camera icon need load modal window<br />\n- After close the modal, user need able to&nbsp; drag the background image by drag the button (Screenshot: 03_3_change_bg_image.png)<br />\n- After click Save or Cancel, background image applied (Screenshot: 03_4_dashboard.png)<br />\n<br />\nNotification<br />\nScreenshot: 03_5_notifications.png<br />\n- Click notification icon need load the right sidebar, possible use quick slide effect?<br />\n- Black transparent overlay need covered whole browser screen<br />\n- User need able to scroll down/up the notification area<br />\n- Click on the overlay area need hide the sidebar<br />\n<br />\n<strong>5). My Application - Details</strong><br />\nScreenshot: 04_1_application.png<br />\n- User landed to this page from Update Profile button on Dashboard or from Main Application on top navigation menu.<br />\n- Below header bar, there&rsquo;s another bar for My Application<br />\n- Back arrow take user back to Dashboard page<br />\n- Edit and Review menu, set Edit as active state<br />\n- Next and Save buttons placed on the right side<br />\n- On main content area, page divided by 2 area<br />\n- Left sidebar for My Application steps<br />\n- And right side for step content<br />\n- Match active/inactive state for steps<br />\n- Use quick animation effect for progress steps<br />\n- Match form styling like storyboard look<br />\n- Click Profile Pic area need load flyout to upload via drag and drop or from another app (Screenshot: 04_2_upload_profile_pic.png)<br />\n- No need build the upload function<br />\n- When user focus on text input need automatically load the tooltips below the text input<br />\n- Sample flyout look for Name (Screenshot: 04_3_enter_name.png)<br />\n- Sample flyout look for Company (Screenshot: 04_4_company_name.png)<br />\n- For Team field, you need load the multiple select (Screenshot: 04_5_add_team_member.png)<br />\n- For Custom Section (Screenshot: 04_6_add_custom_section.png)<br />\n- Need load the flyout to let user Drag &amp; Drop or upload via another application (Screenshot: 04_7_add_items.png)<br />\n<br />\n<strong>6). My Application Details - The Entrepreneur &amp; The Idea</strong><br />\nScreenshot: 05_1_application_the_enterpreneur.png<br />\n- This is 2nd step from My Application<br />\n- Match buttons below the header bar for Prev, Next and Save buttons<br />\n- Click &ldquo;?&rdquo; button need load help tooltips (Screenshot: 05_2_help.png)<br />\n- When user focus on Description field, text editor show up (Screenshot: 05_3_add_desc.png)<br />\n- You can use free/open source text editor library<br />\n- Page look after description added (Screenshot: 05_4_desc_added.png)<br />\n- Hover the description area need show up the action buttons (Screenshot: 05_5_hover_desc.png)<br />\n- You can put dead link for the action buttons<br />\n- Public is using radio button<br />\n- Click Custom Section need load additional Section Title and Description (Screenshot: 05_6_add_custom_section.png)<br />\n- User focus on Section title (Screenshot: 05_7_add_section_title.png)<br />\n- Click &ldquo;+&rdquo; button on the right side need load flyout (Screenshot: 05_8_add_section_items.png)<br />\n- Click chart button need load some chart options (Screenshot: 05_9_add_chart.png)<br />\n- Click table button need let user drag and select number of rows and columns (Screenshot: 05_10_add_table.png &amp; Screenshot: 05_11_add_table.png).<br />\n- Sample complete content after user add some various data (Screenshot: 05_12_table_and_files_added.png)<br />\n- User can see action buttons when do right click via mouse to modify the table (Screenshot: 05_13_table_right_click.png)<br />\n<br />\n<strong>7). My Application Review</strong><br />\nScreenshot: 06_1_application_review.png<br />\n- Click Review button below the header bar need load review of my Application page<br />\n- On the right side, there&rsquo;s a PDF button<br />\n- Page using 3 columns layout<br />\n- On the left sidebar there are number indicator for comments<br />\n- Also put checkmark icon for completed step<br />\n- Overall feedback take user to Feedback page explained below<br />\n- Provide button placed on the bottom of left sidebar<br />\n- User still need able to click each steps<br />\n- On the content area, comments indicated by grey background text.<br />\n- Comments boxes placed on the right side<br />\n- Match styling for each comment box<br />\n- Invite to Review link placed on the bottom of&nbsp; Comment area<br />\n- Click grey box on content area, need change updated to yellow background and move indentation to the left side (Screenshot: 06_2_application_review_comment.png)<br />\n- After user click and type on the input area, Reply and Cancel link show up Screenshot: 06_4_application_review.png)<br />\n- Display sample after user add new comment (Screenshot: 06_4_application_review.png)<br />\n- Click Hide comments link on the right side of Star area need hide the comments area and expand the main content width (Screenshot: 06_5_application_review_hide_comments.png)<br />\n<br />\n<strong>8). My Application - Execution</strong><br />\nScreenshot: 07_1_application_execution.png<br />\n- This is Execution step look and feel<br />\n- Put checkmark graphic on the right side of completed step of My Application<br />\n- On the main content area, there are tab for Business Plan and Revenue Model<br />\n- On the left side is for sidebar navigator<br />\n- Match active/inactive state<br />\n- Click another step need allow user input another data (Screenshot: 07_2_application_execution.png)<br />\n- This is sample table look for Revenue tab (Screenshot: 07_3_application_execution.png)<br />\n- Click + Row should add another new row<br />\n<br />\n<strong>9). Event</strong><br />\nScreenshot: 08_1_events.png<br />\n- This is Event page look<br />\n- Put banner image below the header bar<br />\n- On the content area use 2 columns layout, Upcoming and Past<br />\n- For Past column, match grey button color, and there&rsquo;s no action button for Past<br />\n- Click the action buttons need load the flyout (Screenshot: 08_2_events_details.png)<br />\n- Match content like storyboard look<br />\n- Click Confirm and the overlay background need hide the<br />\n<br />\n<strong>10). FAQ</strong><br />\nScreenshot: 09_FAQs.png<br />\n- This FAQ page, page divided by 2 section left sidebar and right sidebar<br />\n- On the left sidebar, there&rsquo;s search questions input on top<br />\n- User can change from one to another category<br />\n- Ask Us button placed on the the bottom<br />\n- On the right side, each FAQ need use collapsible function<br />\n- Was this helpful link placed on the bottom of each question<br />\n- Display collapsed state for each state on page load<br />\n<br />\n<strong>11). Feedback</strong><br />\nScreenshot: 10_1_rating_and_survey.png<br />\n- Feedback page using 2 columns layout<br />\n- On the left side, user can navigate to different feedback steps<br />\n- There&rsquo;s feedback progress on top of left sidebar<br />\n- User can navigate to different feedback steps<br />\n- Checkmark icon displayed for completed feedback<br />\n- On the right side user can select boxes (Screenshot: 10_2_rating_and_survey.png)<br />\n- Match selected box style<br />\n- There are prev and right arrow to navigate each feedback<br />\n<br />\n<strong>B). Mentor Flow<br />\n12). Dashboard Mentor</strong><br />\nScreenshot: 11_mentor_dashboard.png<br />\n- This is different Dashboard page for Mentor<br />\n- This can be separated/stand alone page<br />\n- Match header/main navigations differences like storyboard look<br />\n- Notice, Review menu show up on main navigation screen<br />\n- Use 2 columns layout<br />\n<br />\n<strong>Application to Review</strong><br />\n- Dropdown placed on the right side<br />\n- Match content differences like storyboard look<br />\n- Scoresheet and Review button placed on the bottom of each row<br />\n- Click each button take user to separated page explained below<br />\n- Use quick animation effect for progress bar<br />\n- there&rsquo;s number indicator for the comment<br />\n<br />\n<strong>Mentor Profile</strong><br />\n- Use quick animation progress for Mentor Profile<br />\n- Update button placed on the right side<br />\n<br />\n<strong>Recent Activities</strong><br />\n- Re-use completed Recent Activities styling from another page<br />\n<br />\n<strong>Events</strong><br />\n- Re-use completed Events styling from another page<br />\n<br />\n<strong>13). Mentor Application - Review</strong><br />\nScreenshot: 12_1_mentor_application_review.png<br />\n- Re-use completed review screen<br />\n- On the left side of arrow button there&rsquo;s Review and Scoresheet button<br />\n- Action button on the right is PDF button<br />\n- Prev and Next button show up on the bottom of Email link<br />\n- Match banner area below the header bar<br />\n- Website and links need use blue colored<br />\n- User can drag text, notice + button show up (Screenshot: 12_2_highlight.png)<br />\n- Click + button need load the box on the right side (Screenshot:12_3_add_comment.png)<br />\n- User can type on comment area<br />\n- After saved comments added. (Screenshot:12_4_comment_added.png)<br />\n- Click Write Overall Feedback, need load big flyout (Screenshot:12_5_add_overall_feedback.png)<br />\n- User can type on textarea<br />\n- Save and Cancel button placed on the bottom<br />\n<br />\n<strong>14). Mentor Application - ISP Scoresheet</strong><br />\nScreenshot:13_1_ISP_scoresheet.png<br />\n- This is Scoresheet tab<br />\n- On the left side, display quick animated for scoresheet profile<br />\n- Section 1, user only need able to select one radio at a time<br />\n- Section 2, user only need able to select one selection at a time.<br />\n- Section 3, Selected circle use green colored border.<br />\n<br />\n<strong>CODE REQUIREMENTS:<br />\nHTML/HTML5</strong><br />\n- Provide comments on the page elements to give clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- Please use clean INDENTATION for all HTML code so future developers can follow the code.<br />\n- All HTML code naming should not have any conflicts or errors.<br />\nElement and Attribute names should be in lowercase and use a &quot;-&quot; or camel naming to separate multiple-word classes (i.e.. &quot;main-content&quot;, or &quot;mainContent)<br />\n- Use semantically correct tags- use H tags for headers, etc. Use strong and em tags instead of bold and italic tags.<br />\n- No inline CSS styles- all styles must be placed in an external stylesheet.<br />\n- Validate your code- reviewers may accept minor validation errors, but please comment your reason for any validation errors. Use the validators listed in the scorecard.<br />\n<br />\n<strong>SASS/CSS</strong><br />\n- Use SASS as CSS Pre-Processor.<br />\n- Use Media Queries to load different styles for each page and don&#39;t build different page for different device/layout.<br />\n- Provide comments on the SASS code. We need SASS comments to give a clear explanation of the code usage. The goal is to help future developers understand the code.<br />\n- All SASS naming should not have any conflicts.<br />\n- As possible use SASS style when create all styling, avoid image usage.<br />\n- Use CSS to space out objects, not clear/transparent images (GIFs or PNGs) and use proper structural CSS to lay out your page. Only use table tags for tables of data/information and not for page layout.<br />\n<br />\n<strong>Javascript</strong><br />\n- All JavaScript must not have a copyright by a third party.<br />\n- You are encouraged to use your own scripts, or scripts that are free, publicly available and do not have copyright statements or author recognition requirements anywhere in the code.<br />\n- Use Bower for Library Package Manager<br />\n- Create separate files if you plan to create custom functions<br />\n<br />\n<strong>Images</strong><br />\n- Images should be properly compressed while still having good visual quality.<br />\n- Please use best practice repetition usage of background based image.<br />\n- Please use sprites when using icons for your submission.<br />\n- Make sure your submission look sharp for Retina and Standard devices<br />\n<br />\n<strong>Browsers Requirements</strong><br />\n- IE11<br />\n- Chrome Latest Browser<br />\n- Safari Latest Browser<br />\n- Firefox Latest Browser",
  "forumId": 33044,
  "forumLink": "http://apps.topcoder.com/forums/?module=Category&categoryID=33044",
  "numberOfCheckpointSubmissions": 0,
  "numberOfCheckpointsPrizes": 0,
  "numberOfRegistrants": 33,
  "numberOfSubmissions": 3,
  "phases": [
    {
      "type": "Specification Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-06-20T17:12:00.000Z",
      "actualStartTime": "2016-06-20T17:12:00.000Z",
      "scheduledEndTime": "2016-06-20T17:12:00.000Z",
      "actualendTime": "2016-06-20T17:12:00.000Z",
      "_id": "58132931550dfb3b52b5f974"
    },
    {
      "type": "Specification Review",
      "status": "Closed",
      "scheduledStartTime": "2016-06-20T17:12:00.000Z",
      "actualStartTime": "2016-06-20T17:12:00.000Z",
      "scheduledEndTime": "2016-06-21T01:55:00.000Z",
      "actualendTime": "2016-06-21T01:55:00.000Z",
      "_id": "58132931550dfb3b52b5f973"
    },
    {
      "type": "Registration",
      "status": "Closed",
      "scheduledStartTime": "2016-06-21T06:28:00.000Z",
      "actualStartTime": "2016-06-21T06:28:00.000Z",
      "scheduledEndTime": "2016-06-23T06:28:00.000Z",
      "actualendTime": "2016-06-23T06:28:00.000Z",
      "_id": "58132931550dfb3b52b5f972"
    },
    {
      "type": "Submission",
      "status": "Closed",
      "scheduledStartTime": "2016-06-21T06:33:00.000Z",
      "actualStartTime": "2016-06-21T06:33:00.000Z",
      "scheduledEndTime": "2016-07-01T15:28:00.000Z",
      "actualendTime": "2016-07-01T15:28:00.000Z",
      "_id": "58132931550dfb3b52b5f971"
    },
    {
      "type": "Screening",
      "status": "Closed",
      "scheduledStartTime": "2016-07-01T15:28:00.000Z",
      "actualStartTime": "2016-07-01T15:28:00.000Z",
      "scheduledEndTime": "2016-07-02T02:50:00.000Z",
      "actualendTime": "2016-07-02T02:50:00.000Z",
      "_id": "58132931550dfb3b52b5f970"
    },
    {
      "type": "Review",
      "status": "Closed",
      "scheduledStartTime": "2016-07-02T02:50:00.000Z",
      "actualStartTime": "2016-07-02T02:50:00.000Z",
      "scheduledEndTime": "2016-07-03T20:58:00.000Z",
      "actualendTime": "2016-07-03T20:58:00.000Z",
      "_id": "58132931550dfb3b52b5f96f"
    },
    {
      "type": "Appeals",
      "status": "Closed",
      "scheduledStartTime": "2016-07-03T20:58:00.000Z",
      "actualStartTime": "2016-07-03T20:58:00.000Z",
      "scheduledEndTime": "2016-07-04T20:58:00.000Z",
      "actualendTime": "2016-07-04T20:58:00.000Z",
      "_id": "58132931550dfb3b52b5f96e"
    },
    {
      "type": "Appeals Response",
      "status": "Closed",
      "scheduledStartTime": "2016-07-04T20:58:00.000Z",
      "actualStartTime": "2016-07-04T20:58:00.000Z",
      "scheduledEndTime": "2016-07-05T06:11:00.000Z",
      "actualendTime": "2016-07-05T06:11:00.000Z",
      "_id": "58132931550dfb3b52b5f96d"
    },
    {
      "type": "Aggregation",
      "status": "Closed",
      "scheduledStartTime": "2016-07-05T06:11:00.000Z",
      "actualStartTime": "2016-07-05T06:11:00.000Z",
      "scheduledEndTime": "2016-07-05T06:21:00.000Z",
      "actualendTime": "2016-07-05T06:21:00.000Z",
      "_id": "58132931550dfb3b52b5f96c"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-07-05T06:21:00.000Z",
      "actualStartTime": "2016-07-05T06:21:00.000Z",
      "scheduledEndTime": "2016-07-06T01:39:00.000Z",
      "actualendTime": "2016-07-06T01:39:00.000Z",
      "_id": "58132931550dfb3b52b5f96b"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-07-06T01:39:00.000Z",
      "actualStartTime": "2016-07-06T01:39:00.000Z",
      "scheduledEndTime": "2016-07-06T08:38:00.000Z",
      "actualendTime": "2016-07-06T08:38:00.000Z",
      "_id": "58132931550dfb3b52b5f96a"
    },
    {
      "type": "Approval",
      "status": "Closed",
      "scheduledStartTime": "2016-07-07T16:05:00.000Z",
      "actualStartTime": "2016-07-07T16:05:00.000Z",
      "scheduledEndTime": "2016-07-08T23:42:00.000Z",
      "actualendTime": "2016-07-08T23:42:00.000Z",
      "_id": "58132931550dfb3b52b5f969"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-07-06T08:39:00.000Z",
      "actualStartTime": "2016-07-06T08:39:00.000Z",
      "scheduledEndTime": "2016-07-06T21:16:00.000Z",
      "actualendTime": "2016-07-06T21:16:00.000Z",
      "_id": "58132931550dfb3b52b5f968"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-07-06T21:16:00.000Z",
      "actualStartTime": "2016-07-06T21:16:00.000Z",
      "scheduledEndTime": "2016-07-07T08:01:00.000Z",
      "actualendTime": "2016-07-07T08:01:00.000Z",
      "_id": "58132931550dfb3b52b5f967"
    },
    {
      "type": "Final Fix",
      "status": "Closed",
      "scheduledStartTime": "2016-07-07T08:01:00.000Z",
      "actualStartTime": "2016-07-07T08:01:00.000Z",
      "scheduledEndTime": "2016-07-07T10:15:00.000Z",
      "actualendTime": "2016-07-07T10:15:00.000Z",
      "_id": "58132931550dfb3b52b5f966"
    },
    {
      "type": "Final Review",
      "status": "Closed",
      "scheduledStartTime": "2016-07-07T10:15:00.000Z",
      "actualStartTime": "2016-07-07T10:15:00.000Z",
      "scheduledEndTime": "2016-07-07T16:05:00.000Z",
      "actualendTime": "2016-07-07T16:05:00.000Z",
      "_id": "58132931550dfb3b52b5f965"
    }
  ],
  "platforms": [
    "HTML"
  ],
  "postingDate": "2016-06-21T06:28:00.000Z",
  "prize": [
    1400,
    700
  ],
  "projectId": 9616,
  "registrants": [
    {
      "handle": "virose",
      "reliability": "0%",
      "registrationDate": "2016-06-21T06:54:00.000Z",
      "submissionDate": null,
      "rating": "976",
      "colorStyle": "color: #00A900",
      "_id": "58132931550dfb3b52b5f964"
    },
    {
      "handle": "cam.ashwini",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T08:04:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f963"
    },
    {
      "handle": "genycopedison",
      "reliability": "0%",
      "registrationDate": "2016-06-21T08:05:00.000Z",
      "submissionDate": null,
      "rating": "923",
      "colorStyle": "color: #00A900",
      "_id": "58132931550dfb3b52b5f962"
    },
    {
      "handle": "alfiya_Zi",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T08:09:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f961"
    },
    {
      "handle": "fish00",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T08:09:00.000Z",
      "submissionDate": null,
      "rating": "541",
      "colorStyle": "color: #999999",
      "_id": "58132931550dfb3b52b5f960"
    },
    {
      "handle": "PeterBest",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T09:39:00.000Z",
      "submissionDate": null,
      "rating": "622",
      "colorStyle": "color: #999999",
      "_id": "58132931550dfb3b52b5f95f"
    },
    {
      "handle": "sunbinbrother",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T09:42:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f95e"
    },
    {
      "handle": "besabestin",
      "reliability": "13%",
      "registrationDate": "2016-06-21T09:55:00.000Z",
      "submissionDate": "2016-07-01T15:27:00.000Z",
      "rating": "1115",
      "colorStyle": "color: #00A900",
      "_id": "58132931550dfb3b52b5f95d"
    },
    {
      "handle": "muvic082",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T11:28:00.000Z",
      "submissionDate": "2016-07-01T13:16:00.000Z",
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f95c"
    },
    {
      "handle": "jackchongs",
      "reliability": "6%",
      "registrationDate": "2016-06-21T12:13:00.000Z",
      "submissionDate": null,
      "rating": "889",
      "colorStyle": "color: #999999",
      "_id": "58132931550dfb3b52b5f95b"
    },
    {
      "handle": "krisjen",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T13:14:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f95a"
    },
    {
      "handle": "leo.ananth",
      "reliability": "20%",
      "registrationDate": "2016-06-21T13:18:00.000Z",
      "submissionDate": null,
      "rating": "1377",
      "colorStyle": "color: #6666FF",
      "_id": "58132931550dfb3b52b5f959"
    },
    {
      "handle": "blu3fox",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T13:46:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f958"
    },
    {
      "handle": "susiak",
      "reliability": "11%",
      "registrationDate": "2016-06-21T13:49:00.000Z",
      "submissionDate": null,
      "rating": "715",
      "colorStyle": "color: #999999",
      "_id": "58132931550dfb3b52b5f957"
    },
    {
      "handle": "codingdrone",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T13:55:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f956"
    },
    {
      "handle": "g.prog",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T14:23:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f955"
    },
    {
      "handle": "arch_angel",
      "reliability": "0%",
      "registrationDate": "2016-06-21T14:29:00.000Z",
      "submissionDate": null,
      "rating": "938",
      "colorStyle": "color: #00A900",
      "_id": "58132931550dfb3b52b5f954"
    },
    {
      "handle": "Gando19850304",
      "reliability": "0%",
      "registrationDate": "2016-06-21T15:47:00.000Z",
      "submissionDate": null,
      "rating": "989",
      "colorStyle": "color: #00A900",
      "_id": "58132931550dfb3b52b5f953"
    },
    {
      "handle": "playgameTL",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T16:54:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f952"
    },
    {
      "handle": "YiiBryan",
      "reliability": "0%",
      "registrationDate": "2016-06-21T17:14:00.000Z",
      "submissionDate": null,
      "rating": "1207",
      "colorStyle": "color: #6666FF",
      "_id": "58132931550dfb3b52b5f951"
    },
    {
      "handle": "shankarkamble",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T18:44:00.000Z",
      "submissionDate": null,
      "rating": "870",
      "colorStyle": "color: #999999",
      "_id": "58132931550dfb3b52b5f950"
    },
    {
      "handle": "vinoh",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T19:45:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f94f"
    },
    {
      "handle": "mulish",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T19:48:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f94e"
    },
    {
      "handle": "btgd88",
      "reliability": "n/a",
      "registrationDate": "2016-06-21T20:28:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f94d"
    },
    {
      "handle": "TopG",
      "reliability": "n/a",
      "registrationDate": "2016-06-22T02:13:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f94c"
    },
    {
      "handle": "testXuSanping",
      "reliability": "n/a",
      "registrationDate": "2016-06-22T03:07:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f94b"
    },
    {
      "handle": "zohaib.amjad",
      "reliability": "n/a",
      "registrationDate": "2016-06-22T09:40:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f94a"
    },
    {
      "handle": "Standlove",
      "reliability": "n/a",
      "registrationDate": "2016-06-22T09:10:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f949"
    },
    {
      "handle": "solokop",
      "reliability": "33%",
      "registrationDate": "2016-06-22T09:57:00.000Z",
      "submissionDate": null,
      "rating": "858",
      "colorStyle": "color: #999999",
      "_id": "58132931550dfb3b52b5f948"
    },
    {
      "handle": "topcodder02",
      "reliability": "n/a",
      "registrationDate": "2016-06-22T16:06:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f947"
    },
    {
      "handle": "Taquion",
      "reliability": "n/a",
      "registrationDate": "2016-06-22T22:27:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f946"
    },
    {
      "handle": "farouk23",
      "reliability": "n/a",
      "registrationDate": "2016-06-23T01:49:00.000Z",
      "submissionDate": null,
      "rating": null,
      "colorStyle": "color: #000000",
      "_id": "58132931550dfb3b52b5f945"
    },
    {
      "handle": "quesks",
      "reliability": "33%",
      "registrationDate": "2016-06-23T05:46:00.000Z",
      "submissionDate": "2016-07-01T15:23:00.000Z",
      "rating": "1247",
      "colorStyle": "color: #6666FF",
      "_id": "58132931550dfb3b52b5f944"
    }
  ],
  "registrationEndDate": "2016-06-23T06:28:00.000Z",
  "reliabilityBonus": 280,
  "reviewScorecardId": 30001450,
  "reviewType": "COMMUNITY",
  "screeningScorecardId": 30001010,
  "submissionEndDate": "2016-07-01T15:28:00.000Z",
  "submissions": [
    {
      "handle": "quesks",
      "placement": 1,
      "screeningScore": 100,
      "initialScore": 84.89,
      "finalScore": 85.44,
      "points": 0,
      "submissionStatus": "Active",
      "submissionDate": "2016-07-01T15:23:00.000Z",
      "_id": "58132931550dfb3b52b5f977"
    },
    {
      "handle": "besabestin",
      "placement": 2,
      "screeningScore": 100,
      "initialScore": 70.56,
      "finalScore": 70.56,
      "points": 0,
      "submissionStatus": "Failed Review",
      "submissionDate": "2016-07-01T15:27:00.000Z",
      "_id": "58132931550dfb3b52b5f976"
    },
    {
      "handle": "muvic082",
      "placement": 3,
      "screeningScore": 100,
      "initialScore": 55.11,
      "finalScore": 55.11,
      "points": 0,
      "submissionStatus": "Failed Review",
      "submissionDate": "2016-07-01T13:16:00.000Z",
      "_id": "58132931550dfb3b52b5f975"
    }
  ],
  "technology": [
    "CSS",
    "HTML5",
    "JSON",
    "JavaScript"
  ]
}